Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x9b2 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x45314): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x5cf91): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x5dc63): D:/STM32/STM32_CUBEIDE/_RTOS/_SIMPLE_QUEUE/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0xb6f5): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x3eb5b): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8

 <1><4c>: Abbrev Number: 4 (DW_TAG_typedef)
    <4d>   DW_AT_name        : (indirect string, offset: 0x27f0e): __uint8_t
    <51>   DW_AT_decl_file   : 2
    <52>   DW_AT_decl_line   : 43
    <53>   DW_AT_decl_column : 24
    <54>   DW_AT_type        : <0x58>
 <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
    <59>   DW_AT_byte_size   : 1
    <5a>   DW_AT_encoding    : 8	(unsigned char)
    <5b>   DW_AT_name        : (indirect string, offset: 0x1bc0a): unsigned char
 <1><5f>: Abbrev Number: 3 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 2
    <61>   DW_AT_encoding    : 5	(signed)
    <62>   DW_AT_name        : (indirect string, offset: 0x65f5b): short int
 <1><66>: Abbrev Number: 4 (DW_TAG_typedef)
    <67>   DW_AT_name        : (indirect string, offset: 0x6fe00): __uint16_t
    <6b>   DW_AT_decl_file   : 2
    <6c>   DW_AT_decl_line   : 57
    <6d>   DW_AT_decl_column : 25
    <6e>   DW_AT_type        : <0x72>
 <1><72>: Abbrev Number: 3 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 2
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0x2c94e): short unsigned int
 <1><79>: Abbrev Number: 3 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : (indirect string, offset: 0xbd4e): long int
 <1><80>: Abbrev Number: 4 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x56d3a): __uint32_t
    <85>   DW_AT_decl_file   : 2
    <86>   DW_AT_decl_line   : 79
    <87>   DW_AT_decl_column : 25
    <88>   DW_AT_type        : <0x8c>
 <1><8c>: Abbrev Number: 3 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x202b9): long unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_base_type)
    <94>   DW_AT_byte_size   : 8
    <95>   DW_AT_encoding    : 7	(unsigned)
    <96>   DW_AT_name        : (indirect string, offset: 0x1c43e): long long unsigned int
 <1><9a>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b>   DW_AT_name        : (indirect string, offset: 0x27f10): uint8_t
    <9f>   DW_AT_decl_file   : 3
    <a0>   DW_AT_decl_line   : 24
    <a1>   DW_AT_decl_column : 19
    <a2>   DW_AT_type        : <0x4c>
 <1><a6>: Abbrev Number: 4 (DW_TAG_typedef)
    <a7>   DW_AT_name        : (indirect string, offset: 0x63ddd): uint16_t
    <ab>   DW_AT_decl_file   : 3
    <ac>   DW_AT_decl_line   : 36
    <ad>   DW_AT_decl_column : 20
    <ae>   DW_AT_type        : <0x66>
 <1><b2>: Abbrev Number: 4 (DW_TAG_typedef)
    <b3>   DW_AT_name        : (indirect string, offset: 0x63774): uint32_t
    <b7>   DW_AT_decl_file   : 3
    <b8>   DW_AT_decl_line   : 48
    <b9>   DW_AT_decl_column : 20
    <ba>   DW_AT_type        : <0x80>
 <1><be>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <bf>   DW_AT_byte_size   : 4
 <1><c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <c1>   DW_AT_name        : (indirect string, offset: 0x64095): StackType_t
    <c5>   DW_AT_decl_file   : 4
    <c6>   DW_AT_decl_line   : 55
    <c7>   DW_AT_decl_column : 24
    <c8>   DW_AT_type        : <0xb2>
 <1><cc>: Abbrev Number: 4 (DW_TAG_typedef)
    <cd>   DW_AT_name        : (indirect string, offset: 0x7d482): UBaseType_t
    <d1>   DW_AT_decl_file   : 4
    <d2>   DW_AT_decl_line   : 57
    <d3>   DW_AT_decl_column : 23
    <d4>   DW_AT_type        : <0x8c>
 <1><d8>: Abbrev Number: 4 (DW_TAG_typedef)
    <d9>   DW_AT_name        : (indirect string, offset: 0x4afb7): TickType_t
    <dd>   DW_AT_decl_file   : 4
    <de>   DW_AT_decl_line   : 63
    <df>   DW_AT_decl_column : 19
    <e0>   DW_AT_type        : <0xb2>
 <1><e4>: Abbrev Number: 6 (DW_TAG_typedef)
    <e5>   DW_AT_name        : (indirect string, offset: 0x87de4): wint_t
    <e9>   DW_AT_decl_file   : 5
    <ea>   DW_AT_decl_line   : 350
    <ec>   DW_AT_decl_column : 23
    <ed>   DW_AT_type        : <0x30>
 <1><f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <f2>   DW_AT_name        : (indirect string, offset: 0x8e93b): _off_t
    <f6>   DW_AT_decl_file   : 6
    <f7>   DW_AT_decl_line   : 46
    <f8>   DW_AT_decl_column : 14
    <f9>   DW_AT_type        : <0x79>
 <1><fd>: Abbrev Number: 4 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x1e425): _fpos_t
    <102>   DW_AT_decl_file   : 6
    <103>   DW_AT_decl_line   : 116
    <104>   DW_AT_decl_column : 14
    <105>   DW_AT_type        : <0x79>
 <1><109>: Abbrev Number: 7 (DW_TAG_union_type)
    <10a>   DW_AT_byte_size   : 4
    <10b>   DW_AT_decl_file   : 6
    <10c>   DW_AT_decl_line   : 165
    <10d>   DW_AT_decl_column : 3
    <10e>   DW_AT_sibling     : <0x12b>
 <2><112>: Abbrev Number: 8 (DW_TAG_member)
    <113>   DW_AT_name        : (indirect string, offset: 0x80493): __wch
    <117>   DW_AT_decl_file   : 6
    <118>   DW_AT_decl_line   : 167
    <119>   DW_AT_decl_column : 12
    <11a>   DW_AT_type        : <0xe4>
 <2><11e>: Abbrev Number: 8 (DW_TAG_member)
    <11f>   DW_AT_name        : (indirect string, offset: 0x463f2): __wchb
    <123>   DW_AT_decl_file   : 6
    <124>   DW_AT_decl_line   : 168
    <125>   DW_AT_decl_column : 19
    <126>   DW_AT_type        : <0x12b>
 <2><12a>: Abbrev Number: 0
 <1><12b>: Abbrev Number: 9 (DW_TAG_array_type)
    <12c>   DW_AT_type        : <0x58>
    <130>   DW_AT_sibling     : <0x13b>
 <2><134>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <135>   DW_AT_type        : <0x30>
    <139>   DW_AT_upper_bound : 3
 <2><13a>: Abbrev Number: 0
 <1><13b>: Abbrev Number: 11 (DW_TAG_structure_type)
    <13c>   DW_AT_byte_size   : 8
    <13d>   DW_AT_decl_file   : 6
    <13e>   DW_AT_decl_line   : 162
    <13f>   DW_AT_decl_column : 9
    <140>   DW_AT_sibling     : <0x15f>
 <2><144>: Abbrev Number: 12 (DW_TAG_member)
    <145>   DW_AT_name        : (indirect string, offset: 0x2676f): __count
    <149>   DW_AT_decl_file   : 6
    <14a>   DW_AT_decl_line   : 164
    <14b>   DW_AT_decl_column : 7
    <14c>   DW_AT_type        : <0x29>
    <150>   DW_AT_data_member_location: 0
 <2><151>: Abbrev Number: 12 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x1bccd): __value
    <156>   DW_AT_decl_file   : 6
    <157>   DW_AT_decl_line   : 169
    <158>   DW_AT_decl_column : 5
    <159>   DW_AT_type        : <0x109>
    <15d>   DW_AT_data_member_location: 4
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 4 (DW_TAG_typedef)
    <160>   DW_AT_name        : (indirect string, offset: 0x4763c): _mbstate_t
    <164>   DW_AT_decl_file   : 6
    <165>   DW_AT_decl_line   : 170
    <166>   DW_AT_decl_column : 3
    <167>   DW_AT_type        : <0x13b>
 <1><16b>: Abbrev Number: 4 (DW_TAG_typedef)
    <16c>   DW_AT_name        : (indirect string, offset: 0x79d4f): __ULong
    <170>   DW_AT_decl_file   : 7
    <171>   DW_AT_decl_line   : 22
    <172>   DW_AT_decl_column : 25
    <173>   DW_AT_type        : <0x8c>
 <1><177>: Abbrev Number: 4 (DW_TAG_typedef)
    <178>   DW_AT_name        : (indirect string, offset: 0x4ac39): _LOCK_T
    <17c>   DW_AT_decl_file   : 8
    <17d>   DW_AT_decl_line   : 34
    <17e>   DW_AT_decl_column : 25
    <17f>   DW_AT_type        : <0x183>
 <1><183>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <184>   DW_AT_byte_size   : 4
    <185>   DW_AT_type        : <0x189>
 <1><189>: Abbrev Number: 14 (DW_TAG_structure_type)
    <18a>   DW_AT_name        : (indirect string, offset: 0x114d2): __lock
    <18e>   DW_AT_declaration : 1
 <1><18e>: Abbrev Number: 4 (DW_TAG_typedef)
    <18f>   DW_AT_name        : (indirect string, offset: 0x436ec): _flock_t
    <193>   DW_AT_decl_file   : 7
    <194>   DW_AT_decl_line   : 35
    <195>   DW_AT_decl_column : 27
    <196>   DW_AT_type        : <0x177>
 <1><19a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <19b>   DW_AT_name        : (indirect string, offset: 0x2ec6f): _Bigint
    <19f>   DW_AT_byte_size   : 24
    <1a0>   DW_AT_decl_file   : 7
    <1a1>   DW_AT_decl_line   : 52
    <1a2>   DW_AT_decl_column : 8
    <1a3>   DW_AT_sibling     : <0x1f4>
 <2><1a7>: Abbrev Number: 12 (DW_TAG_member)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x5109d): _next
    <1ac>   DW_AT_decl_file   : 7
    <1ad>   DW_AT_decl_line   : 54
    <1ae>   DW_AT_decl_column : 19
    <1af>   DW_AT_type        : <0x1f4>
    <1b3>   DW_AT_data_member_location: 0
 <2><1b4>: Abbrev Number: 16 (DW_TAG_member)
    <1b5>   DW_AT_name        : _k
    <1b8>   DW_AT_decl_file   : 7
    <1b9>   DW_AT_decl_line   : 55
    <1ba>   DW_AT_decl_column : 7
    <1bb>   DW_AT_type        : <0x29>
    <1bf>   DW_AT_data_member_location: 4
 <2><1c0>: Abbrev Number: 12 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x62304): _maxwds
    <1c5>   DW_AT_decl_file   : 7
    <1c6>   DW_AT_decl_line   : 55
    <1c7>   DW_AT_decl_column : 11
    <1c8>   DW_AT_type        : <0x29>
    <1cc>   DW_AT_data_member_location: 8
 <2><1cd>: Abbrev Number: 12 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x488c4): _sign
    <1d2>   DW_AT_decl_file   : 7
    <1d3>   DW_AT_decl_line   : 55
    <1d4>   DW_AT_decl_column : 20
    <1d5>   DW_AT_type        : <0x29>
    <1d9>   DW_AT_data_member_location: 12
 <2><1da>: Abbrev Number: 12 (DW_TAG_member)
    <1db>   DW_AT_name        : (indirect string, offset: 0x4878d): _wds
    <1df>   DW_AT_decl_file   : 7
    <1e0>   DW_AT_decl_line   : 55
    <1e1>   DW_AT_decl_column : 27
    <1e2>   DW_AT_type        : <0x29>
    <1e6>   DW_AT_data_member_location: 16
 <2><1e7>: Abbrev Number: 16 (DW_TAG_member)
    <1e8>   DW_AT_name        : _x
    <1eb>   DW_AT_decl_file   : 7
    <1ec>   DW_AT_decl_line   : 56
    <1ed>   DW_AT_decl_column : 11
    <1ee>   DW_AT_type        : <0x1fa>
    <1f2>   DW_AT_data_member_location: 20
 <2><1f3>: Abbrev Number: 0
 <1><1f4>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <1f5>   DW_AT_byte_size   : 4
    <1f6>   DW_AT_type        : <0x19a>
 <1><1fa>: Abbrev Number: 9 (DW_TAG_array_type)
    <1fb>   DW_AT_type        : <0x16b>
    <1ff>   DW_AT_sibling     : <0x20a>
 <2><203>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <204>   DW_AT_type        : <0x30>
    <208>   DW_AT_upper_bound : 0
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <20b>   DW_AT_name        : (indirect string, offset: 0x2519f): __tm
    <20f>   DW_AT_byte_size   : 36
    <210>   DW_AT_decl_file   : 7
    <211>   DW_AT_decl_line   : 60
    <212>   DW_AT_decl_column : 8
    <213>   DW_AT_sibling     : <0x28d>
 <2><217>: Abbrev Number: 12 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0x70271): __tm_sec
    <21c>   DW_AT_decl_file   : 7
    <21d>   DW_AT_decl_line   : 62
    <21e>   DW_AT_decl_column : 9
    <21f>   DW_AT_type        : <0x29>
    <223>   DW_AT_data_member_location: 0
 <2><224>: Abbrev Number: 12 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x938): __tm_min
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 63
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0x29>
    <230>   DW_AT_data_member_location: 4
 <2><231>: Abbrev Number: 12 (DW_TAG_member)
    <232>   DW_AT_name        : (indirect string, offset: 0x1d10a): __tm_hour
    <236>   DW_AT_decl_file   : 7
    <237>   DW_AT_decl_line   : 64
    <238>   DW_AT_decl_column : 9
    <239>   DW_AT_type        : <0x29>
    <23d>   DW_AT_data_member_location: 8
 <2><23e>: Abbrev Number: 12 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x4fbec): __tm_mday
    <243>   DW_AT_decl_file   : 7
    <244>   DW_AT_decl_line   : 65
    <245>   DW_AT_decl_column : 9
    <246>   DW_AT_type        : <0x29>
    <24a>   DW_AT_data_member_location: 12
 <2><24b>: Abbrev Number: 12 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x25ec): __tm_mon
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 66
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0x29>
    <257>   DW_AT_data_member_location: 16
 <2><258>: Abbrev Number: 12 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0x7eafa): __tm_year
    <25d>   DW_AT_decl_file   : 7
    <25e>   DW_AT_decl_line   : 67
    <25f>   DW_AT_decl_column : 9
    <260>   DW_AT_type        : <0x29>
    <264>   DW_AT_data_member_location: 20
 <2><265>: Abbrev Number: 12 (DW_TAG_member)
    <266>   DW_AT_name        : (indirect string, offset: 0x3a1ca): __tm_wday
    <26a>   DW_AT_decl_file   : 7
    <26b>   DW_AT_decl_line   : 68
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0x29>
    <271>   DW_AT_data_member_location: 24
 <2><272>: Abbrev Number: 12 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0x75685): __tm_yday
    <277>   DW_AT_decl_file   : 7
    <278>   DW_AT_decl_line   : 69
    <279>   DW_AT_decl_column : 9
    <27a>   DW_AT_type        : <0x29>
    <27e>   DW_AT_data_member_location: 28
 <2><27f>: Abbrev Number: 12 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x7abfa): __tm_isdst
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 70
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0x29>
    <28b>   DW_AT_data_member_location: 32
 <2><28c>: Abbrev Number: 0
 <1><28d>: Abbrev Number: 15 (DW_TAG_structure_type)
    <28e>   DW_AT_name        : (indirect string, offset: 0x5b59e): __sbuf
    <292>   DW_AT_byte_size   : 8
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 122
    <295>   DW_AT_decl_column : 8
    <296>   DW_AT_sibling     : <0x2b5>
 <2><29a>: Abbrev Number: 12 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0x87050): _base
    <29f>   DW_AT_decl_file   : 7
    <2a0>   DW_AT_decl_line   : 123
    <2a1>   DW_AT_decl_column : 17
    <2a2>   DW_AT_type        : <0x2b5>
    <2a6>   DW_AT_data_member_location: 0
 <2><2a7>: Abbrev Number: 12 (DW_TAG_member)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x8e452): _size
    <2ac>   DW_AT_decl_file   : 7
    <2ad>   DW_AT_decl_line   : 124
    <2ae>   DW_AT_decl_column : 6
    <2af>   DW_AT_type        : <0x29>
    <2b3>   DW_AT_data_member_location: 4
 <2><2b4>: Abbrev Number: 0
 <1><2b5>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <2b6>   DW_AT_byte_size   : 4
    <2b7>   DW_AT_type        : <0x58>
 <1><2bb>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x93f34): _reent
    <2c0>   DW_AT_byte_size   : 96
    <2c1>   DW_AT_decl_file   : 7
    <2c2>   DW_AT_decl_line   : 377
    <2c4>   DW_AT_decl_column : 8
    <2c5>   DW_AT_sibling     : <0x3fe>
 <2><2c9>: Abbrev Number: 18 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x8e5da): _errno
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 381
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x29>
    <2d6>   DW_AT_data_member_location: 0
 <2><2d7>: Abbrev Number: 18 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x9346b): _stdin
    <2dc>   DW_AT_decl_file   : 7
    <2dd>   DW_AT_decl_line   : 386
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0x651>
    <2e4>   DW_AT_data_member_location: 4
 <2><2e5>: Abbrev Number: 18 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x93e17): _stdout
    <2ea>   DW_AT_decl_file   : 7
    <2eb>   DW_AT_decl_line   : 386
    <2ed>   DW_AT_decl_column : 20
    <2ee>   DW_AT_type        : <0x651>
    <2f2>   DW_AT_data_member_location: 8
 <2><2f3>: Abbrev Number: 18 (DW_TAG_member)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x93dc0): _stderr
    <2f8>   DW_AT_decl_file   : 7
    <2f9>   DW_AT_decl_line   : 386
    <2fb>   DW_AT_decl_column : 30
    <2fc>   DW_AT_type        : <0x651>
    <300>   DW_AT_data_member_location: 12
 <2><301>: Abbrev Number: 18 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0x565b7): _inc
    <306>   DW_AT_decl_file   : 7
    <307>   DW_AT_decl_line   : 388
    <309>   DW_AT_decl_column : 8
    <30a>   DW_AT_type        : <0x29>
    <30e>   DW_AT_data_member_location: 16
 <2><30f>: Abbrev Number: 18 (DW_TAG_member)
    <310>   DW_AT_name        : (indirect string, offset: 0x6beba): _emergency
    <314>   DW_AT_decl_file   : 7
    <315>   DW_AT_decl_line   : 390
    <317>   DW_AT_decl_column : 9
    <318>   DW_AT_type        : <0x565>
    <31c>   DW_AT_data_member_location: 20
 <2><31d>: Abbrev Number: 18 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x3bc90): __sdidinit
    <322>   DW_AT_decl_file   : 7
    <323>   DW_AT_decl_line   : 392
    <325>   DW_AT_decl_column : 7
    <326>   DW_AT_type        : <0x29>
    <32a>   DW_AT_data_member_location: 24
 <2><32b>: Abbrev Number: 18 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0xc9aa): _unspecified_locale_info
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 394
    <333>   DW_AT_decl_column : 7
    <334>   DW_AT_type        : <0x29>
    <338>   DW_AT_data_member_location: 28
 <2><339>: Abbrev Number: 18 (DW_TAG_member)
    <33a>   DW_AT_name        : (indirect string, offset: 0x79029): _locale
    <33e>   DW_AT_decl_file   : 7
    <33f>   DW_AT_decl_line   : 395
    <341>   DW_AT_decl_column : 22
    <342>   DW_AT_type        : <0x7b9>
    <346>   DW_AT_data_member_location: 32
 <2><347>: Abbrev Number: 19 (DW_TAG_member)
    <348>   DW_AT_name        : _mp
    <34c>   DW_AT_decl_file   : 7
    <34d>   DW_AT_decl_line   : 397
    <34f>   DW_AT_decl_column : 18
    <350>   DW_AT_type        : <0x7bf>
    <354>   DW_AT_data_member_location: 36
 <2><355>: Abbrev Number: 18 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x1520e): __cleanup
    <35a>   DW_AT_decl_file   : 7
    <35b>   DW_AT_decl_line   : 399
    <35d>   DW_AT_decl_column : 10
    <35e>   DW_AT_type        : <0x7d0>
    <362>   DW_AT_data_member_location: 40
 <2><363>: Abbrev Number: 18 (DW_TAG_member)
    <364>   DW_AT_name        : (indirect string, offset: 0x22108): _gamma_signgam
    <368>   DW_AT_decl_file   : 7
    <369>   DW_AT_decl_line   : 401
    <36b>   DW_AT_decl_column : 7
    <36c>   DW_AT_type        : <0x29>
    <370>   DW_AT_data_member_location: 44
 <2><371>: Abbrev Number: 18 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x6db4b): _cvtlen
    <376>   DW_AT_decl_file   : 7
    <377>   DW_AT_decl_line   : 404
    <379>   DW_AT_decl_column : 7
    <37a>   DW_AT_type        : <0x29>
    <37e>   DW_AT_data_member_location: 48
 <2><37f>: Abbrev Number: 18 (DW_TAG_member)
    <380>   DW_AT_name        : (indirect string, offset: 0x3f728): _cvtbuf
    <384>   DW_AT_decl_file   : 7
    <385>   DW_AT_decl_line   : 405
    <387>   DW_AT_decl_column : 9
    <388>   DW_AT_type        : <0x565>
    <38c>   DW_AT_data_member_location: 52
 <2><38d>: Abbrev Number: 18 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x66401): _r48
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 407
    <395>   DW_AT_decl_column : 19
    <396>   DW_AT_type        : <0x7d6>
    <39a>   DW_AT_data_member_location: 56
 <2><39b>: Abbrev Number: 18 (DW_TAG_member)
    <39c>   DW_AT_name        : (indirect string, offset: 0x71de3): _localtime_buf
    <3a0>   DW_AT_decl_file   : 7
    <3a1>   DW_AT_decl_line   : 408
    <3a3>   DW_AT_decl_column : 16
    <3a4>   DW_AT_type        : <0x7dc>
    <3a8>   DW_AT_data_member_location: 60
 <2><3a9>: Abbrev Number: 18 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x20264): _asctime_buf
    <3ae>   DW_AT_decl_file   : 7
    <3af>   DW_AT_decl_line   : 409
    <3b1>   DW_AT_decl_column : 9
    <3b2>   DW_AT_type        : <0x565>
    <3b6>   DW_AT_data_member_location: 64
 <2><3b7>: Abbrev Number: 18 (DW_TAG_member)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x706e3): _sig_func
    <3bc>   DW_AT_decl_file   : 7
    <3bd>   DW_AT_decl_line   : 412
    <3bf>   DW_AT_decl_column : 12
    <3c0>   DW_AT_type        : <0x7ed>
    <3c4>   DW_AT_data_member_location: 68
 <2><3c5>: Abbrev Number: 18 (DW_TAG_member)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x62142): __sglue
    <3ca>   DW_AT_decl_file   : 7
    <3cb>   DW_AT_decl_line   : 420
    <3cd>   DW_AT_decl_column : 16
    <3ce>   DW_AT_type        : <0x612>
    <3d2>   DW_AT_data_member_location: 72
 <2><3d3>: Abbrev Number: 18 (DW_TAG_member)
    <3d4>   DW_AT_name        : (indirect string, offset: 0x24da1): __sf
    <3d8>   DW_AT_decl_file   : 7
    <3d9>   DW_AT_decl_line   : 421
    <3db>   DW_AT_decl_column : 11
    <3dc>   DW_AT_type        : <0x651>
    <3e0>   DW_AT_data_member_location: 84
 <2><3e1>: Abbrev Number: 18 (DW_TAG_member)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x3e23c): _misc
    <3e6>   DW_AT_decl_file   : 7
    <3e7>   DW_AT_decl_line   : 422
    <3e9>   DW_AT_decl_column : 23
    <3ea>   DW_AT_type        : <0x7f9>
    <3ee>   DW_AT_data_member_location: 88
 <2><3ef>: Abbrev Number: 18 (DW_TAG_member)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x551dd): _signal_buf
    <3f4>   DW_AT_decl_file   : 7
    <3f5>   DW_AT_decl_line   : 423
    <3f7>   DW_AT_decl_column : 9
    <3f8>   DW_AT_type        : <0x565>
    <3fc>   DW_AT_data_member_location: 92
 <2><3fd>: Abbrev Number: 0
 <1><3fe>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <3ff>   DW_AT_byte_size   : 4
    <400>   DW_AT_type        : <0x2bb>
 <1><404>: Abbrev Number: 15 (DW_TAG_structure_type)
    <405>   DW_AT_name        : (indirect string, offset: 0x68edd): __sFILE
    <409>   DW_AT_byte_size   : 104
    <40a>   DW_AT_decl_file   : 7
    <40b>   DW_AT_decl_line   : 186
    <40c>   DW_AT_decl_column : 8
    <40d>   DW_AT_sibling     : <0x547>
 <2><411>: Abbrev Number: 16 (DW_TAG_member)
    <412>   DW_AT_name        : _p
    <415>   DW_AT_decl_file   : 7
    <416>   DW_AT_decl_line   : 187
    <417>   DW_AT_decl_column : 18
    <418>   DW_AT_type        : <0x2b5>
    <41c>   DW_AT_data_member_location: 0
 <2><41d>: Abbrev Number: 16 (DW_TAG_member)
    <41e>   DW_AT_name        : _r
    <421>   DW_AT_decl_file   : 7
    <422>   DW_AT_decl_line   : 188
    <423>   DW_AT_decl_column : 7
    <424>   DW_AT_type        : <0x29>
    <428>   DW_AT_data_member_location: 4
 <2><429>: Abbrev Number: 16 (DW_TAG_member)
    <42a>   DW_AT_name        : _w
    <42d>   DW_AT_decl_file   : 7
    <42e>   DW_AT_decl_line   : 189
    <42f>   DW_AT_decl_column : 7
    <430>   DW_AT_type        : <0x29>
    <434>   DW_AT_data_member_location: 8
 <2><435>: Abbrev Number: 12 (DW_TAG_member)
    <436>   DW_AT_name        : (indirect string, offset: 0x3ec09): _flags
    <43a>   DW_AT_decl_file   : 7
    <43b>   DW_AT_decl_line   : 190
    <43c>   DW_AT_decl_column : 9
    <43d>   DW_AT_type        : <0x5f>
    <441>   DW_AT_data_member_location: 12
 <2><442>: Abbrev Number: 12 (DW_TAG_member)
    <443>   DW_AT_name        : (indirect string, offset: 0x14b83): _file
    <447>   DW_AT_decl_file   : 7
    <448>   DW_AT_decl_line   : 191
    <449>   DW_AT_decl_column : 9
    <44a>   DW_AT_type        : <0x5f>
    <44e>   DW_AT_data_member_location: 14
 <2><44f>: Abbrev Number: 16 (DW_TAG_member)
    <450>   DW_AT_name        : _bf
    <454>   DW_AT_decl_file   : 7
    <455>   DW_AT_decl_line   : 192
    <456>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0x28d>
    <45b>   DW_AT_data_member_location: 16
 <2><45c>: Abbrev Number: 12 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0x3f091): _lbfsize
    <461>   DW_AT_decl_file   : 7
    <462>   DW_AT_decl_line   : 193
    <463>   DW_AT_decl_column : 7
    <464>   DW_AT_type        : <0x29>
    <468>   DW_AT_data_member_location: 24
 <2><469>: Abbrev Number: 12 (DW_TAG_member)
    <46a>   DW_AT_name        : (indirect string, offset: 0x91dca): _data
    <46e>   DW_AT_decl_file   : 7
    <46f>   DW_AT_decl_line   : 196
    <470>   DW_AT_decl_column : 18
    <471>   DW_AT_type        : <0x3fe>
    <475>   DW_AT_data_member_location: 28
 <2><476>: Abbrev Number: 12 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0x799d0): _cookie
    <47b>   DW_AT_decl_file   : 7
    <47c>   DW_AT_decl_line   : 200
    <47d>   DW_AT_decl_column : 10
    <47e>   DW_AT_type        : <0xbe>
    <482>   DW_AT_data_member_location: 32
 <2><483>: Abbrev Number: 12 (DW_TAG_member)
    <484>   DW_AT_name        : (indirect string, offset: 0x6bdd5): _read
    <488>   DW_AT_decl_file   : 7
    <489>   DW_AT_decl_line   : 202
    <48a>   DW_AT_decl_column : 29
    <48b>   DW_AT_type        : <0x577>
    <48f>   DW_AT_data_member_location: 36
 <2><490>: Abbrev Number: 12 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x11508): _write
    <495>   DW_AT_decl_file   : 7
    <496>   DW_AT_decl_line   : 204
    <497>   DW_AT_decl_column : 29
    <498>   DW_AT_type        : <0x5a1>
    <49c>   DW_AT_data_member_location: 40
 <2><49d>: Abbrev Number: 12 (DW_TAG_member)
    <49e>   DW_AT_name        : (indirect string, offset: 0x85601): _seek
    <4a2>   DW_AT_decl_file   : 7
    <4a3>   DW_AT_decl_line   : 207
    <4a4>   DW_AT_decl_column : 13
    <4a5>   DW_AT_type        : <0x5c5>
    <4a9>   DW_AT_data_member_location: 44
 <2><4aa>: Abbrev Number: 12 (DW_TAG_member)
    <4ab>   DW_AT_name        : (indirect string, offset: 0x3c845): _close
    <4af>   DW_AT_decl_file   : 7
    <4b0>   DW_AT_decl_line   : 208
    <4b1>   DW_AT_decl_column : 9
    <4b2>   DW_AT_type        : <0x5df>
    <4b6>   DW_AT_data_member_location: 48
 <2><4b7>: Abbrev Number: 16 (DW_TAG_member)
    <4b8>   DW_AT_name        : _ub
    <4bc>   DW_AT_decl_file   : 7
    <4bd>   DW_AT_decl_line   : 211
    <4be>   DW_AT_decl_column : 17
    <4bf>   DW_AT_type        : <0x28d>
    <4c3>   DW_AT_data_member_location: 52
 <2><4c4>: Abbrev Number: 16 (DW_TAG_member)
    <4c5>   DW_AT_name        : _up
    <4c9>   DW_AT_decl_file   : 7
    <4ca>   DW_AT_decl_line   : 212
    <4cb>   DW_AT_decl_column : 18
    <4cc>   DW_AT_type        : <0x2b5>
    <4d0>   DW_AT_data_member_location: 60
 <2><4d1>: Abbrev Number: 16 (DW_TAG_member)
    <4d2>   DW_AT_name        : _ur
    <4d6>   DW_AT_decl_file   : 7
    <4d7>   DW_AT_decl_line   : 213
    <4d8>   DW_AT_decl_column : 7
    <4d9>   DW_AT_type        : <0x29>
    <4dd>   DW_AT_data_member_location: 64
 <2><4de>: Abbrev Number: 12 (DW_TAG_member)
    <4df>   DW_AT_name        : (indirect string, offset: 0x24e5f): _ubuf
    <4e3>   DW_AT_decl_file   : 7
    <4e4>   DW_AT_decl_line   : 216
    <4e5>   DW_AT_decl_column : 17
    <4e6>   DW_AT_type        : <0x5e5>
    <4ea>   DW_AT_data_member_location: 68
 <2><4eb>: Abbrev Number: 12 (DW_TAG_member)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x5d0d4): _nbuf
    <4f0>   DW_AT_decl_file   : 7
    <4f1>   DW_AT_decl_line   : 217
    <4f2>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x5f5>
    <4f7>   DW_AT_data_member_location: 71
 <2><4f8>: Abbrev Number: 16 (DW_TAG_member)
    <4f9>   DW_AT_name        : _lb
    <4fd>   DW_AT_decl_file   : 7
    <4fe>   DW_AT_decl_line   : 220
    <4ff>   DW_AT_decl_column : 17
    <500>   DW_AT_type        : <0x28d>
    <504>   DW_AT_data_member_location: 72
 <2><505>: Abbrev Number: 12 (DW_TAG_member)
    <506>   DW_AT_name        : (indirect string, offset: 0x8e11f): _blksize
    <50a>   DW_AT_decl_file   : 7
    <50b>   DW_AT_decl_line   : 223
    <50c>   DW_AT_decl_column : 7
    <50d>   DW_AT_type        : <0x29>
    <511>   DW_AT_data_member_location: 80
 <2><512>: Abbrev Number: 12 (DW_TAG_member)
    <513>   DW_AT_name        : (indirect string, offset: 0x2be11): _offset
    <517>   DW_AT_decl_file   : 7
    <518>   DW_AT_decl_line   : 224
    <519>   DW_AT_decl_column : 10
    <51a>   DW_AT_type        : <0xf1>
    <51e>   DW_AT_data_member_location: 84
 <2><51f>: Abbrev Number: 12 (DW_TAG_member)
    <520>   DW_AT_name        : (indirect string, offset: 0x114d3): _lock
    <524>   DW_AT_decl_file   : 7
    <525>   DW_AT_decl_line   : 231
    <526>   DW_AT_decl_column : 12
    <527>   DW_AT_type        : <0x18e>
    <52b>   DW_AT_data_member_location: 88
 <2><52c>: Abbrev Number: 12 (DW_TAG_member)
    <52d>   DW_AT_name        : (indirect string, offset: 0x10134): _mbstate
    <531>   DW_AT_decl_file   : 7
    <532>   DW_AT_decl_line   : 233
    <533>   DW_AT_decl_column : 14
    <534>   DW_AT_type        : <0x15f>
    <538>   DW_AT_data_member_location: 92
 <2><539>: Abbrev Number: 12 (DW_TAG_member)
    <53a>   DW_AT_name        : (indirect string, offset: 0x6f6c6): _flags2
    <53e>   DW_AT_decl_file   : 7
    <53f>   DW_AT_decl_line   : 234
    <540>   DW_AT_decl_column : 9
    <541>   DW_AT_type        : <0x29>
    <545>   DW_AT_data_member_location: 100
 <2><546>: Abbrev Number: 0
 <1><547>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <548>   DW_AT_prototyped  : 1
    <548>   DW_AT_type        : <0x29>
    <54c>   DW_AT_sibling     : <0x565>
 <2><550>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <551>   DW_AT_type        : <0x3fe>
 <2><555>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <556>   DW_AT_type        : <0xbe>
 <2><55a>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <55b>   DW_AT_type        : <0x565>
 <2><55f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <560>   DW_AT_type        : <0x29>
 <2><564>: Abbrev Number: 0
 <1><565>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <566>   DW_AT_byte_size   : 4
    <567>   DW_AT_type        : <0x56b>
 <1><56b>: Abbrev Number: 3 (DW_TAG_base_type)
    <56c>   DW_AT_byte_size   : 1
    <56d>   DW_AT_encoding    : 8	(unsigned char)
    <56e>   DW_AT_name        : (indirect string, offset: 0x2c1b5): char
 <1><572>: Abbrev Number: 22 (DW_TAG_const_type)
    <573>   DW_AT_type        : <0x56b>
 <1><577>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <578>   DW_AT_byte_size   : 4
    <579>   DW_AT_type        : <0x547>
 <1><57d>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <57e>   DW_AT_prototyped  : 1
    <57e>   DW_AT_type        : <0x29>
    <582>   DW_AT_sibling     : <0x59b>
 <2><586>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <587>   DW_AT_type        : <0x3fe>
 <2><58b>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <58c>   DW_AT_type        : <0xbe>
 <2><590>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <591>   DW_AT_type        : <0x59b>
 <2><595>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <596>   DW_AT_type        : <0x29>
 <2><59a>: Abbrev Number: 0
 <1><59b>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <59c>   DW_AT_byte_size   : 4
    <59d>   DW_AT_type        : <0x572>
 <1><5a1>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5a2>   DW_AT_byte_size   : 4
    <5a3>   DW_AT_type        : <0x57d>
 <1><5a7>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5a8>   DW_AT_prototyped  : 1
    <5a8>   DW_AT_type        : <0xfd>
    <5ac>   DW_AT_sibling     : <0x5c5>
 <2><5b0>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5b1>   DW_AT_type        : <0x3fe>
 <2><5b5>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5b6>   DW_AT_type        : <0xbe>
 <2><5ba>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5bb>   DW_AT_type        : <0xfd>
 <2><5bf>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5c0>   DW_AT_type        : <0x29>
 <2><5c4>: Abbrev Number: 0
 <1><5c5>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5c6>   DW_AT_byte_size   : 4
    <5c7>   DW_AT_type        : <0x5a7>
 <1><5cb>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5cc>   DW_AT_prototyped  : 1
    <5cc>   DW_AT_type        : <0x29>
    <5d0>   DW_AT_sibling     : <0x5df>
 <2><5d4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5d5>   DW_AT_type        : <0x3fe>
 <2><5d9>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5da>   DW_AT_type        : <0xbe>
 <2><5de>: Abbrev Number: 0
 <1><5df>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5e0>   DW_AT_byte_size   : 4
    <5e1>   DW_AT_type        : <0x5cb>
 <1><5e5>: Abbrev Number: 9 (DW_TAG_array_type)
    <5e6>   DW_AT_type        : <0x58>
    <5ea>   DW_AT_sibling     : <0x5f5>
 <2><5ee>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <5ef>   DW_AT_type        : <0x30>
    <5f3>   DW_AT_upper_bound : 2
 <2><5f4>: Abbrev Number: 0
 <1><5f5>: Abbrev Number: 9 (DW_TAG_array_type)
    <5f6>   DW_AT_type        : <0x58>
    <5fa>   DW_AT_sibling     : <0x605>
 <2><5fe>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <5ff>   DW_AT_type        : <0x30>
    <603>   DW_AT_upper_bound : 0
 <2><604>: Abbrev Number: 0
 <1><605>: Abbrev Number: 6 (DW_TAG_typedef)
    <606>   DW_AT_name        : (indirect string, offset: 0x6d974): __FILE
    <60a>   DW_AT_decl_file   : 7
    <60b>   DW_AT_decl_line   : 292
    <60d>   DW_AT_decl_column : 26
    <60e>   DW_AT_type        : <0x404>
 <1><612>: Abbrev Number: 17 (DW_TAG_structure_type)
    <613>   DW_AT_name        : (indirect string, offset: 0x6910c): _glue
    <617>   DW_AT_byte_size   : 12
    <618>   DW_AT_decl_file   : 7
    <619>   DW_AT_decl_line   : 296
    <61b>   DW_AT_decl_column : 8
    <61c>   DW_AT_sibling     : <0x64b>
 <2><620>: Abbrev Number: 18 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0x5109d): _next
    <625>   DW_AT_decl_file   : 7
    <626>   DW_AT_decl_line   : 298
    <628>   DW_AT_decl_column : 17
    <629>   DW_AT_type        : <0x64b>
    <62d>   DW_AT_data_member_location: 0
 <2><62e>: Abbrev Number: 18 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x3333a): _niobs
    <633>   DW_AT_decl_file   : 7
    <634>   DW_AT_decl_line   : 299
    <636>   DW_AT_decl_column : 7
    <637>   DW_AT_type        : <0x29>
    <63b>   DW_AT_data_member_location: 4
 <2><63c>: Abbrev Number: 18 (DW_TAG_member)
    <63d>   DW_AT_name        : (indirect string, offset: 0x44ef2): _iobs
    <641>   DW_AT_decl_file   : 7
    <642>   DW_AT_decl_line   : 300
    <644>   DW_AT_decl_column : 11
    <645>   DW_AT_type        : <0x651>
    <649>   DW_AT_data_member_location: 8
 <2><64a>: Abbrev Number: 0
 <1><64b>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <64c>   DW_AT_byte_size   : 4
    <64d>   DW_AT_type        : <0x612>
 <1><651>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <652>   DW_AT_byte_size   : 4
    <653>   DW_AT_type        : <0x605>
 <1><657>: Abbrev Number: 17 (DW_TAG_structure_type)
    <658>   DW_AT_name        : (indirect string, offset: 0x2f6b9): _rand48
    <65c>   DW_AT_byte_size   : 24
    <65d>   DW_AT_decl_file   : 7
    <65e>   DW_AT_decl_line   : 324
    <660>   DW_AT_decl_column : 8
    <661>   DW_AT_sibling     : <0x69e>
 <2><665>: Abbrev Number: 18 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0x855c6): _seed
    <66a>   DW_AT_decl_file   : 7
    <66b>   DW_AT_decl_line   : 325
    <66d>   DW_AT_decl_column : 18
    <66e>   DW_AT_type        : <0x69e>
    <672>   DW_AT_data_member_location: 0
 <2><673>: Abbrev Number: 18 (DW_TAG_member)
    <674>   DW_AT_name        : (indirect string, offset: 0xbb5f): _mult
    <678>   DW_AT_decl_file   : 7
    <679>   DW_AT_decl_line   : 326
    <67b>   DW_AT_decl_column : 18
    <67c>   DW_AT_type        : <0x69e>
    <680>   DW_AT_data_member_location: 6
 <2><681>: Abbrev Number: 18 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x464ff): _add
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 327
    <689>   DW_AT_decl_column : 18
    <68a>   DW_AT_type        : <0x72>
    <68e>   DW_AT_data_member_location: 12
 <2><68f>: Abbrev Number: 18 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x51098): _rand_next
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 330
    <697>   DW_AT_decl_column : 36
    <698>   DW_AT_type        : <0x93>
    <69c>   DW_AT_data_member_location: 16
 <2><69d>: Abbrev Number: 0
 <1><69e>: Abbrev Number: 9 (DW_TAG_array_type)
    <69f>   DW_AT_type        : <0x72>
    <6a3>   DW_AT_sibling     : <0x6ae>
 <2><6a7>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <6a8>   DW_AT_type        : <0x30>
    <6ac>   DW_AT_upper_bound : 2
 <2><6ad>: Abbrev Number: 0
 <1><6ae>: Abbrev Number: 17 (DW_TAG_structure_type)
    <6af>   DW_AT_name        : (indirect string, offset: 0x3de23): _mprec
    <6b3>   DW_AT_byte_size   : 16
    <6b4>   DW_AT_decl_file   : 7
    <6b5>   DW_AT_decl_line   : 349
    <6b7>   DW_AT_decl_column : 8
    <6b8>   DW_AT_sibling     : <0x6f5>
 <2><6bc>: Abbrev Number: 18 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x87971): _result
    <6c1>   DW_AT_decl_file   : 7
    <6c2>   DW_AT_decl_line   : 352
    <6c4>   DW_AT_decl_column : 19
    <6c5>   DW_AT_type        : <0x1f4>
    <6c9>   DW_AT_data_member_location: 0
 <2><6ca>: Abbrev Number: 18 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x59c2b): _result_k
    <6cf>   DW_AT_decl_file   : 7
    <6d0>   DW_AT_decl_line   : 353
    <6d2>   DW_AT_decl_column : 7
    <6d3>   DW_AT_type        : <0x29>
    <6d7>   DW_AT_data_member_location: 4
 <2><6d8>: Abbrev Number: 18 (DW_TAG_member)
    <6d9>   DW_AT_name        : (indirect string, offset: 0x41161): _p5s
    <6dd>   DW_AT_decl_file   : 7
    <6de>   DW_AT_decl_line   : 354
    <6e0>   DW_AT_decl_column : 19
    <6e1>   DW_AT_type        : <0x1f4>
    <6e5>   DW_AT_data_member_location: 8
 <2><6e6>: Abbrev Number: 18 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x4e97a): _freelist
    <6eb>   DW_AT_decl_file   : 7
    <6ec>   DW_AT_decl_line   : 355
    <6ee>   DW_AT_decl_column : 20
    <6ef>   DW_AT_type        : <0x6f5>
    <6f3>   DW_AT_data_member_location: 12
 <2><6f4>: Abbrev Number: 0
 <1><6f5>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <6f6>   DW_AT_byte_size   : 4
    <6f7>   DW_AT_type        : <0x1f4>
 <1><6fb>: Abbrev Number: 17 (DW_TAG_structure_type)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x41129): _misc_reent
    <700>   DW_AT_byte_size   : 80
    <701>   DW_AT_decl_file   : 7
    <702>   DW_AT_decl_line   : 359
    <704>   DW_AT_decl_column : 8
    <705>   DW_AT_sibling     : <0x7a4>
 <2><709>: Abbrev Number: 18 (DW_TAG_member)
    <70a>   DW_AT_name        : (indirect string, offset: 0x7ca38): _strtok_last
    <70e>   DW_AT_decl_file   : 7
    <70f>   DW_AT_decl_line   : 362
    <711>   DW_AT_decl_column : 9
    <712>   DW_AT_type        : <0x565>
    <716>   DW_AT_data_member_location: 0
 <2><717>: Abbrev Number: 18 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0x3c1e5): _mblen_state
    <71c>   DW_AT_decl_file   : 7
    <71d>   DW_AT_decl_line   : 363
    <71f>   DW_AT_decl_column : 14
    <720>   DW_AT_type        : <0x15f>
    <724>   DW_AT_data_member_location: 4
 <2><725>: Abbrev Number: 18 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x7ca45): _wctomb_state
    <72a>   DW_AT_decl_file   : 7
    <72b>   DW_AT_decl_line   : 364
    <72d>   DW_AT_decl_column : 14
    <72e>   DW_AT_type        : <0x15f>
    <732>   DW_AT_data_member_location: 12
 <2><733>: Abbrev Number: 18 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x74c68): _mbtowc_state
    <738>   DW_AT_decl_file   : 7
    <739>   DW_AT_decl_line   : 365
    <73b>   DW_AT_decl_column : 14
    <73c>   DW_AT_type        : <0x15f>
    <740>   DW_AT_data_member_location: 20
 <2><741>: Abbrev Number: 18 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0x2203e): _l64a_buf
    <746>   DW_AT_decl_file   : 7
    <747>   DW_AT_decl_line   : 366
    <749>   DW_AT_decl_column : 8
    <74a>   DW_AT_type        : <0x7a4>
    <74e>   DW_AT_data_member_location: 28
 <2><74f>: Abbrev Number: 18 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x7bc34): _getdate_err
    <754>   DW_AT_decl_file   : 7
    <755>   DW_AT_decl_line   : 367
    <757>   DW_AT_decl_column : 7
    <758>   DW_AT_type        : <0x29>
    <75c>   DW_AT_data_member_location: 36
 <2><75d>: Abbrev Number: 18 (DW_TAG_member)
    <75e>   DW_AT_name        : (indirect string, offset: 0x42188): _mbrlen_state
    <762>   DW_AT_decl_file   : 7
    <763>   DW_AT_decl_line   : 368
    <765>   DW_AT_decl_column : 14
    <766>   DW_AT_type        : <0x15f>
    <76a>   DW_AT_data_member_location: 40
 <2><76b>: Abbrev Number: 18 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x7bf74): _mbrtowc_state
    <770>   DW_AT_decl_file   : 7
    <771>   DW_AT_decl_line   : 369
    <773>   DW_AT_decl_column : 14
    <774>   DW_AT_type        : <0x15f>
    <778>   DW_AT_data_member_location: 48
 <2><779>: Abbrev Number: 18 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0x26b0c): _mbsrtowcs_state
    <77e>   DW_AT_decl_file   : 7
    <77f>   DW_AT_decl_line   : 370
    <781>   DW_AT_decl_column : 14
    <782>   DW_AT_type        : <0x15f>
    <786>   DW_AT_data_member_location: 56
 <2><787>: Abbrev Number: 18 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0x2a4b3): _wcrtomb_state
    <78c>   DW_AT_decl_file   : 7
    <78d>   DW_AT_decl_line   : 371
    <78f>   DW_AT_decl_column : 14
    <790>   DW_AT_type        : <0x15f>
    <794>   DW_AT_data_member_location: 64
 <2><795>: Abbrev Number: 18 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x4d347): _wcsrtombs_state
    <79a>   DW_AT_decl_file   : 7
    <79b>   DW_AT_decl_line   : 372
    <79d>   DW_AT_decl_column : 14
    <79e>   DW_AT_type        : <0x15f>
    <7a2>   DW_AT_data_member_location: 72
 <2><7a3>: Abbrev Number: 0
 <1><7a4>: Abbrev Number: 9 (DW_TAG_array_type)
    <7a5>   DW_AT_type        : <0x56b>
    <7a9>   DW_AT_sibling     : <0x7b4>
 <2><7ad>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <7ae>   DW_AT_type        : <0x30>
    <7b2>   DW_AT_upper_bound : 7
 <2><7b3>: Abbrev Number: 0
 <1><7b4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x754fd): __locale_t
    <7b9>   DW_AT_declaration : 1
 <1><7b9>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7ba>   DW_AT_byte_size   : 4
    <7bb>   DW_AT_type        : <0x7b4>
 <1><7bf>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7c0>   DW_AT_byte_size   : 4
    <7c1>   DW_AT_type        : <0x6ae>
 <1><7c5>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7c6>   DW_AT_prototyped  : 1
    <7c6>   DW_AT_sibling     : <0x7d0>
 <2><7ca>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <7cb>   DW_AT_type        : <0x3fe>
 <2><7cf>: Abbrev Number: 0
 <1><7d0>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7d1>   DW_AT_byte_size   : 4
    <7d2>   DW_AT_type        : <0x7c5>
 <1><7d6>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7d7>   DW_AT_byte_size   : 4
    <7d8>   DW_AT_type        : <0x657>
 <1><7dc>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7dd>   DW_AT_byte_size   : 4
    <7de>   DW_AT_type        : <0x20a>
 <1><7e2>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7e3>   DW_AT_prototyped  : 1
    <7e3>   DW_AT_sibling     : <0x7ed>
 <2><7e7>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <7e8>   DW_AT_type        : <0x29>
 <2><7ec>: Abbrev Number: 0
 <1><7ed>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7ee>   DW_AT_byte_size   : 4
    <7ef>   DW_AT_type        : <0x7f3>
 <1><7f3>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7f4>   DW_AT_byte_size   : 4
    <7f5>   DW_AT_type        : <0x7e2>
 <1><7f9>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7fa>   DW_AT_byte_size   : 4
    <7fb>   DW_AT_type        : <0x6fb>
 <1><7ff>: Abbrev Number: 17 (DW_TAG_structure_type)
    <800>   DW_AT_name        : (indirect string, offset: 0x72916): xSTATIC_LIST_ITEM
    <804>   DW_AT_byte_size   : 20
    <805>   DW_AT_decl_file   : 9
    <806>   DW_AT_decl_line   : 948
    <808>   DW_AT_decl_column : 8
    <809>   DW_AT_sibling     : <0x82a>
 <2><80d>: Abbrev Number: 18 (DW_TAG_member)
    <80e>   DW_AT_name        : (indirect string, offset: 0x1bc19): xDummy1
    <812>   DW_AT_decl_file   : 9
    <813>   DW_AT_decl_line   : 950
    <815>   DW_AT_decl_column : 13
    <816>   DW_AT_type        : <0xd8>
    <81a>   DW_AT_data_member_location: 0
 <2><81b>: Abbrev Number: 18 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0x315f9): pvDummy2
    <820>   DW_AT_decl_file   : 9
    <821>   DW_AT_decl_line   : 951
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0x82a>
    <828>   DW_AT_data_member_location: 4
 <2><829>: Abbrev Number: 0
 <1><82a>: Abbrev Number: 9 (DW_TAG_array_type)
    <82b>   DW_AT_type        : <0xbe>
    <82f>   DW_AT_sibling     : <0x83a>
 <2><833>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <834>   DW_AT_type        : <0x30>
    <838>   DW_AT_upper_bound : 3
 <2><839>: Abbrev Number: 0
 <1><83a>: Abbrev Number: 6 (DW_TAG_typedef)
    <83b>   DW_AT_name        : (indirect string, offset: 0x3178a): StaticListItem_t
    <83f>   DW_AT_decl_file   : 9
    <840>   DW_AT_decl_line   : 953
    <842>   DW_AT_decl_column : 34
    <843>   DW_AT_type        : <0x7ff>
 <1><847>: Abbrev Number: 17 (DW_TAG_structure_type)
    <848>   DW_AT_name        : (indirect string, offset: 0x5b4fe): xSTATIC_TCB
    <84c>   DW_AT_byte_size   : 180
    <84d>   DW_AT_decl_file   : 9
    <84e>   DW_AT_decl_line   : 984
    <850>   DW_AT_decl_column : 16
    <851>   DW_AT_sibling     : <0x8e2>
 <2><855>: Abbrev Number: 18 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0x1bc18): pxDummy1
    <85a>   DW_AT_decl_file   : 9
    <85b>   DW_AT_decl_line   : 986
    <85d>   DW_AT_decl_column : 11
    <85e>   DW_AT_type        : <0xbe>
    <862>   DW_AT_data_member_location: 0
 <2><863>: Abbrev Number: 18 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x1a121): xDummy3
    <868>   DW_AT_decl_file   : 9
    <869>   DW_AT_decl_line   : 990
    <86b>   DW_AT_decl_column : 19
    <86c>   DW_AT_type        : <0x8e2>
    <870>   DW_AT_data_member_location: 4
 <2><871>: Abbrev Number: 18 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0x12cc9): uxDummy5
    <876>   DW_AT_decl_file   : 9
    <877>   DW_AT_decl_line   : 991
    <879>   DW_AT_decl_column : 16
    <87a>   DW_AT_type        : <0xcc>
    <87e>   DW_AT_data_member_location: 44
 <2><87f>: Abbrev Number: 18 (DW_TAG_member)
    <880>   DW_AT_name        : (indirect string, offset: 0x1bc3b): pxDummy6
    <884>   DW_AT_decl_file   : 9
    <885>   DW_AT_decl_line   : 992
    <887>   DW_AT_decl_column : 11
    <888>   DW_AT_type        : <0xbe>
    <88c>   DW_AT_data_member_location: 48
 <2><88d>: Abbrev Number: 18 (DW_TAG_member)
    <88e>   DW_AT_name        : (indirect string, offset: 0x3041f): ucDummy7
    <892>   DW_AT_decl_file   : 9
    <893>   DW_AT_decl_line   : 993
    <895>   DW_AT_decl_column : 13
    <896>   DW_AT_type        : <0x8f2>
    <89a>   DW_AT_data_member_location: 52
 <2><89b>: Abbrev Number: 18 (DW_TAG_member)
    <89c>   DW_AT_name        : (indirect string, offset: 0x1e086): uxDummy12
    <8a0>   DW_AT_decl_file   : 9
    <8a1>   DW_AT_decl_line   : 1004
    <8a3>   DW_AT_decl_column : 16
    <8a4>   DW_AT_type        : <0x902>
    <8a8>   DW_AT_data_member_location: 68
 <2><8a9>: Abbrev Number: 18 (DW_TAG_member)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x6d359): xDummy17
    <8ae>   DW_AT_decl_file   : 9
    <8af>   DW_AT_decl_line   : 1016
    <8b1>   DW_AT_decl_column : 17
    <8b2>   DW_AT_type        : <0x2bb>
    <8b6>   DW_AT_data_member_location: 76
 <2><8b7>: Abbrev Number: 18 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x139cc): ulDummy18
    <8bc>   DW_AT_decl_file   : 9
    <8bd>   DW_AT_decl_line   : 1019
    <8bf>   DW_AT_decl_column : 14
    <8c0>   DW_AT_type        : <0xb2>
    <8c4>   DW_AT_data_member_location: 172
 <2><8c5>: Abbrev Number: 18 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x29eba): ucDummy19
    <8ca>   DW_AT_decl_file   : 9
    <8cb>   DW_AT_decl_line   : 1020
    <8cd>   DW_AT_decl_column : 13
    <8ce>   DW_AT_type        : <0x9a>
    <8d2>   DW_AT_data_member_location: 176
 <2><8d3>: Abbrev Number: 18 (DW_TAG_member)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x7b48d): uxDummy20
    <8d8>   DW_AT_decl_file   : 9
    <8d9>   DW_AT_decl_line   : 1023
    <8db>   DW_AT_decl_column : 13
    <8dc>   DW_AT_type        : <0x9a>
    <8e0>   DW_AT_data_member_location: 177
 <2><8e1>: Abbrev Number: 0
 <1><8e2>: Abbrev Number: 9 (DW_TAG_array_type)
    <8e3>   DW_AT_type        : <0x83a>
    <8e7>   DW_AT_sibling     : <0x8f2>
 <2><8eb>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <8ec>   DW_AT_type        : <0x30>
    <8f0>   DW_AT_upper_bound : 1
 <2><8f1>: Abbrev Number: 0
 <1><8f2>: Abbrev Number: 9 (DW_TAG_array_type)
    <8f3>   DW_AT_type        : <0x9a>
    <8f7>   DW_AT_sibling     : <0x902>
 <2><8fb>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <8fc>   DW_AT_type        : <0x30>
    <900>   DW_AT_upper_bound : 15
 <2><901>: Abbrev Number: 0
 <1><902>: Abbrev Number: 9 (DW_TAG_array_type)
    <903>   DW_AT_type        : <0xcc>
    <907>   DW_AT_sibling     : <0x912>
 <2><90b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <90c>   DW_AT_type        : <0x30>
    <910>   DW_AT_upper_bound : 1
 <2><911>: Abbrev Number: 0
 <1><912>: Abbrev Number: 6 (DW_TAG_typedef)
    <913>   DW_AT_name        : (indirect string, offset: 0x438b0): StaticTask_t
    <917>   DW_AT_decl_file   : 9
    <918>   DW_AT_decl_line   : 1030
    <91a>   DW_AT_decl_column : 3
    <91b>   DW_AT_type        : <0x847>
 <1><91f>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <920>   DW_AT_byte_size   : 4
    <921>   DW_AT_type        : <0xc0>
 <1><925>: Abbrev Number: 24 (DW_TAG_variable)
    <926>   DW_AT_name        : (indirect string, offset: 0x48194): xIdleTaskTCBBuffer
    <92a>   DW_AT_decl_file   : 1
    <92b>   DW_AT_decl_line   : 59
    <92c>   DW_AT_decl_column : 21
    <92d>   DW_AT_type        : <0x912>
    <931>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><937>: Abbrev Number: 9 (DW_TAG_array_type)
    <938>   DW_AT_type        : <0xc0>
    <93c>   DW_AT_sibling     : <0x947>
 <2><940>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <941>   DW_AT_type        : <0x30>
    <945>   DW_AT_upper_bound : 127
 <2><946>: Abbrev Number: 0
 <1><947>: Abbrev Number: 24 (DW_TAG_variable)
    <948>   DW_AT_name        : (indirect string, offset: 0x332ad): xIdleStack
    <94c>   DW_AT_decl_file   : 1
    <94d>   DW_AT_decl_line   : 60
    <94e>   DW_AT_decl_column : 20
    <94f>   DW_AT_type        : <0x937>
    <953>   DW_AT_location    : 5 byte block: 3 44 1 0 20 	(DW_OP_addr: 20000144)
 <1><959>: Abbrev Number: 25 (DW_TAG_subprogram)
    <95a>   DW_AT_external    : 1
    <95a>   DW_AT_name        : (indirect string, offset: 0x84fa9): vApplicationGetIdleTaskMemory
    <95e>   DW_AT_decl_file   : 1
    <95f>   DW_AT_decl_line   : 62
    <960>   DW_AT_decl_column : 6
    <961>   DW_AT_prototyped  : 1
    <961>   DW_AT_low_pc      : 0x8000150
    <965>   DW_AT_high_pc     : 0x30
    <969>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <96b>   DW_AT_GNU_all_call_sites: 1
    <96b>   DW_AT_sibling     : <0x99d>
 <2><96f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <970>   DW_AT_name        : (indirect string, offset: 0x48192): ppxIdleTaskTCBBuffer
    <974>   DW_AT_decl_file   : 1
    <975>   DW_AT_decl_line   : 62
    <976>   DW_AT_decl_column : 52
    <977>   DW_AT_type        : <0x99d>
    <97b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><97e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <97f>   DW_AT_name        : (indirect string, offset: 0x4eb84): ppxIdleTaskStackBuffer
    <983>   DW_AT_decl_file   : 1
    <984>   DW_AT_decl_line   : 62
    <985>   DW_AT_decl_column : 88
    <986>   DW_AT_type        : <0x9a9>
    <98a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><98d>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <98e>   DW_AT_name        : (indirect string, offset: 0x4aae8): pulIdleTaskStackSize
    <992>   DW_AT_decl_file   : 1
    <993>   DW_AT_decl_line   : 62
    <994>   DW_AT_decl_column : 122
    <995>   DW_AT_type        : <0x9af>
    <999>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><99c>: Abbrev Number: 0
 <1><99d>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <99e>   DW_AT_byte_size   : 4
    <99f>   DW_AT_type        : <0x9a3>
 <1><9a3>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9a4>   DW_AT_byte_size   : 4
    <9a5>   DW_AT_type        : <0x912>
 <1><9a9>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9aa>   DW_AT_byte_size   : 4
    <9ab>   DW_AT_type        : <0x91f>
 <1><9af>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9b0>   DW_AT_byte_size   : 4
    <9b1>   DW_AT_type        : <0xb2>
 <1><9b5>: Abbrev Number: 0
  Compilation Unit @ offset 0x9b6:
   Length:        0x1b41 (32-bit)
   Version:       4
   Abbrev Offset: 0x169
   Pointer Size:  4
 <0><9c1>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <9c2>   DW_AT_producer    : (indirect string, offset: 0x45314): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <9c6>   DW_AT_language    : 12	(ANSI C99)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x8d361): ../Core/Src/main.c
    <9cb>   DW_AT_comp_dir    : (indirect string, offset: 0x5dc63): D:/STM32/STM32_CUBEIDE/_RTOS/_SIMPLE_QUEUE/Debug
    <9cf>   DW_AT_ranges      : 0x10
    <9d3>   DW_AT_low_pc      : 0x0
    <9d7>   DW_AT_stmt_list   : 0x89a
    <9db>   DW_AT_GNU_macros  : 0x16710
 <1><9df>: Abbrev Number: 2 (DW_TAG_base_type)
    <9e0>   DW_AT_byte_size   : 1
    <9e1>   DW_AT_encoding    : 6	(signed char)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x44711): signed char
 <1><9e6>: Abbrev Number: 3 (DW_TAG_typedef)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x27f0e): __uint8_t
    <9eb>   DW_AT_decl_file   : 3
    <9ec>   DW_AT_decl_line   : 43
    <9ed>   DW_AT_decl_column : 24
    <9ee>   DW_AT_type        : <0x9f2>
 <1><9f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <9f3>   DW_AT_byte_size   : 1
    <9f4>   DW_AT_encoding    : 8	(unsigned char)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x1bc0a): unsigned char
 <1><9f9>: Abbrev Number: 2 (DW_TAG_base_type)
    <9fa>   DW_AT_byte_size   : 2
    <9fb>   DW_AT_encoding    : 5	(signed)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x65f5b): short int
 <1><a00>: Abbrev Number: 3 (DW_TAG_typedef)
    <a01>   DW_AT_name        : (indirect string, offset: 0x6fe00): __uint16_t
    <a05>   DW_AT_decl_file   : 3
    <a06>   DW_AT_decl_line   : 57
    <a07>   DW_AT_decl_column : 25
    <a08>   DW_AT_type        : <0xa0c>
 <1><a0c>: Abbrev Number: 2 (DW_TAG_base_type)
    <a0d>   DW_AT_byte_size   : 2
    <a0e>   DW_AT_encoding    : 7	(unsigned)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x2c94e): short unsigned int
 <1><a13>: Abbrev Number: 2 (DW_TAG_base_type)
    <a14>   DW_AT_byte_size   : 4
    <a15>   DW_AT_encoding    : 5	(signed)
    <a16>   DW_AT_name        : (indirect string, offset: 0xbd4e): long int
 <1><a1a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x56d3a): __uint32_t
    <a1f>   DW_AT_decl_file   : 3
    <a20>   DW_AT_decl_line   : 79
    <a21>   DW_AT_decl_column : 25
    <a22>   DW_AT_type        : <0xa26>
 <1><a26>: Abbrev Number: 2 (DW_TAG_base_type)
    <a27>   DW_AT_byte_size   : 4
    <a28>   DW_AT_encoding    : 7	(unsigned)
    <a29>   DW_AT_name        : (indirect string, offset: 0x202b9): long unsigned int
 <1><a2d>: Abbrev Number: 2 (DW_TAG_base_type)
    <a2e>   DW_AT_byte_size   : 8
    <a2f>   DW_AT_encoding    : 5	(signed)
    <a30>   DW_AT_name        : (indirect string, offset: 0x3eb5b): long long int
 <1><a34>: Abbrev Number: 2 (DW_TAG_base_type)
    <a35>   DW_AT_byte_size   : 8
    <a36>   DW_AT_encoding    : 7	(unsigned)
    <a37>   DW_AT_name        : (indirect string, offset: 0x1c43e): long long unsigned int
 <1><a3b>: Abbrev Number: 4 (DW_TAG_base_type)
    <a3c>   DW_AT_byte_size   : 4
    <a3d>   DW_AT_encoding    : 5	(signed)
    <a3e>   DW_AT_name        : int
 <1><a42>: Abbrev Number: 2 (DW_TAG_base_type)
    <a43>   DW_AT_byte_size   : 4
    <a44>   DW_AT_encoding    : 7	(unsigned)
    <a45>   DW_AT_name        : (indirect string, offset: 0xb6f5): unsigned int
 <1><a49>: Abbrev Number: 3 (DW_TAG_typedef)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x27f10): uint8_t
    <a4e>   DW_AT_decl_file   : 4
    <a4f>   DW_AT_decl_line   : 24
    <a50>   DW_AT_decl_column : 19
    <a51>   DW_AT_type        : <0x9e6>
 <1><a55>: Abbrev Number: 5 (DW_TAG_const_type)
    <a56>   DW_AT_type        : <0xa49>
 <1><a5a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x63ddd): uint16_t
    <a5f>   DW_AT_decl_file   : 4
    <a60>   DW_AT_decl_line   : 36
    <a61>   DW_AT_decl_column : 20
    <a62>   DW_AT_type        : <0xa00>
 <1><a66>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <a67>   DW_AT_type        : <0xa5a>
 <1><a6b>: Abbrev Number: 5 (DW_TAG_const_type)
    <a6c>   DW_AT_type        : <0xa5a>
 <1><a70>: Abbrev Number: 3 (DW_TAG_typedef)
    <a71>   DW_AT_name        : (indirect string, offset: 0x63774): uint32_t
    <a75>   DW_AT_decl_file   : 4
    <a76>   DW_AT_decl_line   : 48
    <a77>   DW_AT_decl_column : 20
    <a78>   DW_AT_type        : <0xa1a>
 <1><a7c>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <a7d>   DW_AT_type        : <0xa70>
 <1><a81>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a82>   DW_AT_byte_size   : 16
    <a83>   DW_AT_decl_file   : 5
    <a84>   DW_AT_decl_line   : 290
    <a86>   DW_AT_decl_column : 9
    <a87>   DW_AT_sibling     : <0xac4>
 <2><a8b>: Abbrev Number: 8 (DW_TAG_member)
    <a8c>   DW_AT_name        : CCR
    <a90>   DW_AT_decl_file   : 5
    <a91>   DW_AT_decl_line   : 292
    <a93>   DW_AT_decl_column : 17
    <a94>   DW_AT_type        : <0xa7c>
    <a98>   DW_AT_data_member_location: 0
 <2><a99>: Abbrev Number: 9 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x8a763): CNDTR
    <a9e>   DW_AT_decl_file   : 5
    <a9f>   DW_AT_decl_line   : 293
    <aa1>   DW_AT_decl_column : 17
    <aa2>   DW_AT_type        : <0xa7c>
    <aa6>   DW_AT_data_member_location: 4
 <2><aa7>: Abbrev Number: 9 (DW_TAG_member)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x8d908): CPAR
    <aac>   DW_AT_decl_file   : 5
    <aad>   DW_AT_decl_line   : 294
    <aaf>   DW_AT_decl_column : 17
    <ab0>   DW_AT_type        : <0xa7c>
    <ab4>   DW_AT_data_member_location: 8
 <2><ab5>: Abbrev Number: 9 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x8b65e): CMAR
    <aba>   DW_AT_decl_file   : 5
    <abb>   DW_AT_decl_line   : 295
    <abd>   DW_AT_decl_column : 17
    <abe>   DW_AT_type        : <0xa7c>
    <ac2>   DW_AT_data_member_location: 12
 <2><ac3>: Abbrev Number: 0
 <1><ac4>: Abbrev Number: 10 (DW_TAG_typedef)
    <ac5>   DW_AT_name        : (indirect string, offset: 0x8cbc8): DMA_Channel_TypeDef
    <ac9>   DW_AT_decl_file   : 5
    <aca>   DW_AT_decl_line   : 296
    <acc>   DW_AT_decl_column : 3
    <acd>   DW_AT_type        : <0xa81>
 <1><ad1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ad2>   DW_AT_byte_size   : 8
    <ad3>   DW_AT_decl_file   : 5
    <ad4>   DW_AT_decl_line   : 298
    <ad6>   DW_AT_decl_column : 9
    <ad7>   DW_AT_sibling     : <0xaf8>
 <2><adb>: Abbrev Number: 8 (DW_TAG_member)
    <adc>   DW_AT_name        : ISR
    <ae0>   DW_AT_decl_file   : 5
    <ae1>   DW_AT_decl_line   : 300
    <ae3>   DW_AT_decl_column : 17
    <ae4>   DW_AT_type        : <0xa7c>
    <ae8>   DW_AT_data_member_location: 0
 <2><ae9>: Abbrev Number: 9 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0x8c1ec): IFCR
    <aee>   DW_AT_decl_file   : 5
    <aef>   DW_AT_decl_line   : 301
    <af1>   DW_AT_decl_column : 17
    <af2>   DW_AT_type        : <0xa7c>
    <af6>   DW_AT_data_member_location: 4
 <2><af7>: Abbrev Number: 0
 <1><af8>: Abbrev Number: 10 (DW_TAG_typedef)
    <af9>   DW_AT_name        : (indirect string, offset: 0x8a47d): DMA_TypeDef
    <afd>   DW_AT_decl_file   : 5
    <afe>   DW_AT_decl_line   : 302
    <b00>   DW_AT_decl_column : 3
    <b01>   DW_AT_type        : <0xad1>
 <1><b05>: Abbrev Number: 7 (DW_TAG_structure_type)
    <b06>   DW_AT_byte_size   : 40
    <b07>   DW_AT_decl_file   : 5
    <b08>   DW_AT_decl_line   : 423
    <b0a>   DW_AT_decl_column : 9
    <b0b>   DW_AT_sibling     : <0xb9b>
 <2><b0f>: Abbrev Number: 8 (DW_TAG_member)
    <b10>   DW_AT_name        : CR
    <b13>   DW_AT_decl_file   : 5
    <b14>   DW_AT_decl_line   : 425
    <b16>   DW_AT_decl_column : 17
    <b17>   DW_AT_type        : <0xa7c>
    <b1b>   DW_AT_data_member_location: 0
 <2><b1c>: Abbrev Number: 9 (DW_TAG_member)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x8b9c3): CFGR
    <b21>   DW_AT_decl_file   : 5
    <b22>   DW_AT_decl_line   : 426
    <b24>   DW_AT_decl_column : 17
    <b25>   DW_AT_type        : <0xa7c>
    <b29>   DW_AT_data_member_location: 4
 <2><b2a>: Abbrev Number: 8 (DW_TAG_member)
    <b2b>   DW_AT_name        : CIR
    <b2f>   DW_AT_decl_file   : 5
    <b30>   DW_AT_decl_line   : 427
    <b32>   DW_AT_decl_column : 17
    <b33>   DW_AT_type        : <0xa7c>
    <b37>   DW_AT_data_member_location: 8
 <2><b38>: Abbrev Number: 9 (DW_TAG_member)
    <b39>   DW_AT_name        : (indirect string, offset: 0x8ab8b): APB2RSTR
    <b3d>   DW_AT_decl_file   : 5
    <b3e>   DW_AT_decl_line   : 428
    <b40>   DW_AT_decl_column : 17
    <b41>   DW_AT_type        : <0xa7c>
    <b45>   DW_AT_data_member_location: 12
 <2><b46>: Abbrev Number: 9 (DW_TAG_member)
    <b47>   DW_AT_name        : (indirect string, offset: 0x89048): APB1RSTR
    <b4b>   DW_AT_decl_file   : 5
    <b4c>   DW_AT_decl_line   : 429
    <b4e>   DW_AT_decl_column : 17
    <b4f>   DW_AT_type        : <0xa7c>
    <b53>   DW_AT_data_member_location: 16
 <2><b54>: Abbrev Number: 9 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0x88ef8): AHBENR
    <b59>   DW_AT_decl_file   : 5
    <b5a>   DW_AT_decl_line   : 430
    <b5c>   DW_AT_decl_column : 17
    <b5d>   DW_AT_type        : <0xa7c>
    <b61>   DW_AT_data_member_location: 20
 <2><b62>: Abbrev Number: 9 (DW_TAG_member)
    <b63>   DW_AT_name        : (indirect string, offset: 0x890f2): APB2ENR
    <b67>   DW_AT_decl_file   : 5
    <b68>   DW_AT_decl_line   : 431
    <b6a>   DW_AT_decl_column : 17
    <b6b>   DW_AT_type        : <0xa7c>
    <b6f>   DW_AT_data_member_location: 24
 <2><b70>: Abbrev Number: 9 (DW_TAG_member)
    <b71>   DW_AT_name        : (indirect string, offset: 0x8c5aa): APB1ENR
    <b75>   DW_AT_decl_file   : 5
    <b76>   DW_AT_decl_line   : 432
    <b78>   DW_AT_decl_column : 17
    <b79>   DW_AT_type        : <0xa7c>
    <b7d>   DW_AT_data_member_location: 28
 <2><b7e>: Abbrev Number: 9 (DW_TAG_member)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x891b0): BDCR
    <b83>   DW_AT_decl_file   : 5
    <b84>   DW_AT_decl_line   : 433
    <b86>   DW_AT_decl_column : 17
    <b87>   DW_AT_type        : <0xa7c>
    <b8b>   DW_AT_data_member_location: 32
 <2><b8c>: Abbrev Number: 8 (DW_TAG_member)
    <b8d>   DW_AT_name        : CSR
    <b91>   DW_AT_decl_file   : 5
    <b92>   DW_AT_decl_line   : 434
    <b94>   DW_AT_decl_column : 17
    <b95>   DW_AT_type        : <0xa7c>
    <b99>   DW_AT_data_member_location: 36
 <2><b9a>: Abbrev Number: 0
 <1><b9b>: Abbrev Number: 10 (DW_TAG_typedef)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x8ac7e): RCC_TypeDef
    <ba0>   DW_AT_decl_file   : 5
    <ba1>   DW_AT_decl_line   : 437
    <ba3>   DW_AT_decl_column : 3
    <ba4>   DW_AT_type        : <0xb05>
 <1><ba8>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ba9>   DW_AT_byte_size   : 84
    <baa>   DW_AT_decl_file   : 5
    <bab>   DW_AT_decl_line   : 476
    <bad>   DW_AT_decl_column : 9
    <bae>   DW_AT_sibling     : <0xcd7>
 <2><bb2>: Abbrev Number: 8 (DW_TAG_member)
    <bb3>   DW_AT_name        : CR1
    <bb7>   DW_AT_decl_file   : 5
    <bb8>   DW_AT_decl_line   : 478
    <bba>   DW_AT_decl_column : 17
    <bbb>   DW_AT_type        : <0xa7c>
    <bbf>   DW_AT_data_member_location: 0
 <2><bc0>: Abbrev Number: 8 (DW_TAG_member)
    <bc1>   DW_AT_name        : CR2
    <bc5>   DW_AT_decl_file   : 5
    <bc6>   DW_AT_decl_line   : 479
    <bc8>   DW_AT_decl_column : 17
    <bc9>   DW_AT_type        : <0xa7c>
    <bcd>   DW_AT_data_member_location: 4
 <2><bce>: Abbrev Number: 9 (DW_TAG_member)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x627ca): SMCR
    <bd3>   DW_AT_decl_file   : 5
    <bd4>   DW_AT_decl_line   : 480
    <bd6>   DW_AT_decl_column : 17
    <bd7>   DW_AT_type        : <0xa7c>
    <bdb>   DW_AT_data_member_location: 8
 <2><bdc>: Abbrev Number: 9 (DW_TAG_member)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x2b86c): DIER
    <be1>   DW_AT_decl_file   : 5
    <be2>   DW_AT_decl_line   : 481
    <be4>   DW_AT_decl_column : 17
    <be5>   DW_AT_type        : <0xa7c>
    <be9>   DW_AT_data_member_location: 12
 <2><bea>: Abbrev Number: 8 (DW_TAG_member)
    <beb>   DW_AT_name        : SR
    <bee>   DW_AT_decl_file   : 5
    <bef>   DW_AT_decl_line   : 482
    <bf1>   DW_AT_decl_column : 17
    <bf2>   DW_AT_type        : <0xa7c>
    <bf6>   DW_AT_data_member_location: 16
 <2><bf7>: Abbrev Number: 8 (DW_TAG_member)
    <bf8>   DW_AT_name        : EGR
    <bfc>   DW_AT_decl_file   : 5
    <bfd>   DW_AT_decl_line   : 483
    <bff>   DW_AT_decl_column : 17
    <c00>   DW_AT_type        : <0xa7c>
    <c04>   DW_AT_data_member_location: 20
 <2><c05>: Abbrev Number: 9 (DW_TAG_member)
    <c06>   DW_AT_name        : (indirect string, offset: 0x6426e): CCMR1
    <c0a>   DW_AT_decl_file   : 5
    <c0b>   DW_AT_decl_line   : 484
    <c0d>   DW_AT_decl_column : 17
    <c0e>   DW_AT_type        : <0xa7c>
    <c12>   DW_AT_data_member_location: 24
 <2><c13>: Abbrev Number: 9 (DW_TAG_member)
    <c14>   DW_AT_name        : (indirect string, offset: 0x36abf): CCMR2
    <c18>   DW_AT_decl_file   : 5
    <c19>   DW_AT_decl_line   : 485
    <c1b>   DW_AT_decl_column : 17
    <c1c>   DW_AT_type        : <0xa7c>
    <c20>   DW_AT_data_member_location: 28
 <2><c21>: Abbrev Number: 9 (DW_TAG_member)
    <c22>   DW_AT_name        : (indirect string, offset: 0x1823e): CCER
    <c26>   DW_AT_decl_file   : 5
    <c27>   DW_AT_decl_line   : 486
    <c29>   DW_AT_decl_column : 17
    <c2a>   DW_AT_type        : <0xa7c>
    <c2e>   DW_AT_data_member_location: 32
 <2><c2f>: Abbrev Number: 8 (DW_TAG_member)
    <c30>   DW_AT_name        : CNT
    <c34>   DW_AT_decl_file   : 5
    <c35>   DW_AT_decl_line   : 487
    <c37>   DW_AT_decl_column : 17
    <c38>   DW_AT_type        : <0xa7c>
    <c3c>   DW_AT_data_member_location: 36
 <2><c3d>: Abbrev Number: 8 (DW_TAG_member)
    <c3e>   DW_AT_name        : PSC
    <c42>   DW_AT_decl_file   : 5
    <c43>   DW_AT_decl_line   : 488
    <c45>   DW_AT_decl_column : 17
    <c46>   DW_AT_type        : <0xa7c>
    <c4a>   DW_AT_data_member_location: 40
 <2><c4b>: Abbrev Number: 8 (DW_TAG_member)
    <c4c>   DW_AT_name        : ARR
    <c50>   DW_AT_decl_file   : 5
    <c51>   DW_AT_decl_line   : 489
    <c53>   DW_AT_decl_column : 17
    <c54>   DW_AT_type        : <0xa7c>
    <c58>   DW_AT_data_member_location: 44
 <2><c59>: Abbrev Number: 8 (DW_TAG_member)
    <c5a>   DW_AT_name        : RCR
    <c5e>   DW_AT_decl_file   : 5
    <c5f>   DW_AT_decl_line   : 490
    <c61>   DW_AT_decl_column : 17
    <c62>   DW_AT_type        : <0xa7c>
    <c66>   DW_AT_data_member_location: 48
 <2><c67>: Abbrev Number: 9 (DW_TAG_member)
    <c68>   DW_AT_name        : (indirect string, offset: 0x10701): CCR1
    <c6c>   DW_AT_decl_file   : 5
    <c6d>   DW_AT_decl_line   : 491
    <c6f>   DW_AT_decl_column : 17
    <c70>   DW_AT_type        : <0xa7c>
    <c74>   DW_AT_data_member_location: 52
 <2><c75>: Abbrev Number: 9 (DW_TAG_member)
    <c76>   DW_AT_name        : (indirect string, offset: 0x39ae0): CCR2
    <c7a>   DW_AT_decl_file   : 5
    <c7b>   DW_AT_decl_line   : 492
    <c7d>   DW_AT_decl_column : 17
    <c7e>   DW_AT_type        : <0xa7c>
    <c82>   DW_AT_data_member_location: 56
 <2><c83>: Abbrev Number: 9 (DW_TAG_member)
    <c84>   DW_AT_name        : (indirect string, offset: 0x68d7c): CCR3
    <c88>   DW_AT_decl_file   : 5
    <c89>   DW_AT_decl_line   : 493
    <c8b>   DW_AT_decl_column : 17
    <c8c>   DW_AT_type        : <0xa7c>
    <c90>   DW_AT_data_member_location: 60
 <2><c91>: Abbrev Number: 9 (DW_TAG_member)
    <c92>   DW_AT_name        : (indirect string, offset: 0x8aa3): CCR4
    <c96>   DW_AT_decl_file   : 5
    <c97>   DW_AT_decl_line   : 494
    <c99>   DW_AT_decl_column : 17
    <c9a>   DW_AT_type        : <0xa7c>
    <c9e>   DW_AT_data_member_location: 64
 <2><c9f>: Abbrev Number: 9 (DW_TAG_member)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x3f461): BDTR
    <ca4>   DW_AT_decl_file   : 5
    <ca5>   DW_AT_decl_line   : 495
    <ca7>   DW_AT_decl_column : 17
    <ca8>   DW_AT_type        : <0xa7c>
    <cac>   DW_AT_data_member_location: 68
 <2><cad>: Abbrev Number: 8 (DW_TAG_member)
    <cae>   DW_AT_name        : DCR
    <cb2>   DW_AT_decl_file   : 5
    <cb3>   DW_AT_decl_line   : 496
    <cb5>   DW_AT_decl_column : 17
    <cb6>   DW_AT_type        : <0xa7c>
    <cba>   DW_AT_data_member_location: 72
 <2><cbb>: Abbrev Number: 9 (DW_TAG_member)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x75902): DMAR
    <cc0>   DW_AT_decl_file   : 5
    <cc1>   DW_AT_decl_line   : 497
    <cc3>   DW_AT_decl_column : 17
    <cc4>   DW_AT_type        : <0xa7c>
    <cc8>   DW_AT_data_member_location: 76
 <2><cc9>: Abbrev Number: 8 (DW_TAG_member)
    <cca>   DW_AT_name        : OR
    <ccd>   DW_AT_decl_file   : 5
    <cce>   DW_AT_decl_line   : 498
    <cd0>   DW_AT_decl_column : 17
    <cd1>   DW_AT_type        : <0xa7c>
    <cd5>   DW_AT_data_member_location: 80
 <2><cd6>: Abbrev Number: 0
 <1><cd7>: Abbrev Number: 10 (DW_TAG_typedef)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x8991d): TIM_TypeDef
    <cdc>   DW_AT_decl_file   : 5
    <cdd>   DW_AT_decl_line   : 499
    <cdf>   DW_AT_decl_column : 2
    <ce0>   DW_AT_type        : <0xba8>
 <1><ce4>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ce5>   DW_AT_byte_size   : 28
    <ce6>   DW_AT_decl_file   : 5
    <ce7>   DW_AT_decl_line   : 506
    <ce9>   DW_AT_decl_column : 9
    <cea>   DW_AT_sibling     : <0xd4f>
 <2><cee>: Abbrev Number: 8 (DW_TAG_member)
    <cef>   DW_AT_name        : SR
    <cf2>   DW_AT_decl_file   : 5
    <cf3>   DW_AT_decl_line   : 508
    <cf5>   DW_AT_decl_column : 17
    <cf6>   DW_AT_type        : <0xa7c>
    <cfa>   DW_AT_data_member_location: 0
 <2><cfb>: Abbrev Number: 8 (DW_TAG_member)
    <cfc>   DW_AT_name        : DR
    <cff>   DW_AT_decl_file   : 5
    <d00>   DW_AT_decl_line   : 509
    <d02>   DW_AT_decl_column : 17
    <d03>   DW_AT_type        : <0xa7c>
    <d07>   DW_AT_data_member_location: 4
 <2><d08>: Abbrev Number: 8 (DW_TAG_member)
    <d09>   DW_AT_name        : BRR
    <d0d>   DW_AT_decl_file   : 5
    <d0e>   DW_AT_decl_line   : 510
    <d10>   DW_AT_decl_column : 17
    <d11>   DW_AT_type        : <0xa7c>
    <d15>   DW_AT_data_member_location: 8
 <2><d16>: Abbrev Number: 8 (DW_TAG_member)
    <d17>   DW_AT_name        : CR1
    <d1b>   DW_AT_decl_file   : 5
    <d1c>   DW_AT_decl_line   : 511
    <d1e>   DW_AT_decl_column : 17
    <d1f>   DW_AT_type        : <0xa7c>
    <d23>   DW_AT_data_member_location: 12
 <2><d24>: Abbrev Number: 8 (DW_TAG_member)
    <d25>   DW_AT_name        : CR2
    <d29>   DW_AT_decl_file   : 5
    <d2a>   DW_AT_decl_line   : 512
    <d2c>   DW_AT_decl_column : 17
    <d2d>   DW_AT_type        : <0xa7c>
    <d31>   DW_AT_data_member_location: 16
 <2><d32>: Abbrev Number: 8 (DW_TAG_member)
    <d33>   DW_AT_name        : CR3
    <d37>   DW_AT_decl_file   : 5
    <d38>   DW_AT_decl_line   : 513
    <d3a>   DW_AT_decl_column : 17
    <d3b>   DW_AT_type        : <0xa7c>
    <d3f>   DW_AT_data_member_location: 20
 <2><d40>: Abbrev Number: 9 (DW_TAG_member)
    <d41>   DW_AT_name        : (indirect string, offset: 0x89e1b): GTPR
    <d45>   DW_AT_decl_file   : 5
    <d46>   DW_AT_decl_line   : 514
    <d48>   DW_AT_decl_column : 17
    <d49>   DW_AT_type        : <0xa7c>
    <d4d>   DW_AT_data_member_location: 24
 <2><d4e>: Abbrev Number: 0
 <1><d4f>: Abbrev Number: 10 (DW_TAG_typedef)
    <d50>   DW_AT_name        : (indirect string, offset: 0x8daf8): USART_TypeDef
    <d54>   DW_AT_decl_file   : 5
    <d55>   DW_AT_decl_line   : 515
    <d57>   DW_AT_decl_column : 3
    <d58>   DW_AT_type        : <0xce4>
 <1><d5c>: Abbrev Number: 2 (DW_TAG_base_type)
    <d5d>   DW_AT_byte_size   : 8
    <d5e>   DW_AT_encoding    : 4	(float)
    <d5f>   DW_AT_name        : (indirect string, offset: 0xcfc3): long double
 <1><d63>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <d64>   DW_AT_encoding    : 7	(unsigned)
    <d65>   DW_AT_byte_size   : 1
    <d66>   DW_AT_type        : <0x9f2>
    <d6a>   DW_AT_decl_file   : 6
    <d6b>   DW_AT_decl_line   : 39
    <d6c>   DW_AT_decl_column : 1
    <d6d>   DW_AT_sibling     : <0xd8a>
 <2><d71>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d72>   DW_AT_name        : (indirect string, offset: 0x8a324): HAL_OK
    <d76>   DW_AT_const_value : 0
 <2><d77>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d78>   DW_AT_name        : (indirect string, offset: 0x8bc82): HAL_ERROR
    <d7c>   DW_AT_const_value : 1
 <2><d7d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x8939d): HAL_BUSY
    <d82>   DW_AT_const_value : 2
 <2><d83>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d84>   DW_AT_name        : (indirect string, offset: 0x89f8d): HAL_TIMEOUT
    <d88>   DW_AT_const_value : 3
 <2><d89>: Abbrev Number: 0
 <1><d8a>: Abbrev Number: 3 (DW_TAG_typedef)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x88978): HAL_StatusTypeDef
    <d8f>   DW_AT_decl_file   : 6
    <d90>   DW_AT_decl_line   : 44
    <d91>   DW_AT_decl_column : 3
    <d92>   DW_AT_type        : <0xd63>
 <1><d96>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <d97>   DW_AT_encoding    : 7	(unsigned)
    <d98>   DW_AT_byte_size   : 1
    <d99>   DW_AT_type        : <0x9f2>
    <d9d>   DW_AT_decl_file   : 6
    <d9e>   DW_AT_decl_line   : 50
    <d9f>   DW_AT_decl_column : 1
    <da0>   DW_AT_sibling     : <0xdb1>
 <2><da4>: Abbrev Number: 12 (DW_TAG_enumerator)
    <da5>   DW_AT_name        : (indirect string, offset: 0x8c35e): HAL_UNLOCKED
    <da9>   DW_AT_const_value : 0
 <2><daa>: Abbrev Number: 12 (DW_TAG_enumerator)
    <dab>   DW_AT_name        : (indirect string, offset: 0x8db50): HAL_LOCKED
    <daf>   DW_AT_const_value : 1
 <2><db0>: Abbrev Number: 0
 <1><db1>: Abbrev Number: 3 (DW_TAG_typedef)
    <db2>   DW_AT_name        : (indirect string, offset: 0x8b930): HAL_LockTypeDef
    <db6>   DW_AT_decl_file   : 6
    <db7>   DW_AT_decl_line   : 53
    <db8>   DW_AT_decl_column : 3
    <db9>   DW_AT_type        : <0xd96>
 <1><dbd>: Abbrev Number: 13 (DW_TAG_structure_type)
    <dbe>   DW_AT_byte_size   : 12
    <dbf>   DW_AT_decl_file   : 7
    <dc0>   DW_AT_decl_line   : 47
    <dc1>   DW_AT_decl_column : 9
    <dc2>   DW_AT_sibling     : <0xdee>
 <2><dc6>: Abbrev Number: 14 (DW_TAG_member)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x8bea6): PLLState
    <dcb>   DW_AT_decl_file   : 7
    <dcc>   DW_AT_decl_line   : 49
    <dcd>   DW_AT_decl_column : 12
    <dce>   DW_AT_type        : <0xa70>
    <dd2>   DW_AT_data_member_location: 0
 <2><dd3>: Abbrev Number: 14 (DW_TAG_member)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x8bf54): PLLSource
    <dd8>   DW_AT_decl_file   : 7
    <dd9>   DW_AT_decl_line   : 52
    <dda>   DW_AT_decl_column : 12
    <ddb>   DW_AT_type        : <0xa70>
    <ddf>   DW_AT_data_member_location: 4
 <2><de0>: Abbrev Number: 14 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0x8d41b): PLLMUL
    <de5>   DW_AT_decl_file   : 7
    <de6>   DW_AT_decl_line   : 55
    <de7>   DW_AT_decl_column : 12
    <de8>   DW_AT_type        : <0xa70>
    <dec>   DW_AT_data_member_location: 8
 <2><ded>: Abbrev Number: 0
 <1><dee>: Abbrev Number: 3 (DW_TAG_typedef)
    <def>   DW_AT_name        : (indirect string, offset: 0x8b9b0): RCC_PLLInitTypeDef
    <df3>   DW_AT_decl_file   : 7
    <df4>   DW_AT_decl_line   : 57
    <df5>   DW_AT_decl_column : 3
    <df6>   DW_AT_type        : <0xdbd>
 <1><dfa>: Abbrev Number: 13 (DW_TAG_structure_type)
    <dfb>   DW_AT_byte_size   : 20
    <dfc>   DW_AT_decl_file   : 7
    <dfd>   DW_AT_decl_line   : 62
    <dfe>   DW_AT_decl_column : 9
    <dff>   DW_AT_sibling     : <0xe45>
 <2><e03>: Abbrev Number: 14 (DW_TAG_member)
    <e04>   DW_AT_name        : (indirect string, offset: 0x8a00d): ClockType
    <e08>   DW_AT_decl_file   : 7
    <e09>   DW_AT_decl_line   : 64
    <e0a>   DW_AT_decl_column : 12
    <e0b>   DW_AT_type        : <0xa70>
    <e0f>   DW_AT_data_member_location: 0
 <2><e10>: Abbrev Number: 14 (DW_TAG_member)
    <e11>   DW_AT_name        : (indirect string, offset: 0x8b9a3): SYSCLKSource
    <e15>   DW_AT_decl_file   : 7
    <e16>   DW_AT_decl_line   : 67
    <e17>   DW_AT_decl_column : 12
    <e18>   DW_AT_type        : <0xa70>
    <e1c>   DW_AT_data_member_location: 4
 <2><e1d>: Abbrev Number: 14 (DW_TAG_member)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x8cc2e): AHBCLKDivider
    <e22>   DW_AT_decl_file   : 7
    <e23>   DW_AT_decl_line   : 70
    <e24>   DW_AT_decl_column : 12
    <e25>   DW_AT_type        : <0xa70>
    <e29>   DW_AT_data_member_location: 8
 <2><e2a>: Abbrev Number: 14 (DW_TAG_member)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x88abd): APB1CLKDivider
    <e2f>   DW_AT_decl_file   : 7
    <e30>   DW_AT_decl_line   : 73
    <e31>   DW_AT_decl_column : 12
    <e32>   DW_AT_type        : <0xa70>
    <e36>   DW_AT_data_member_location: 12
 <2><e37>: Abbrev Number: 14 (DW_TAG_member)
    <e38>   DW_AT_name        : (indirect string, offset: 0x8ac62): APB2CLKDivider
    <e3c>   DW_AT_decl_file   : 7
    <e3d>   DW_AT_decl_line   : 76
    <e3e>   DW_AT_decl_column : 12
    <e3f>   DW_AT_type        : <0xa70>
    <e43>   DW_AT_data_member_location: 16
 <2><e44>: Abbrev Number: 0
 <1><e45>: Abbrev Number: 3 (DW_TAG_typedef)
    <e46>   DW_AT_name        : (indirect string, offset: 0x8a017): RCC_ClkInitTypeDef
    <e4a>   DW_AT_decl_file   : 7
    <e4b>   DW_AT_decl_line   : 78
    <e4c>   DW_AT_decl_column : 3
    <e4d>   DW_AT_type        : <0xdfa>
 <1><e51>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e52>   DW_AT_byte_size   : 40
    <e53>   DW_AT_decl_file   : 8
    <e54>   DW_AT_decl_line   : 226
    <e55>   DW_AT_decl_column : 9
    <e56>   DW_AT_sibling     : <0xec3>
 <2><e5a>: Abbrev Number: 14 (DW_TAG_member)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x88c6f): OscillatorType
    <e5f>   DW_AT_decl_file   : 8
    <e60>   DW_AT_decl_line   : 228
    <e61>   DW_AT_decl_column : 12
    <e62>   DW_AT_type        : <0xa70>
    <e66>   DW_AT_data_member_location: 0
 <2><e67>: Abbrev Number: 14 (DW_TAG_member)
    <e68>   DW_AT_name        : (indirect string, offset: 0x8bf3b): HSEState
    <e6c>   DW_AT_decl_file   : 8
    <e6d>   DW_AT_decl_line   : 236
    <e6e>   DW_AT_decl_column : 12
    <e6f>   DW_AT_type        : <0xa70>
    <e73>   DW_AT_data_member_location: 4
 <2><e74>: Abbrev Number: 14 (DW_TAG_member)
    <e75>   DW_AT_name        : (indirect string, offset: 0x8bf08): HSEPredivValue
    <e79>   DW_AT_decl_file   : 8
    <e7a>   DW_AT_decl_line   : 239
    <e7b>   DW_AT_decl_column : 12
    <e7c>   DW_AT_type        : <0xa70>
    <e80>   DW_AT_data_member_location: 8
 <2><e81>: Abbrev Number: 14 (DW_TAG_member)
    <e82>   DW_AT_name        : (indirect string, offset: 0x8bd39): LSEState
    <e86>   DW_AT_decl_file   : 8
    <e87>   DW_AT_decl_line   : 242
    <e88>   DW_AT_decl_column : 12
    <e89>   DW_AT_type        : <0xa70>
    <e8d>   DW_AT_data_member_location: 12
 <2><e8e>: Abbrev Number: 14 (DW_TAG_member)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x8abcf): HSIState
    <e93>   DW_AT_decl_file   : 8
    <e94>   DW_AT_decl_line   : 245
    <e95>   DW_AT_decl_column : 12
    <e96>   DW_AT_type        : <0xa70>
    <e9a>   DW_AT_data_member_location: 16
 <2><e9b>: Abbrev Number: 14 (DW_TAG_member)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x8cfc4): HSICalibrationValue
    <ea0>   DW_AT_decl_file   : 8
    <ea1>   DW_AT_decl_line   : 248
    <ea2>   DW_AT_decl_column : 12
    <ea3>   DW_AT_type        : <0xa70>
    <ea7>   DW_AT_data_member_location: 20
 <2><ea8>: Abbrev Number: 14 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x8d381): LSIState
    <ead>   DW_AT_decl_file   : 8
    <eae>   DW_AT_decl_line   : 251
    <eaf>   DW_AT_decl_column : 12
    <eb0>   DW_AT_type        : <0xa70>
    <eb4>   DW_AT_data_member_location: 24
 <2><eb5>: Abbrev Number: 15 (DW_TAG_member)
    <eb6>   DW_AT_name        : PLL
    <eba>   DW_AT_decl_file   : 8
    <ebb>   DW_AT_decl_line   : 254
    <ebc>   DW_AT_decl_column : 22
    <ebd>   DW_AT_type        : <0xdee>
    <ec1>   DW_AT_data_member_location: 28
 <2><ec2>: Abbrev Number: 0
 <1><ec3>: Abbrev Number: 10 (DW_TAG_typedef)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x8b37e): RCC_OscInitTypeDef
    <ec8>   DW_AT_decl_file   : 8
    <ec9>   DW_AT_decl_line   : 259
    <ecb>   DW_AT_decl_column : 3
    <ecc>   DW_AT_type        : <0xe51>
 <1><ed0>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ed1>   DW_AT_byte_size   : 28
    <ed2>   DW_AT_decl_file   : 9
    <ed3>   DW_AT_decl_line   : 47
    <ed4>   DW_AT_decl_column : 9
    <ed5>   DW_AT_sibling     : <0xf35>
 <2><ed9>: Abbrev Number: 14 (DW_TAG_member)
    <eda>   DW_AT_name        : (indirect string, offset: 0x8a558): Direction
    <ede>   DW_AT_decl_file   : 9
    <edf>   DW_AT_decl_line   : 49
    <ee0>   DW_AT_decl_column : 12
    <ee1>   DW_AT_type        : <0xa70>
    <ee5>   DW_AT_data_member_location: 0
 <2><ee6>: Abbrev Number: 14 (DW_TAG_member)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x88dd3): PeriphInc
    <eeb>   DW_AT_decl_file   : 9
    <eec>   DW_AT_decl_line   : 53
    <eed>   DW_AT_decl_column : 12
    <eee>   DW_AT_type        : <0xa70>
    <ef2>   DW_AT_data_member_location: 4
 <2><ef3>: Abbrev Number: 14 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x89273): MemInc
    <ef8>   DW_AT_decl_file   : 9
    <ef9>   DW_AT_decl_line   : 56
    <efa>   DW_AT_decl_column : 12
    <efb>   DW_AT_type        : <0xa70>
    <eff>   DW_AT_data_member_location: 8
 <2><f00>: Abbrev Number: 14 (DW_TAG_member)
    <f01>   DW_AT_name        : (indirect string, offset: 0x8aff0): PeriphDataAlignment
    <f05>   DW_AT_decl_file   : 9
    <f06>   DW_AT_decl_line   : 59
    <f07>   DW_AT_decl_column : 12
    <f08>   DW_AT_type        : <0xa70>
    <f0c>   DW_AT_data_member_location: 12
 <2><f0d>: Abbrev Number: 14 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0x8d474): MemDataAlignment
    <f12>   DW_AT_decl_file   : 9
    <f13>   DW_AT_decl_line   : 62
    <f14>   DW_AT_decl_column : 12
    <f15>   DW_AT_type        : <0xa70>
    <f19>   DW_AT_data_member_location: 16
 <2><f1a>: Abbrev Number: 14 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x90b14): Mode
    <f1f>   DW_AT_decl_file   : 9
    <f20>   DW_AT_decl_line   : 65
    <f21>   DW_AT_decl_column : 12
    <f22>   DW_AT_type        : <0xa70>
    <f26>   DW_AT_data_member_location: 20
 <2><f27>: Abbrev Number: 14 (DW_TAG_member)
    <f28>   DW_AT_name        : (indirect string, offset: 0x8fc22): Priority
    <f2c>   DW_AT_decl_file   : 9
    <f2d>   DW_AT_decl_line   : 70
    <f2e>   DW_AT_decl_column : 12
    <f2f>   DW_AT_type        : <0xa70>
    <f33>   DW_AT_data_member_location: 24
 <2><f34>: Abbrev Number: 0
 <1><f35>: Abbrev Number: 3 (DW_TAG_typedef)
    <f36>   DW_AT_name        : (indirect string, offset: 0x89d30): DMA_InitTypeDef
    <f3a>   DW_AT_decl_file   : 9
    <f3b>   DW_AT_decl_line   : 72
    <f3c>   DW_AT_decl_column : 3
    <f3d>   DW_AT_type        : <0xed0>
 <1><f41>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <f42>   DW_AT_encoding    : 7	(unsigned)
    <f43>   DW_AT_byte_size   : 1
    <f44>   DW_AT_type        : <0x9f2>
    <f48>   DW_AT_decl_file   : 9
    <f49>   DW_AT_decl_line   : 78
    <f4a>   DW_AT_decl_column : 1
    <f4b>   DW_AT_sibling     : <0xf68>
 <2><f4f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f50>   DW_AT_name        : (indirect string, offset: 0x8c47f): HAL_DMA_STATE_RESET
    <f54>   DW_AT_const_value : 0
 <2><f55>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0x89db0): HAL_DMA_STATE_READY
    <f5a>   DW_AT_const_value : 1
 <2><f5b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f5c>   DW_AT_name        : (indirect string, offset: 0x8c05a): HAL_DMA_STATE_BUSY
    <f60>   DW_AT_const_value : 2
 <2><f61>: Abbrev Number: 12 (DW_TAG_enumerator)
    <f62>   DW_AT_name        : (indirect string, offset: 0x8d95f): HAL_DMA_STATE_TIMEOUT
    <f66>   DW_AT_const_value : 3
 <2><f67>: Abbrev Number: 0
 <1><f68>: Abbrev Number: 3 (DW_TAG_typedef)
    <f69>   DW_AT_name        : (indirect string, offset: 0x8be79): HAL_DMA_StateTypeDef
    <f6d>   DW_AT_decl_file   : 9
    <f6e>   DW_AT_decl_line   : 83
    <f6f>   DW_AT_decl_column : 2
    <f70>   DW_AT_type        : <0xf41>
 <1><f74>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <f75>   DW_AT_type        : <0xf68>
 <1><f79>: Abbrev Number: 16 (DW_TAG_structure_type)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x8cf44): __DMA_HandleTypeDef
    <f7e>   DW_AT_byte_size   : 68
    <f7f>   DW_AT_decl_file   : 9
    <f80>   DW_AT_decl_line   : 110
    <f81>   DW_AT_decl_column : 16
    <f82>   DW_AT_sibling     : <0x1023>
 <2><f86>: Abbrev Number: 14 (DW_TAG_member)
    <f87>   DW_AT_name        : (indirect string, offset: 0x8a7f5): Instance
    <f8b>   DW_AT_decl_file   : 9
    <f8c>   DW_AT_decl_line   : 112
    <f8d>   DW_AT_decl_column : 31
    <f8e>   DW_AT_type        : <0x1023>
    <f92>   DW_AT_data_member_location: 0
 <2><f93>: Abbrev Number: 14 (DW_TAG_member)
    <f94>   DW_AT_name        : (indirect string, offset: 0x8ffc9): Init
    <f98>   DW_AT_decl_file   : 9
    <f99>   DW_AT_decl_line   : 114
    <f9a>   DW_AT_decl_column : 30
    <f9b>   DW_AT_type        : <0xf35>
    <f9f>   DW_AT_data_member_location: 4
 <2><fa0>: Abbrev Number: 14 (DW_TAG_member)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x61b20): Lock
    <fa5>   DW_AT_decl_file   : 9
    <fa6>   DW_AT_decl_line   : 116
    <fa7>   DW_AT_decl_column : 30
    <fa8>   DW_AT_type        : <0xdb1>
    <fac>   DW_AT_data_member_location: 32
 <2><fad>: Abbrev Number: 14 (DW_TAG_member)
    <fae>   DW_AT_name        : (indirect string, offset: 0x8bf3e): State
    <fb2>   DW_AT_decl_file   : 9
    <fb3>   DW_AT_decl_line   : 118
    <fb4>   DW_AT_decl_column : 30
    <fb5>   DW_AT_type        : <0xf74>
    <fb9>   DW_AT_data_member_location: 33
 <2><fba>: Abbrev Number: 14 (DW_TAG_member)
    <fbb>   DW_AT_name        : (indirect string, offset: 0x8a0b5): Parent
    <fbf>   DW_AT_decl_file   : 9
    <fc0>   DW_AT_decl_line   : 120
    <fc1>   DW_AT_decl_column : 31
    <fc2>   DW_AT_type        : <0x1029>
    <fc6>   DW_AT_data_member_location: 36
 <2><fc7>: Abbrev Number: 14 (DW_TAG_member)
    <fc8>   DW_AT_name        : (indirect string, offset: 0x8db1d): XferCpltCallback
    <fcc>   DW_AT_decl_file   : 9
    <fcd>   DW_AT_decl_line   : 122
    <fce>   DW_AT_decl_column : 33
    <fcf>   DW_AT_type        : <0x1041>
    <fd3>   DW_AT_data_member_location: 40
 <2><fd4>: Abbrev Number: 14 (DW_TAG_member)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x8c8f2): XferHalfCpltCallback
    <fd9>   DW_AT_decl_file   : 9
    <fda>   DW_AT_decl_line   : 124
    <fdb>   DW_AT_decl_column : 33
    <fdc>   DW_AT_type        : <0x1041>
    <fe0>   DW_AT_data_member_location: 44
 <2><fe1>: Abbrev Number: 14 (DW_TAG_member)
    <fe2>   DW_AT_name        : (indirect string, offset: 0x89201): XferErrorCallback
    <fe6>   DW_AT_decl_file   : 9
    <fe7>   DW_AT_decl_line   : 126
    <fe8>   DW_AT_decl_column : 33
    <fe9>   DW_AT_type        : <0x1041>
    <fed>   DW_AT_data_member_location: 48
 <2><fee>: Abbrev Number: 14 (DW_TAG_member)
    <fef>   DW_AT_name        : (indirect string, offset: 0x8d613): XferAbortCallback
    <ff3>   DW_AT_decl_file   : 9
    <ff4>   DW_AT_decl_line   : 128
    <ff5>   DW_AT_decl_column : 33
    <ff6>   DW_AT_type        : <0x1041>
    <ffa>   DW_AT_data_member_location: 52
 <2><ffb>: Abbrev Number: 14 (DW_TAG_member)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x8d955): ErrorCode
    <1000>   DW_AT_decl_file   : 9
    <1001>   DW_AT_decl_line   : 130
    <1002>   DW_AT_decl_column : 30
    <1003>   DW_AT_type        : <0xa7c>
    <1007>   DW_AT_data_member_location: 56
 <2><1008>: Abbrev Number: 14 (DW_TAG_member)
    <1009>   DW_AT_name        : (indirect string, offset: 0x8ab02): DmaBaseAddress
    <100d>   DW_AT_decl_file   : 9
    <100e>   DW_AT_decl_line   : 132
    <100f>   DW_AT_decl_column : 31
    <1010>   DW_AT_type        : <0x1047>
    <1014>   DW_AT_data_member_location: 60
 <2><1015>: Abbrev Number: 14 (DW_TAG_member)
    <1016>   DW_AT_name        : (indirect string, offset: 0x89819): ChannelIndex
    <101a>   DW_AT_decl_file   : 9
    <101b>   DW_AT_decl_line   : 134
    <101c>   DW_AT_decl_column : 30
    <101d>   DW_AT_type        : <0xa70>
    <1021>   DW_AT_data_member_location: 64
 <2><1022>: Abbrev Number: 0
 <1><1023>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <1024>   DW_AT_byte_size   : 4
    <1025>   DW_AT_type        : <0xac4>
 <1><1029>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <102a>   DW_AT_byte_size   : 4
 <1><102b>: Abbrev Number: 5 (DW_TAG_const_type)
    <102c>   DW_AT_type        : <0x1029>
 <1><1030>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <1031>   DW_AT_prototyped  : 1
    <1031>   DW_AT_sibling     : <0x103b>
 <2><1035>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1036>   DW_AT_type        : <0x103b>
 <2><103a>: Abbrev Number: 0
 <1><103b>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <103c>   DW_AT_byte_size   : 4
    <103d>   DW_AT_type        : <0xf79>
 <1><1041>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <1042>   DW_AT_byte_size   : 4
    <1043>   DW_AT_type        : <0x1030>
 <1><1047>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <1048>   DW_AT_byte_size   : 4
    <1049>   DW_AT_type        : <0xaf8>
 <1><104d>: Abbrev Number: 3 (DW_TAG_typedef)
    <104e>   DW_AT_name        : (indirect string, offset: 0x8cf46): DMA_HandleTypeDef
    <1052>   DW_AT_decl_file   : 9
    <1053>   DW_AT_decl_line   : 136
    <1054>   DW_AT_decl_column : 3
    <1055>   DW_AT_type        : <0xf79>
 <1><1059>: Abbrev Number: 13 (DW_TAG_structure_type)
    <105a>   DW_AT_byte_size   : 24
    <105b>   DW_AT_decl_file   : 10
    <105c>   DW_AT_decl_line   : 46
    <105d>   DW_AT_decl_column : 9
    <105e>   DW_AT_sibling     : <0x10b1>
 <2><1062>: Abbrev Number: 14 (DW_TAG_member)
    <1063>   DW_AT_name        : (indirect string, offset: 0x8dfd5): Prescaler
    <1067>   DW_AT_decl_file   : 10
    <1068>   DW_AT_decl_line   : 48
    <1069>   DW_AT_decl_column : 12
    <106a>   DW_AT_type        : <0xa70>
    <106e>   DW_AT_data_member_location: 0
 <2><106f>: Abbrev Number: 14 (DW_TAG_member)
    <1070>   DW_AT_name        : (indirect string, offset: 0x8d4e5): CounterMode
    <1074>   DW_AT_decl_file   : 10
    <1075>   DW_AT_decl_line   : 51
    <1076>   DW_AT_decl_column : 12
    <1077>   DW_AT_type        : <0xa70>
    <107b>   DW_AT_data_member_location: 4
 <2><107c>: Abbrev Number: 14 (DW_TAG_member)
    <107d>   DW_AT_name        : (indirect string, offset: 0x89116): Period
    <1081>   DW_AT_decl_file   : 10
    <1082>   DW_AT_decl_line   : 54
    <1083>   DW_AT_decl_column : 12
    <1084>   DW_AT_type        : <0xa70>
    <1088>   DW_AT_data_member_location: 8
 <2><1089>: Abbrev Number: 14 (DW_TAG_member)
    <108a>   DW_AT_name        : (indirect string, offset: 0x8a908): ClockDivision
    <108e>   DW_AT_decl_file   : 10
    <108f>   DW_AT_decl_line   : 58
    <1090>   DW_AT_decl_column : 12
    <1091>   DW_AT_type        : <0xa70>
    <1095>   DW_AT_data_member_location: 12
 <2><1096>: Abbrev Number: 14 (DW_TAG_member)
    <1097>   DW_AT_name        : (indirect string, offset: 0x8c1f1): RepetitionCounter
    <109b>   DW_AT_decl_file   : 10
    <109c>   DW_AT_decl_line   : 61
    <109d>   DW_AT_decl_column : 12
    <109e>   DW_AT_type        : <0xa70>
    <10a2>   DW_AT_data_member_location: 16
 <2><10a3>: Abbrev Number: 14 (DW_TAG_member)
    <10a4>   DW_AT_name        : (indirect string, offset: 0x88f04): AutoReloadPreload
    <10a8>   DW_AT_decl_file   : 10
    <10a9>   DW_AT_decl_line   : 72
    <10aa>   DW_AT_decl_column : 12
    <10ab>   DW_AT_type        : <0xa70>
    <10af>   DW_AT_data_member_location: 20
 <2><10b0>: Abbrev Number: 0
 <1><10b1>: Abbrev Number: 3 (DW_TAG_typedef)
    <10b2>   DW_AT_name        : (indirect string, offset: 0x8d3f8): TIM_Base_InitTypeDef
    <10b6>   DW_AT_decl_file   : 10
    <10b7>   DW_AT_decl_line   : 74
    <10b8>   DW_AT_decl_column : 3
    <10b9>   DW_AT_type        : <0x1059>
 <1><10bd>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <10be>   DW_AT_encoding    : 7	(unsigned)
    <10bf>   DW_AT_byte_size   : 1
    <10c0>   DW_AT_type        : <0x9f2>
    <10c4>   DW_AT_decl_file   : 10
    <10c5>   DW_AT_decl_line   : 291
    <10c7>   DW_AT_decl_column : 1
    <10c8>   DW_AT_sibling     : <0x10eb>
 <2><10cc>: Abbrev Number: 12 (DW_TAG_enumerator)
    <10cd>   DW_AT_name        : (indirect string, offset: 0x8b04b): HAL_TIM_STATE_RESET
    <10d1>   DW_AT_const_value : 0
 <2><10d2>: Abbrev Number: 12 (DW_TAG_enumerator)
    <10d3>   DW_AT_name        : (indirect string, offset: 0x88aa2): HAL_TIM_STATE_READY
    <10d7>   DW_AT_const_value : 1
 <2><10d8>: Abbrev Number: 12 (DW_TAG_enumerator)
    <10d9>   DW_AT_name        : (indirect string, offset: 0x89ba7): HAL_TIM_STATE_BUSY
    <10dd>   DW_AT_const_value : 2
 <2><10de>: Abbrev Number: 12 (DW_TAG_enumerator)
    <10df>   DW_AT_name        : (indirect string, offset: 0x8cdbd): HAL_TIM_STATE_TIMEOUT
    <10e3>   DW_AT_const_value : 3
 <2><10e4>: Abbrev Number: 12 (DW_TAG_enumerator)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x8a489): HAL_TIM_STATE_ERROR
    <10e9>   DW_AT_const_value : 4
 <2><10ea>: Abbrev Number: 0
 <1><10eb>: Abbrev Number: 10 (DW_TAG_typedef)
    <10ec>   DW_AT_name        : (indirect string, offset: 0x8c25f): HAL_TIM_StateTypeDef
    <10f0>   DW_AT_decl_file   : 10
    <10f1>   DW_AT_decl_line   : 297
    <10f3>   DW_AT_decl_column : 3
    <10f4>   DW_AT_type        : <0x10bd>
 <1><10f8>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <10f9>   DW_AT_type        : <0x10eb>
 <1><10fd>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <10fe>   DW_AT_encoding    : 7	(unsigned)
    <10ff>   DW_AT_byte_size   : 1
    <1100>   DW_AT_type        : <0x9f2>
    <1104>   DW_AT_decl_file   : 10
    <1105>   DW_AT_decl_line   : 303
    <1107>   DW_AT_decl_column : 1
    <1108>   DW_AT_sibling     : <0x111f>
 <2><110c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <110d>   DW_AT_name        : (indirect string, offset: 0x8a3e9): HAL_TIM_CHANNEL_STATE_RESET
    <1111>   DW_AT_const_value : 0
 <2><1112>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1113>   DW_AT_name        : (indirect string, offset: 0x8b8f4): HAL_TIM_CHANNEL_STATE_READY
    <1117>   DW_AT_const_value : 1
 <2><1118>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1119>   DW_AT_name        : (indirect string, offset: 0x8aef6): HAL_TIM_CHANNEL_STATE_BUSY
    <111d>   DW_AT_const_value : 2
 <2><111e>: Abbrev Number: 0
 <1><111f>: Abbrev Number: 10 (DW_TAG_typedef)
    <1120>   DW_AT_name        : (indirect string, offset: 0x898be): HAL_TIM_ChannelStateTypeDef
    <1124>   DW_AT_decl_file   : 10
    <1125>   DW_AT_decl_line   : 307
    <1127>   DW_AT_decl_column : 3
    <1128>   DW_AT_type        : <0x10fd>
 <1><112c>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <112d>   DW_AT_type        : <0x111f>
 <1><1131>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <1132>   DW_AT_encoding    : 7	(unsigned)
    <1133>   DW_AT_byte_size   : 1
    <1134>   DW_AT_type        : <0x9f2>
    <1138>   DW_AT_decl_file   : 10
    <1139>   DW_AT_decl_line   : 313
    <113b>   DW_AT_decl_column : 1
    <113c>   DW_AT_sibling     : <0x1153>
 <2><1140>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1141>   DW_AT_name        : (indirect string, offset: 0x88a14): HAL_DMA_BURST_STATE_RESET
    <1145>   DW_AT_const_value : 0
 <2><1146>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1147>   DW_AT_name        : (indirect string, offset: 0x8b616): HAL_DMA_BURST_STATE_READY
    <114b>   DW_AT_const_value : 1
 <2><114c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <114d>   DW_AT_name        : (indirect string, offset: 0x8c544): HAL_DMA_BURST_STATE_BUSY
    <1151>   DW_AT_const_value : 2
 <2><1152>: Abbrev Number: 0
 <1><1153>: Abbrev Number: 10 (DW_TAG_typedef)
    <1154>   DW_AT_name        : (indirect string, offset: 0x89164): HAL_TIM_DMABurstStateTypeDef
    <1158>   DW_AT_decl_file   : 10
    <1159>   DW_AT_decl_line   : 317
    <115b>   DW_AT_decl_column : 3
    <115c>   DW_AT_type        : <0x1131>
 <1><1160>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <1161>   DW_AT_type        : <0x1153>
 <1><1165>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <1166>   DW_AT_encoding    : 7	(unsigned)
    <1167>   DW_AT_byte_size   : 1
    <1168>   DW_AT_type        : <0x9f2>
