Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xaef (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x43a7a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x5001): ../Core/Src/DS18B20.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x592c0): D:/STM32/STM32_CUBEIDE/_RTOS/_PROJECT/_RTOS_OLEDDMA_DS18B20/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x42d48): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x26f7d): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0x1aef6): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x63ac8): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0x6d5bb): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x2b907): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0xb8d5): long int
 <1><64>: Abbrev Number: 3 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x550d3): __uint32_t
    <69>   DW_AT_decl_file   : 2
    <6a>   DW_AT_decl_line   : 79
    <6b>   DW_AT_decl_column : 25
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x1f3d5): long unsigned int
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x3d1fb): long long int
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x1b76c): long long unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : int
 <1><8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0xb298): unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x26f7f): uint8_t
    <98>   DW_AT_decl_file   : 3
    <99>   DW_AT_decl_line   : 24
    <9a>   DW_AT_decl_column : 19
    <9b>   DW_AT_type        : <0x30>
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x88dfb): uint16_t
    <a4>   DW_AT_decl_file   : 3
    <a5>   DW_AT_decl_line   : 36
    <a6>   DW_AT_decl_column : 20
    <a7>   DW_AT_type        : <0x4a>
 <1><ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac>   DW_AT_name        : (indirect string, offset: 0x88ddb): uint32_t
    <b0>   DW_AT_decl_file   : 3
    <b1>   DW_AT_decl_line   : 48
    <b2>   DW_AT_decl_column : 20
    <b3>   DW_AT_type        : <0x64>
 <1><b7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b8>   DW_AT_type        : <0xab>
 <1><bc>: Abbrev Number: 6 (DW_TAG_structure_type)
    <bd>   DW_AT_byte_size   : 16
    <be>   DW_AT_decl_file   : 4
    <bf>   DW_AT_decl_line   : 290
    <c1>   DW_AT_decl_column : 9
    <c2>   DW_AT_sibling     : <0xff>
 <2><c6>: Abbrev Number: 7 (DW_TAG_member)
    <c7>   DW_AT_name        : CCR
    <cb>   DW_AT_decl_file   : 4
    <cc>   DW_AT_decl_line   : 292
    <ce>   DW_AT_decl_column : 17
    <cf>   DW_AT_type        : <0xb7>
    <d3>   DW_AT_data_member_location: 0
 <2><d4>: Abbrev Number: 8 (DW_TAG_member)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3365d): CNDTR
    <d9>   DW_AT_decl_file   : 4
    <da>   DW_AT_decl_line   : 293
    <dc>   DW_AT_decl_column : 17
    <dd>   DW_AT_type        : <0xb7>
    <e1>   DW_AT_data_member_location: 4
 <2><e2>: Abbrev Number: 8 (DW_TAG_member)
    <e3>   DW_AT_name        : (indirect string, offset: 0x7fea3): CPAR
    <e7>   DW_AT_decl_file   : 4
    <e8>   DW_AT_decl_line   : 294
    <ea>   DW_AT_decl_column : 17
    <eb>   DW_AT_type        : <0xb7>
    <ef>   DW_AT_data_member_location: 8
 <2><f0>: Abbrev Number: 8 (DW_TAG_member)
    <f1>   DW_AT_name        : (indirect string, offset: 0x49a07): CMAR
    <f5>   DW_AT_decl_file   : 4
    <f6>   DW_AT_decl_line   : 295
    <f8>   DW_AT_decl_column : 17
    <f9>   DW_AT_type        : <0xb7>
    <fd>   DW_AT_data_member_location: 12
 <2><fe>: Abbrev Number: 0
 <1><ff>: Abbrev Number: 9 (DW_TAG_typedef)
    <100>   DW_AT_name        : (indirect string, offset: 0x6cdc1): DMA_Channel_TypeDef
    <104>   DW_AT_decl_file   : 4
    <105>   DW_AT_decl_line   : 296
    <107>   DW_AT_decl_column : 3
    <108>   DW_AT_type        : <0xbc>
 <1><10c>: Abbrev Number: 6 (DW_TAG_structure_type)
    <10d>   DW_AT_byte_size   : 8
    <10e>   DW_AT_decl_file   : 4
    <10f>   DW_AT_decl_line   : 298
    <111>   DW_AT_decl_column : 9
    <112>   DW_AT_sibling     : <0x133>
 <2><116>: Abbrev Number: 7 (DW_TAG_member)
    <117>   DW_AT_name        : ISR
    <11b>   DW_AT_decl_file   : 4
    <11c>   DW_AT_decl_line   : 300
    <11e>   DW_AT_decl_column : 17
    <11f>   DW_AT_type        : <0xb7>
    <123>   DW_AT_data_member_location: 0
 <2><124>: Abbrev Number: 8 (DW_TAG_member)
    <125>   DW_AT_name        : (indirect string, offset: 0x5dc60): IFCR
    <129>   DW_AT_decl_file   : 4
    <12a>   DW_AT_decl_line   : 301
    <12c>   DW_AT_decl_column : 17
    <12d>   DW_AT_type        : <0xb7>
    <131>   DW_AT_data_member_location: 4
 <2><132>: Abbrev Number: 0
 <1><133>: Abbrev Number: 9 (DW_TAG_typedef)
    <134>   DW_AT_name        : (indirect string, offset: 0x305d0): DMA_TypeDef
    <138>   DW_AT_decl_file   : 4
    <139>   DW_AT_decl_line   : 302
    <13b>   DW_AT_decl_column : 3
    <13c>   DW_AT_type        : <0x10c>
 <1><140>: Abbrev Number: 6 (DW_TAG_structure_type)
    <141>   DW_AT_byte_size   : 28
    <142>   DW_AT_decl_file   : 4
    <143>   DW_AT_decl_line   : 357
    <145>   DW_AT_decl_column : 9
    <146>   DW_AT_sibling     : <0x1ad>
 <2><14a>: Abbrev Number: 7 (DW_TAG_member)
    <14b>   DW_AT_name        : CRL
    <14f>   DW_AT_decl_file   : 4
    <150>   DW_AT_decl_line   : 359
    <152>   DW_AT_decl_column : 17
    <153>   DW_AT_type        : <0xb7>
    <157>   DW_AT_data_member_location: 0
 <2><158>: Abbrev Number: 7 (DW_TAG_member)
    <159>   DW_AT_name        : CRH
    <15d>   DW_AT_decl_file   : 4
    <15e>   DW_AT_decl_line   : 360
    <160>   DW_AT_decl_column : 17
    <161>   DW_AT_type        : <0xb7>
    <165>   DW_AT_data_member_location: 4
 <2><166>: Abbrev Number: 7 (DW_TAG_member)
    <167>   DW_AT_name        : IDR
    <16b>   DW_AT_decl_file   : 4
    <16c>   DW_AT_decl_line   : 361
    <16e>   DW_AT_decl_column : 17
    <16f>   DW_AT_type        : <0xb7>
    <173>   DW_AT_data_member_location: 8
 <2><174>: Abbrev Number: 7 (DW_TAG_member)
    <175>   DW_AT_name        : ODR
    <179>   DW_AT_decl_file   : 4
    <17a>   DW_AT_decl_line   : 362
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xb7>
    <181>   DW_AT_data_member_location: 12
 <2><182>: Abbrev Number: 8 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x1db24): BSRR
    <187>   DW_AT_decl_file   : 4
    <188>   DW_AT_decl_line   : 363
    <18a>   DW_AT_decl_column : 17
    <18b>   DW_AT_type        : <0xb7>
    <18f>   DW_AT_data_member_location: 16
 <2><190>: Abbrev Number: 7 (DW_TAG_member)
    <191>   DW_AT_name        : BRR
    <195>   DW_AT_decl_file   : 4
    <196>   DW_AT_decl_line   : 364
    <198>   DW_AT_decl_column : 17
    <199>   DW_AT_type        : <0xb7>
    <19d>   DW_AT_data_member_location: 20
 <2><19e>: Abbrev Number: 8 (DW_TAG_member)
    <19f>   DW_AT_name        : (indirect string, offset: 0x72838): LCKR
    <1a3>   DW_AT_decl_file   : 4
    <1a4>   DW_AT_decl_line   : 365
    <1a6>   DW_AT_decl_column : 17
    <1a7>   DW_AT_type        : <0xb7>
    <1ab>   DW_AT_data_member_location: 24
 <2><1ac>: Abbrev Number: 0
 <1><1ad>: Abbrev Number: 9 (DW_TAG_typedef)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x80967): GPIO_TypeDef
    <1b2>   DW_AT_decl_file   : 4
    <1b3>   DW_AT_decl_line   : 366
    <1b5>   DW_AT_decl_column : 3
    <1b6>   DW_AT_type        : <0x140>
 <1><1ba>: Abbrev Number: 6 (DW_TAG_structure_type)
    <1bb>   DW_AT_byte_size   : 84
    <1bc>   DW_AT_decl_file   : 4
    <1bd>   DW_AT_decl_line   : 476
    <1bf>   DW_AT_decl_column : 9
    <1c0>   DW_AT_sibling     : <0x2e9>
 <2><1c4>: Abbrev Number: 7 (DW_TAG_member)
    <1c5>   DW_AT_name        : CR1
    <1c9>   DW_AT_decl_file   : 4
    <1ca>   DW_AT_decl_line   : 478
    <1cc>   DW_AT_decl_column : 17
    <1cd>   DW_AT_type        : <0xb7>
    <1d1>   DW_AT_data_member_location: 0
 <2><1d2>: Abbrev Number: 7 (DW_TAG_member)
    <1d3>   DW_AT_name        : CR2
    <1d7>   DW_AT_decl_file   : 4
    <1d8>   DW_AT_decl_line   : 479
    <1da>   DW_AT_decl_column : 17
    <1db>   DW_AT_type        : <0xb7>
    <1df>   DW_AT_data_member_location: 4
 <2><1e0>: Abbrev Number: 8 (DW_TAG_member)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x602f2): SMCR
    <1e5>   DW_AT_decl_file   : 4
    <1e6>   DW_AT_decl_line   : 480
    <1e8>   DW_AT_decl_column : 17
    <1e9>   DW_AT_type        : <0xb7>
    <1ed>   DW_AT_data_member_location: 8
 <2><1ee>: Abbrev Number: 8 (DW_TAG_member)
    <1ef>   DW_AT_name        : (indirect string, offset: 0x2a82d): DIER
    <1f3>   DW_AT_decl_file   : 4
    <1f4>   DW_AT_decl_line   : 481
    <1f6>   DW_AT_decl_column : 17
    <1f7>   DW_AT_type        : <0xb7>
    <1fb>   DW_AT_data_member_location: 12
 <2><1fc>: Abbrev Number: 7 (DW_TAG_member)
    <1fd>   DW_AT_name        : SR
    <200>   DW_AT_decl_file   : 4
    <201>   DW_AT_decl_line   : 482
    <203>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xb7>
    <208>   DW_AT_data_member_location: 16
 <2><209>: Abbrev Number: 7 (DW_TAG_member)
    <20a>   DW_AT_name        : EGR
    <20e>   DW_AT_decl_file   : 4
    <20f>   DW_AT_decl_line   : 483
    <211>   DW_AT_decl_column : 17
    <212>   DW_AT_type        : <0xb7>
    <216>   DW_AT_data_member_location: 20
 <2><217>: Abbrev Number: 8 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0x61e20): CCMR1
    <21c>   DW_AT_decl_file   : 4
    <21d>   DW_AT_decl_line   : 484
    <21f>   DW_AT_decl_column : 17
    <220>   DW_AT_type        : <0xb7>
    <224>   DW_AT_data_member_location: 24
 <2><225>: Abbrev Number: 8 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x3525f): CCMR2
    <22a>   DW_AT_decl_file   : 4
    <22b>   DW_AT_decl_line   : 485
    <22d>   DW_AT_decl_column : 17
    <22e>   DW_AT_type        : <0xb7>
    <232>   DW_AT_data_member_location: 28
 <2><233>: Abbrev Number: 8 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x17739): CCER
    <238>   DW_AT_decl_file   : 4
    <239>   DW_AT_decl_line   : 486
    <23b>   DW_AT_decl_column : 17
    <23c>   DW_AT_type        : <0xb7>
    <240>   DW_AT_data_member_location: 32
 <2><241>: Abbrev Number: 7 (DW_TAG_member)
    <242>   DW_AT_name        : CNT
    <246>   DW_AT_decl_file   : 4
    <247>   DW_AT_decl_line   : 487
    <249>   DW_AT_decl_column : 17
    <24a>   DW_AT_type        : <0xb7>
    <24e>   DW_AT_data_member_location: 36
 <2><24f>: Abbrev Number: 7 (DW_TAG_member)
    <250>   DW_AT_name        : PSC
    <254>   DW_AT_decl_file   : 4
    <255>   DW_AT_decl_line   : 488
    <257>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xb7>
    <25c>   DW_AT_data_member_location: 40
 <2><25d>: Abbrev Number: 7 (DW_TAG_member)
    <25e>   DW_AT_name        : ARR
    <262>   DW_AT_decl_file   : 4
    <263>   DW_AT_decl_line   : 489
    <265>   DW_AT_decl_column : 17
    <266>   DW_AT_type        : <0xb7>
    <26a>   DW_AT_data_member_location: 44
 <2><26b>: Abbrev Number: 7 (DW_TAG_member)
    <26c>   DW_AT_name        : RCR
    <270>   DW_AT_decl_file   : 4
    <271>   DW_AT_decl_line   : 490
    <273>   DW_AT_decl_column : 17
    <274>   DW_AT_type        : <0xb7>
    <278>   DW_AT_data_member_location: 48
 <2><279>: Abbrev Number: 8 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0xfde4): CCR1
    <27e>   DW_AT_decl_file   : 4
    <27f>   DW_AT_decl_line   : 491
    <281>   DW_AT_decl_column : 17
    <282>   DW_AT_type        : <0xb7>
    <286>   DW_AT_data_member_location: 52
 <2><287>: Abbrev Number: 8 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0x38395): CCR2
    <28c>   DW_AT_decl_file   : 4
    <28d>   DW_AT_decl_line   : 492
    <28f>   DW_AT_decl_column : 17
    <290>   DW_AT_type        : <0xb7>
    <294>   DW_AT_data_member_location: 56
 <2><295>: Abbrev Number: 8 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x6678e): CCR3
    <29a>   DW_AT_decl_file   : 4
    <29b>   DW_AT_decl_line   : 493
    <29d>   DW_AT_decl_column : 17
    <29e>   DW_AT_type        : <0xb7>
    <2a2>   DW_AT_data_member_location: 60
 <2><2a3>: Abbrev Number: 8 (DW_TAG_member)
    <2a4>   DW_AT_name        : (indirect string, offset: 0x872c): CCR4
    <2a8>   DW_AT_decl_file   : 4
    <2a9>   DW_AT_decl_line   : 494
    <2ab>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0xb7>
    <2b0>   DW_AT_data_member_location: 64
 <2><2b1>: Abbrev Number: 8 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x3dabe): BDTR
    <2b6>   DW_AT_decl_file   : 4
    <2b7>   DW_AT_decl_line   : 495
    <2b9>   DW_AT_decl_column : 17
    <2ba>   DW_AT_type        : <0xb7>
    <2be>   DW_AT_data_member_location: 68
 <2><2bf>: Abbrev Number: 7 (DW_TAG_member)
    <2c0>   DW_AT_name        : DCR
    <2c4>   DW_AT_decl_file   : 4
    <2c5>   DW_AT_decl_line   : 496
    <2c7>   DW_AT_decl_column : 17
    <2c8>   DW_AT_type        : <0xb7>
    <2cc>   DW_AT_data_member_location: 72
 <2><2cd>: Abbrev Number: 8 (DW_TAG_member)
    <2ce>   DW_AT_name        : (indirect string, offset: 0x72c08): DMAR
    <2d2>   DW_AT_decl_file   : 4
    <2d3>   DW_AT_decl_line   : 497
    <2d5>   DW_AT_decl_column : 17
    <2d6>   DW_AT_type        : <0xb7>
    <2da>   DW_AT_data_member_location: 76
 <2><2db>: Abbrev Number: 7 (DW_TAG_member)
    <2dc>   DW_AT_name        : OR
    <2df>   DW_AT_decl_file   : 4
    <2e0>   DW_AT_decl_line   : 498
    <2e2>   DW_AT_decl_column : 17
    <2e3>   DW_AT_type        : <0xb7>
    <2e7>   DW_AT_data_member_location: 80
 <2><2e8>: Abbrev Number: 0
 <1><2e9>: Abbrev Number: 9 (DW_TAG_typedef)
    <2ea>   DW_AT_name        : (indirect string, offset: 0x1c503): TIM_TypeDef
    <2ee>   DW_AT_decl_file   : 4
    <2ef>   DW_AT_decl_line   : 499
    <2f1>   DW_AT_decl_column : 2
    <2f2>   DW_AT_type        : <0x1ba>
 <1><2f6>: Abbrev Number: 2 (DW_TAG_base_type)
    <2f7>   DW_AT_byte_size   : 8
    <2f8>   DW_AT_encoding    : 4	(float)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x859b4): long double
 <1><2fd>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <2fe>   DW_AT_encoding    : 7	(unsigned)
    <2ff>   DW_AT_byte_size   : 1
    <300>   DW_AT_type        : <0x3c>
    <304>   DW_AT_decl_file   : 5
    <305>   DW_AT_decl_line   : 50
    <306>   DW_AT_decl_column : 1
    <307>   DW_AT_sibling     : <0x318>
 <2><30b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <30c>   DW_AT_name        : (indirect string, offset: 0x62dd6): HAL_UNLOCKED
    <310>   DW_AT_const_value : 0
 <2><311>: Abbrev Number: 11 (DW_TAG_enumerator)
    <312>   DW_AT_name        : (indirect string, offset: 0x8464d): HAL_LOCKED
    <316>   DW_AT_const_value : 1
 <2><317>: Abbrev Number: 0
 <1><318>: Abbrev Number: 3 (DW_TAG_typedef)
    <319>   DW_AT_name        : (indirect string, offset: 0x4e88c): HAL_LockTypeDef
    <31d>   DW_AT_decl_file   : 5
    <31e>   DW_AT_decl_line   : 53
    <31f>   DW_AT_decl_column : 3
    <320>   DW_AT_type        : <0x2fd>
 <1><324>: Abbrev Number: 12 (DW_TAG_structure_type)
    <325>   DW_AT_byte_size   : 16
    <326>   DW_AT_decl_file   : 6
    <327>   DW_AT_decl_line   : 46
    <328>   DW_AT_decl_column : 9
    <329>   DW_AT_sibling     : <0x362>
 <2><32d>: Abbrev Number: 13 (DW_TAG_member)
    <32e>   DW_AT_name        : Pin
    <332>   DW_AT_decl_file   : 6
    <333>   DW_AT_decl_line   : 48
    <334>   DW_AT_decl_column : 12
    <335>   DW_AT_type        : <0xab>
    <339>   DW_AT_data_member_location: 0
 <2><33a>: Abbrev Number: 14 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x93d10): Mode
    <33f>   DW_AT_decl_file   : 6
    <340>   DW_AT_decl_line   : 51
    <341>   DW_AT_decl_column : 12
    <342>   DW_AT_type        : <0xab>
    <346>   DW_AT_data_member_location: 4
 <2><347>: Abbrev Number: 14 (DW_TAG_member)
    <348>   DW_AT_name        : (indirect string, offset: 0x44c56): Pull
    <34c>   DW_AT_decl_file   : 6
    <34d>   DW_AT_decl_line   : 54
    <34e>   DW_AT_decl_column : 12
    <34f>   DW_AT_type        : <0xab>
    <353>   DW_AT_data_member_location: 8
 <2><354>: Abbrev Number: 14 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0x8fe12): Speed
    <359>   DW_AT_decl_file   : 6
    <35a>   DW_AT_decl_line   : 57
    <35b>   DW_AT_decl_column : 12
    <35c>   DW_AT_type        : <0xab>
    <360>   DW_AT_data_member_location: 12
 <2><361>: Abbrev Number: 0
 <1><362>: Abbrev Number: 3 (DW_TAG_typedef)
    <363>   DW_AT_name        : (indirect string, offset: 0x7a7f1): GPIO_InitTypeDef
    <367>   DW_AT_decl_file   : 6
    <368>   DW_AT_decl_line   : 59
    <369>   DW_AT_decl_column : 3
    <36a>   DW_AT_type        : <0x324>
 <1><36e>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <36f>   DW_AT_encoding    : 7	(unsigned)
    <370>   DW_AT_byte_size   : 1
    <371>   DW_AT_type        : <0x3c>
    <375>   DW_AT_decl_file   : 6
    <376>   DW_AT_decl_line   : 65
    <377>   DW_AT_decl_column : 1
    <378>   DW_AT_sibling     : <0x389>
 <2><37c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <37d>   DW_AT_name        : (indirect string, offset: 0x1b4c2): GPIO_PIN_RESET
    <381>   DW_AT_const_value : 0
 <2><382>: Abbrev Number: 11 (DW_TAG_enumerator)
    <383>   DW_AT_name        : (indirect string, offset: 0x175ac): GPIO_PIN_SET
    <387>   DW_AT_const_value : 1
 <2><388>: Abbrev Number: 0
 <1><389>: Abbrev Number: 3 (DW_TAG_typedef)
    <38a>   DW_AT_name        : (indirect string, offset: 0x82153): GPIO_PinState
    <38e>   DW_AT_decl_file   : 6
    <38f>   DW_AT_decl_line   : 68
    <390>   DW_AT_decl_column : 3
    <391>   DW_AT_type        : <0x36e>
 <1><395>: Abbrev Number: 12 (DW_TAG_structure_type)
    <396>   DW_AT_byte_size   : 28
    <397>   DW_AT_decl_file   : 7
    <398>   DW_AT_decl_line   : 47
    <399>   DW_AT_decl_column : 9
    <39a>   DW_AT_sibling     : <0x3fa>
 <2><39e>: Abbrev Number: 14 (DW_TAG_member)
    <39f>   DW_AT_name        : (indirect string, offset: 0x931be): Direction
    <3a3>   DW_AT_decl_file   : 7
    <3a4>   DW_AT_decl_line   : 49
    <3a5>   DW_AT_decl_column : 12
    <3a6>   DW_AT_type        : <0xab>
    <3aa>   DW_AT_data_member_location: 0
 <2><3ab>: Abbrev Number: 14 (DW_TAG_member)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x9004): PeriphInc
    <3b0>   DW_AT_decl_file   : 7
    <3b1>   DW_AT_decl_line   : 53
    <3b2>   DW_AT_decl_column : 12
    <3b3>   DW_AT_type        : <0xab>
    <3b7>   DW_AT_data_member_location: 4
 <2><3b8>: Abbrev Number: 14 (DW_TAG_member)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x14def): MemInc
    <3bd>   DW_AT_decl_file   : 7
    <3be>   DW_AT_decl_line   : 56
    <3bf>   DW_AT_decl_column : 12
    <3c0>   DW_AT_type        : <0xab>
    <3c4>   DW_AT_data_member_location: 8
 <2><3c5>: Abbrev Number: 14 (DW_TAG_member)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x4262f): PeriphDataAlignment
    <3ca>   DW_AT_decl_file   : 7
    <3cb>   DW_AT_decl_line   : 59
    <3cc>   DW_AT_decl_column : 12
    <3cd>   DW_AT_type        : <0xab>
    <3d1>   DW_AT_data_member_location: 12
 <2><3d2>: Abbrev Number: 14 (DW_TAG_member)
    <3d3>   DW_AT_name        : (indirect string, offset: 0x783c2): MemDataAlignment
    <3d7>   DW_AT_decl_file   : 7
    <3d8>   DW_AT_decl_line   : 62
    <3d9>   DW_AT_decl_column : 12
    <3da>   DW_AT_type        : <0xab>
    <3de>   DW_AT_data_member_location: 16
 <2><3df>: Abbrev Number: 14 (DW_TAG_member)
    <3e0>   DW_AT_name        : (indirect string, offset: 0x93d10): Mode
    <3e4>   DW_AT_decl_file   : 7
    <3e5>   DW_AT_decl_line   : 65
    <3e6>   DW_AT_decl_column : 12
    <3e7>   DW_AT_type        : <0xab>
    <3eb>   DW_AT_data_member_location: 20
 <2><3ec>: Abbrev Number: 14 (DW_TAG_member)
    <3ed>   DW_AT_name        : (indirect string, offset: 0x92413): Priority
    <3f1>   DW_AT_decl_file   : 7
    <3f2>   DW_AT_decl_line   : 70
    <3f3>   DW_AT_decl_column : 12
    <3f4>   DW_AT_type        : <0xab>
    <3f8>   DW_AT_data_member_location: 24
 <2><3f9>: Abbrev Number: 0
 <1><3fa>: Abbrev Number: 3 (DW_TAG_typedef)
    <3fb>   DW_AT_name        : (indirect string, offset: 0x23975): DMA_InitTypeDef
    <3ff>   DW_AT_decl_file   : 7
    <400>   DW_AT_decl_line   : 72
    <401>   DW_AT_decl_column : 3
    <402>   DW_AT_type        : <0x395>
 <1><406>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <407>   DW_AT_encoding    : 7	(unsigned)
    <408>   DW_AT_byte_size   : 1
    <409>   DW_AT_type        : <0x3c>
    <40d>   DW_AT_decl_file   : 7
    <40e>   DW_AT_decl_line   : 78
    <40f>   DW_AT_decl_column : 1
    <410>   DW_AT_sibling     : <0x42d>
 <2><414>: Abbrev Number: 11 (DW_TAG_enumerator)
    <415>   DW_AT_name        : (indirect string, offset: 0x63d5a): HAL_DMA_STATE_RESET
    <419>   DW_AT_const_value : 0
 <2><41a>: Abbrev Number: 11 (DW_TAG_enumerator)
    <41b>   DW_AT_name        : (indirect string, offset: 0x2467a): HAL_DMA_STATE_READY
    <41f>   DW_AT_const_value : 1
 <2><420>: Abbrev Number: 11 (DW_TAG_enumerator)
    <421>   DW_AT_name        : (indirect string, offset: 0x5cdd5): HAL_DMA_STATE_BUSY
    <425>   DW_AT_const_value : 2
 <2><426>: Abbrev Number: 11 (DW_TAG_enumerator)
    <427>   DW_AT_name        : (indirect string, offset: 0x8240e): HAL_DMA_STATE_TIMEOUT
    <42b>   DW_AT_const_value : 3
 <2><42c>: Abbrev Number: 0
 <1><42d>: Abbrev Number: 3 (DW_TAG_typedef)
    <42e>   DW_AT_name        : (indirect string, offset: 0x5935f): HAL_DMA_StateTypeDef
    <432>   DW_AT_decl_file   : 7
    <433>   DW_AT_decl_line   : 83
    <434>   DW_AT_decl_column : 2
    <435>   DW_AT_type        : <0x406>
 <1><439>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <43a>   DW_AT_type        : <0x42d>
 <1><43e>: Abbrev Number: 15 (DW_TAG_structure_type)
    <43f>   DW_AT_name        : (indirect string, offset: 0x71c2c): __DMA_HandleTypeDef
    <443>   DW_AT_byte_size   : 68
    <444>   DW_AT_decl_file   : 7
    <445>   DW_AT_decl_line   : 110
    <446>   DW_AT_decl_column : 16
    <447>   DW_AT_sibling     : <0x4e8>
 <2><44b>: Abbrev Number: 14 (DW_TAG_member)
    <44c>   DW_AT_name        : (indirect string, offset: 0x33cdc): Instance
    <450>   DW_AT_decl_file   : 7
    <451>   DW_AT_decl_line   : 112
    <452>   DW_AT_decl_column : 31
    <453>   DW_AT_type        : <0x4e8>
    <457>   DW_AT_data_member_location: 0
 <2><458>: Abbrev Number: 14 (DW_TAG_member)
    <459>   DW_AT_name        : (indirect string, offset: 0x7c881): Init
    <45d>   DW_AT_decl_file   : 7
    <45e>   DW_AT_decl_line   : 114
    <45f>   DW_AT_decl_column : 30
    <460>   DW_AT_type        : <0x3fa>
    <464>   DW_AT_data_member_location: 4
 <2><465>: Abbrev Number: 14 (DW_TAG_member)
    <466>   DW_AT_name        : (indirect string, offset: 0x5f6ef): Lock
    <46a>   DW_AT_decl_file   : 7
    <46b>   DW_AT_decl_line   : 116
    <46c>   DW_AT_decl_column : 30
    <46d>   DW_AT_type        : <0x318>
    <471>   DW_AT_data_member_location: 32
 <2><472>: Abbrev Number: 14 (DW_TAG_member)
    <473>   DW_AT_name        : (indirect string, offset: 0x8e434): State
    <477>   DW_AT_decl_file   : 7
    <478>   DW_AT_decl_line   : 118
    <479>   DW_AT_decl_column : 30
    <47a>   DW_AT_type        : <0x439>
    <47e>   DW_AT_data_member_location: 33
 <2><47f>: Abbrev Number: 14 (DW_TAG_member)
    <480>   DW_AT_name        : (indirect string, offset: 0x7e156): Parent
    <484>   DW_AT_decl_file   : 7
    <485>   DW_AT_decl_line   : 120
    <486>   DW_AT_decl_column : 31
    <487>   DW_AT_type        : <0x4ee>
    <48b>   DW_AT_data_member_location: 36
 <2><48c>: Abbrev Number: 14 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0x83c9a): XferCpltCallback
    <491>   DW_AT_decl_file   : 7
    <492>   DW_AT_decl_line   : 122
    <493>   DW_AT_decl_column : 33
    <494>   DW_AT_type        : <0x501>
    <498>   DW_AT_data_member_location: 40
 <2><499>: Abbrev Number: 14 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0x67ffb): XferHalfCpltCallback
    <49e>   DW_AT_decl_file   : 7
    <49f>   DW_AT_decl_line   : 124
    <4a0>   DW_AT_decl_column : 33
    <4a1>   DW_AT_type        : <0x501>
    <4a5>   DW_AT_data_member_location: 44
 <2><4a6>: Abbrev Number: 14 (DW_TAG_member)
    <4a7>   DW_AT_name        : (indirect string, offset: 0x1313f): XferErrorCallback
    <4ab>   DW_AT_decl_file   : 7
    <4ac>   DW_AT_decl_line   : 126
    <4ad>   DW_AT_decl_column : 33
    <4ae>   DW_AT_type        : <0x501>
    <4b2>   DW_AT_data_member_location: 48
 <2><4b3>: Abbrev Number: 14 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x7bd66): XferAbortCallback
    <4b8>   DW_AT_decl_file   : 7
    <4b9>   DW_AT_decl_line   : 128
    <4ba>   DW_AT_decl_column : 33
    <4bb>   DW_AT_type        : <0x501>
    <4bf>   DW_AT_data_member_location: 52
 <2><4c0>: Abbrev Number: 14 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x8179c): ErrorCode
    <4c5>   DW_AT_decl_file   : 7
    <4c6>   DW_AT_decl_line   : 130
    <4c7>   DW_AT_decl_column : 30
    <4c8>   DW_AT_type        : <0xb7>
    <4cc>   DW_AT_data_member_location: 56
 <2><4cd>: Abbrev Number: 14 (DW_TAG_member)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x39166): DmaBaseAddress
    <4d2>   DW_AT_decl_file   : 7
    <4d3>   DW_AT_decl_line   : 132
    <4d4>   DW_AT_decl_column : 31
    <4d5>   DW_AT_type        : <0x507>
    <4d9>   DW_AT_data_member_location: 60
 <2><4da>: Abbrev Number: 14 (DW_TAG_member)
    <4db>   DW_AT_name        : (indirect string, offset: 0x1b551): ChannelIndex
    <4df>   DW_AT_decl_file   : 7
    <4e0>   DW_AT_decl_line   : 134
    <4e1>   DW_AT_decl_column : 30
    <4e2>   DW_AT_type        : <0xab>
    <4e6>   DW_AT_data_member_location: 64
 <2><4e7>: Abbrev Number: 0
 <1><4e8>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <4e9>   DW_AT_byte_size   : 4
    <4ea>   DW_AT_type        : <0xff>
 <1><4ee>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <4ef>   DW_AT_byte_size   : 4
 <1><4f0>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <4f1>   DW_AT_prototyped  : 1
    <4f1>   DW_AT_sibling     : <0x4fb>
 <2><4f5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <4f6>   DW_AT_type        : <0x4fb>
 <2><4fa>: Abbrev Number: 0
 <1><4fb>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <4fc>   DW_AT_byte_size   : 4
    <4fd>   DW_AT_type        : <0x43e>
 <1><501>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <502>   DW_AT_byte_size   : 4
    <503>   DW_AT_type        : <0x4f0>
 <1><507>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <508>   DW_AT_byte_size   : 4
    <509>   DW_AT_type        : <0x133>
 <1><50d>: Abbrev Number: 3 (DW_TAG_typedef)
    <50e>   DW_AT_name        : (indirect string, offset: 0x71c2e): DMA_HandleTypeDef
    <512>   DW_AT_decl_file   : 7
    <513>   DW_AT_decl_line   : 136
    <514>   DW_AT_decl_column : 3
    <515>   DW_AT_type        : <0x43e>
 <1><519>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <51a>   DW_AT_byte_size   : 4
    <51b>   DW_AT_type        : <0x50d>
 <1><51f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <520>   DW_AT_byte_size   : 24
    <521>   DW_AT_decl_file   : 8
    <522>   DW_AT_decl_line   : 46
    <523>   DW_AT_decl_column : 9
    <524>   DW_AT_sibling     : <0x577>
 <2><528>: Abbrev Number: 14 (DW_TAG_member)
    <529>   DW_AT_name        : (indirect string, offset: 0x9085d): Prescaler
    <52d>   DW_AT_decl_file   : 8
    <52e>   DW_AT_decl_line   : 48
    <52f>   DW_AT_decl_column : 12
    <530>   DW_AT_type        : <0xab>
    <534>   DW_AT_data_member_location: 0
 <2><535>: Abbrev Number: 14 (DW_TAG_member)
    <536>   DW_AT_name        : (indirect string, offset: 0x78b9e): CounterMode
    <53a>   DW_AT_decl_file   : 8
    <53b>   DW_AT_decl_line   : 51
    <53c>   DW_AT_decl_column : 12
    <53d>   DW_AT_type        : <0xab>
    <541>   DW_AT_data_member_location: 4
 <2><542>: Abbrev Number: 14 (DW_TAG_member)
    <543>   DW_AT_name        : (indirect string, offset: 0x686a9): Period
    <547>   DW_AT_decl_file   : 8
    <548>   DW_AT_decl_line   : 54
    <549>   DW_AT_decl_column : 12
    <54a>   DW_AT_type        : <0xab>
    <54e>   DW_AT_data_member_location: 8
 <2><54f>: Abbrev Number: 14 (DW_TAG_member)
    <550>   DW_AT_name        : (indirect string, offset: 0x36405): ClockDivision
    <554>   DW_AT_decl_file   : 8
    <555>   DW_AT_decl_line   : 58
    <556>   DW_AT_decl_column : 12
    <557>   DW_AT_type        : <0xab>
    <55b>   DW_AT_data_member_location: 12
 <2><55c>: Abbrev Number: 14 (DW_TAG_member)
    <55d>   DW_AT_name        : (indirect string, offset: 0x5dd38): RepetitionCounter
    <561>   DW_AT_decl_file   : 8
    <562>   DW_AT_decl_line   : 61
    <563>   DW_AT_decl_column : 12
    <564>   DW_AT_type        : <0xab>
    <568>   DW_AT_data_member_location: 16
 <2><569>: Abbrev Number: 14 (DW_TAG_member)
    <56a>   DW_AT_name        : (indirect string, offset: 0xd712): AutoReloadPreload
    <56e>   DW_AT_decl_file   : 8
    <56f>   DW_AT_decl_line   : 72
    <570>   DW_AT_decl_column : 12
    <571>   DW_AT_type        : <0xab>
    <575>   DW_AT_data_member_location: 20
 <2><576>: Abbrev Number: 0
 <1><577>: Abbrev Number: 3 (DW_TAG_typedef)
    <578>   DW_AT_name        : (indirect string, offset: 0x7741a): TIM_Base_InitTypeDef
    <57c>   DW_AT_decl_file   : 8
    <57d>   DW_AT_decl_line   : 74
    <57e>   DW_AT_decl_column : 3
    <57f>   DW_AT_type        : <0x51f>
 <1><583>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <584>   DW_AT_encoding    : 7	(unsigned)
    <585>   DW_AT_byte_size   : 1
    <586>   DW_AT_type        : <0x3c>
    <58a>   DW_AT_decl_file   : 8
    <58b>   DW_AT_decl_line   : 291
    <58d>   DW_AT_decl_column : 1
    <58e>   DW_AT_sibling     : <0x5b1>
 <2><592>: Abbrev Number: 11 (DW_TAG_enumerator)
    <593>   DW_AT_name        : (indirect string, offset: 0x43336): HAL_TIM_STATE_RESET
    <597>   DW_AT_const_value : 0
 <2><598>: Abbrev Number: 11 (DW_TAG_enumerator)
    <599>   DW_AT_name        : (indirect string, offset: 0x4e46): HAL_TIM_STATE_READY
    <59d>   DW_AT_const_value : 1
 <2><59e>: Abbrev Number: 11 (DW_TAG_enumerator)
    <59f>   DW_AT_name        : (indirect string, offset: 0x2154f): HAL_TIM_STATE_BUSY
    <5a3>   DW_AT_const_value : 2
 <2><5a4>: Abbrev Number: 11 (DW_TAG_enumerator)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x6fdbe): HAL_TIM_STATE_TIMEOUT
    <5a9>   DW_AT_const_value : 3
 <2><5aa>: Abbrev Number: 11 (DW_TAG_enumerator)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x309e7): HAL_TIM_STATE_ERROR
    <5af>   DW_AT_const_value : 4
 <2><5b0>: Abbrev Number: 0
 <1><5b1>: Abbrev Number: 9 (DW_TAG_typedef)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x60f71): HAL_TIM_StateTypeDef
    <5b6>   DW_AT_decl_file   : 8
    <5b7>   DW_AT_decl_line   : 297
    <5b9>   DW_AT_decl_column : 3
    <5ba>   DW_AT_type        : <0x583>
 <1><5be>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <5bf>   DW_AT_type        : <0x5b1>
 <1><5c3>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <5c4>   DW_AT_encoding    : 7	(unsigned)
    <5c5>   DW_AT_byte_size   : 1
    <5c6>   DW_AT_type        : <0x3c>
    <5ca>   DW_AT_decl_file   : 8
    <5cb>   DW_AT_decl_line   : 303
    <5cd>   DW_AT_decl_column : 1
    <5ce>   DW_AT_sibling     : <0x5e5>
 <2><5d2>: Abbrev Number: 11 (DW_TAG_enumerator)
    <5d3>   DW_AT_name        : (indirect string, offset: 0x2f5b3): HAL_TIM_CHANNEL_STATE_RESET
    <5d7>   DW_AT_const_value : 0
 <2><5d8>: Abbrev Number: 11 (DW_TAG_enumerator)
    <5d9>   DW_AT_name        : (indirect string, offset: 0x4e44a): HAL_TIM_CHANNEL_STATE_READY
    <5dd>   DW_AT_const_value : 1
 <2><5de>: Abbrev Number: 11 (DW_TAG_enumerator)
    <5df>   DW_AT_name        : (indirect string, offset: 0x406a3): HAL_TIM_CHANNEL_STATE_BUSY
    <5e3>   DW_AT_const_value : 2
 <2><5e4>: Abbrev Number: 0
 <1><5e5>: Abbrev Number: 9 (DW_TAG_typedef)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x1baea): HAL_TIM_ChannelStateTypeDef
    <5ea>   DW_AT_decl_file   : 8
    <5eb>   DW_AT_decl_line   : 307
    <5ed>   DW_AT_decl_column : 3
    <5ee>   DW_AT_type        : <0x5c3>
 <1><5f2>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <5f3>   DW_AT_type        : <0x5e5>
 <1><5f7>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <5f8>   DW_AT_encoding    : 7	(unsigned)
    <5f9>   DW_AT_byte_size   : 1
    <5fa>   DW_AT_type        : <0x3c>
    <5fe>   DW_AT_decl_file   : 8
    <5ff>   DW_AT_decl_line   : 313
    <601>   DW_AT_decl_column : 1
    <602>   DW_AT_sibling     : <0x619>
 <2><606>: Abbrev Number: 11 (DW_TAG_enumerator)
    <607>   DW_AT_name        : (indirect string, offset: 0x2b5e): HAL_DMA_BURST_STATE_RESET
    <60b>   DW_AT_const_value : 0
 <2><60c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <60d>   DW_AT_name        : (indirect string, offset: 0x497f7): HAL_DMA_BURST_STATE_READY
    <611>   DW_AT_const_value : 1
 <2><612>: Abbrev Number: 11 (DW_TAG_enumerator)
    <613>   DW_AT_name        : (indirect string, offset: 0x64701): HAL_DMA_BURST_STATE_BUSY
    <617>   DW_AT_const_value : 2
 <2><618>: Abbrev Number: 0
 <1><619>: Abbrev Number: 9 (DW_TAG_typedef)
    <61a>   DW_AT_name        : (indirect string, offset: 0x11db1): HAL_TIM_DMABurstStateTypeDef
    <61e>   DW_AT_decl_file   : 8
    <61f>   DW_AT_decl_line   : 317
    <621>   DW_AT_decl_column : 3
    <622>   DW_AT_type        : <0x5f7>
 <1><626>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <627>   DW_AT_type        : <0x619>
 <1><62b>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <62c>   DW_AT_encoding    : 7	(unsigned)
    <62d>   DW_AT_byte_size   : 1
    <62e>   DW_AT_type        : <0x3c>
    <632>   DW_AT_decl_file   : 8
    <633>   DW_AT_decl_line   : 323
    <635>   DW_AT_decl_column : 1
    <636>   DW_AT_sibling     : <0x659>
 <2><63a>: Abbrev Number: 11 (DW_TAG_enumerator)
    <63b>   DW_AT_name        : (indirect string, offset: 0x4ad62): HAL_TIM_ACTIVE_CHANNEL_1
    <63f>   DW_AT_const_value : 1
 <2><640>: Abbrev Number: 11 (DW_TAG_enumerator)
    <641>   DW_AT_name        : (indirect string, offset: 0x4ad7b): HAL_TIM_ACTIVE_CHANNEL_2
    <645>   DW_AT_const_value : 2
 <2><646>: Abbrev Number: 11 (DW_TAG_enumerator)
    <647>   DW_AT_name        : (indirect string, offset: 0x4ad94): HAL_TIM_ACTIVE_CHANNEL_3
    <64b>   DW_AT_const_value : 4
 <2><64c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <64d>   DW_AT_name        : (indirect string, offset: 0x4adad): HAL_TIM_ACTIVE_CHANNEL_4
    <651>   DW_AT_const_value : 8
 <2><652>: Abbrev Number: 11 (DW_TAG_enumerator)
    <653>   DW_AT_name        : (indirect string, offset: 0x3707b): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <657>   DW_AT_const_value : 0
 <2><658>: Abbrev Number: 0
 <1><659>: Abbrev Number: 9 (DW_TAG_typedef)
    <65a>   DW_AT_name        : (indirect string, offset: 0x1ad5f): HAL_TIM_ActiveChannel
    <65e>   DW_AT_decl_file   : 8
    <65f>   DW_AT_decl_line   : 329
    <661>   DW_AT_decl_column : 3
    <662>   DW_AT_type        : <0x62b>
 <1><666>: Abbrev Number: 6 (DW_TAG_structure_type)
    <667>   DW_AT_byte_size   : 72
    <668>   DW_AT_decl_file   : 8
    <669>   DW_AT_decl_line   : 337
    <66b>   DW_AT_decl_column : 9
    <66c>   DW_AT_sibling     : <0x6ef>
 <2><670>: Abbrev Number: 8 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0x33cdc): Instance
    <675>   DW_AT_decl_file   : 8
    <676>   DW_AT_decl_line   : 340
    <678>   DW_AT_decl_column : 39
    <679>   DW_AT_type        : <0x6ef>
    <67d>   DW_AT_data_member_location: 0
 <2><67e>: Abbrev Number: 8 (DW_TAG_member)
    <67f>   DW_AT_name        : (indirect string, offset: 0x7c881): Init
    <683>   DW_AT_decl_file   : 8
    <684>   DW_AT_decl_line   : 341
    <686>   DW_AT_decl_column : 38
    <687>   DW_AT_type        : <0x577>
    <68b>   DW_AT_data_member_location: 4
 <2><68c>: Abbrev Number: 8 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0x1ad6d): Channel
    <691>   DW_AT_decl_file   : 8
    <692>   DW_AT_decl_line   : 342
    <694>   DW_AT_decl_column : 38
    <695>   DW_AT_type        : <0x659>
    <699>   DW_AT_data_member_location: 28
 <2><69a>: Abbrev Number: 8 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0x50230): hdma
    <69f>   DW_AT_decl_file   : 8
    <6a0>   DW_AT_decl_line   : 343
    <6a2>   DW_AT_decl_column : 39
    <6a3>   DW_AT_type        : <0x6f5>
    <6a7>   DW_AT_data_member_location: 32
 <2><6a8>: Abbrev Number: 8 (DW_TAG_member)
    <6a9>   DW_AT_name        : (indirect string, offset: 0x5f6ef): Lock
    <6ad>   DW_AT_decl_file   : 8
    <6ae>   DW_AT_decl_line   : 345
    <6b0>   DW_AT_decl_column : 38
    <6b1>   DW_AT_type        : <0x318>
    <6b5>   DW_AT_data_member_location: 60
 <2><6b6>: Abbrev Number: 8 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0x8e434): State
    <6bb>   DW_AT_decl_file   : 8
    <6bc>   DW_AT_decl_line   : 346
    <6be>   DW_AT_decl_column : 38
    <6bf>   DW_AT_type        : <0x5be>
    <6c3>   DW_AT_data_member_location: 61
 <2><6c4>: Abbrev Number: 8 (DW_TAG_member)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x94367): ChannelState
    <6c9>   DW_AT_decl_file   : 8
    <6ca>   DW_AT_decl_line   : 347
    <6cc>   DW_AT_decl_column : 38
    <6cd>   DW_AT_type        : <0x715>
    <6d1>   DW_AT_data_member_location: 62
 <2><6d2>: Abbrev Number: 8 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0x948fa): ChannelNState
    <6d7>   DW_AT_decl_file   : 8
    <6d8>   DW_AT_decl_line   : 348
    <6da>   DW_AT_decl_column : 38
    <6db>   DW_AT_type        : <0x715>
    <6df>   DW_AT_data_member_location: 66
 <2><6e0>: Abbrev Number: 8 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x93ee0): DMABurstState
    <6e5>   DW_AT_decl_file   : 8
    <6e6>   DW_AT_decl_line   : 349
    <6e8>   DW_AT_decl_column : 38
    <6e9>   DW_AT_type        : <0x626>
    <6ed>   DW_AT_data_member_location: 70
 <2><6ee>: Abbrev Number: 0
 <1><6ef>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6f0>   DW_AT_byte_size   : 4
    <6f1>   DW_AT_type        : <0x2e9>
 <1><6f5>: Abbrev Number: 21 (DW_TAG_array_type)
    <6f6>   DW_AT_type        : <0x519>
    <6fa>   DW_AT_sibling     : <0x705>
 <2><6fe>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <6ff>   DW_AT_type        : <0x8c>
    <703>   DW_AT_upper_bound : 6
 <2><704>: Abbrev Number: 0
 <1><705>: Abbrev Number: 21 (DW_TAG_array_type)
    <706>   DW_AT_type        : <0x5f2>
    <70a>   DW_AT_sibling     : <0x715>
 <2><70e>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <70f>   DW_AT_type        : <0x8c>
    <713>   DW_AT_upper_bound : 3
 <2><714>: Abbrev Number: 0
 <1><715>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <716>   DW_AT_type        : <0x705>
 <1><71a>: Abbrev Number: 9 (DW_TAG_typedef)
    <71b>   DW_AT_name        : (indirect string, offset: 0x2dc37): TIM_HandleTypeDef
    <71f>   DW_AT_decl_file   : 8
    <720>   DW_AT_decl_line   : 380
    <722>   DW_AT_decl_column : 3
    <723>   DW_AT_type        : <0x666>
 <1><727>: Abbrev Number: 12 (DW_TAG_structure_type)
    <728>   DW_AT_byte_size   : 16
    <729>   DW_AT_decl_file   : 9
    <72a>   DW_AT_decl_line   : 18
    <72b>   DW_AT_decl_column : 9
    <72c>   DW_AT_sibling     : <0x765>
 <2><730>: Abbrev Number: 14 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0x5fe6f): Timer
    <735>   DW_AT_decl_file   : 9
    <736>   DW_AT_decl_line   : 20
    <737>   DW_AT_decl_column : 21
    <738>   DW_AT_type        : <0x765>
    <73c>   DW_AT_data_member_location: 0
 <2><73d>: Abbrev Number: 13 (DW_TAG_member)
    <73e>   DW_AT_name        : Pin
    <742>   DW_AT_decl_file   : 9
    <743>   DW_AT_decl_line   : 21
    <744>   DW_AT_decl_column : 11
    <745>   DW_AT_type        : <0x9f>
    <749>   DW_AT_data_member_location: 4
 <2><74a>: Abbrev Number: 14 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0x8ec0e): PORT
    <74f>   DW_AT_decl_file   : 9
    <750>   DW_AT_decl_line   : 22
    <751>   DW_AT_decl_column : 16
    <752>   DW_AT_type        : <0x76b>
    <756>   DW_AT_data_member_location: 8
 <2><757>: Abbrev Number: 14 (DW_TAG_member)
    <758>   DW_AT_name        : (indirect string, offset: 0x507e8): Temp
    <75c>   DW_AT_decl_file   : 9
    <75d>   DW_AT_decl_line   : 23
    <75e>   DW_AT_decl_column : 8
    <75f>   DW_AT_type        : <0x771>
    <763>   DW_AT_data_member_location: 12
 <2><764>: Abbrev Number: 0
 <1><765>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <766>   DW_AT_byte_size   : 4
    <767>   DW_AT_type        : <0x71a>
 <1><76b>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <76c>   DW_AT_byte_size   : 4
    <76d>   DW_AT_type        : <0x1ad>
 <1><771>: Abbrev Number: 2 (DW_TAG_base_type)
    <772>   DW_AT_byte_size   : 4
    <773>   DW_AT_encoding    : 4	(float)
    <774>   DW_AT_name        : (indirect string, offset: 0x85201): float
 <1><778>: Abbrev Number: 3 (DW_TAG_typedef)
    <779>   DW_AT_name        : (indirect string, offset: 0xb116): DS18B20_Name
    <77d>   DW_AT_decl_file   : 9
    <77e>   DW_AT_decl_line   : 24
    <77f>   DW_AT_decl_column : 3
    <780>   DW_AT_type        : <0x727>
 <1><784>: Abbrev Number: 23 (DW_TAG_subprogram)
    <785>   DW_AT_external    : 1
    <785>   DW_AT_name        : (indirect string, offset: 0x5cd5e): HAL_GPIO_ReadPin
    <789>   DW_AT_decl_file   : 6
    <78a>   DW_AT_decl_line   : 233
    <78b>   DW_AT_decl_column : 15
    <78c>   DW_AT_prototyped  : 1
    <78c>   DW_AT_type        : <0x389>
    <790>   DW_AT_declaration : 1
    <790>   DW_AT_sibling     : <0x79f>
 <2><794>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <795>   DW_AT_type        : <0x76b>
 <2><799>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <79a>   DW_AT_type        : <0x9f>
 <2><79e>: Abbrev Number: 0
 <1><79f>: Abbrev Number: 24 (DW_TAG_subprogram)
    <7a0>   DW_AT_external    : 1
    <7a0>   DW_AT_name        : (indirect string, offset: 0x1794f): HAL_GPIO_WritePin
    <7a4>   DW_AT_decl_file   : 6
    <7a5>   DW_AT_decl_line   : 234
    <7a6>   DW_AT_decl_column : 6
    <7a7>   DW_AT_prototyped  : 1
    <7a7>   DW_AT_declaration : 1
    <7a7>   DW_AT_sibling     : <0x7bb>
 <2><7ab>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7ac>   DW_AT_type        : <0x76b>
 <2><7b0>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7b1>   DW_AT_type        : <0x9f>
 <2><7b5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7b6>   DW_AT_type        : <0x389>
 <2><7ba>: Abbrev Number: 0
 <1><7bb>: Abbrev Number: 24 (DW_TAG_subprogram)
    <7bc>   DW_AT_external    : 1
    <7bc>   DW_AT_name        : (indirect string, offset: 0x5207d): HAL_GPIO_Init
    <7c0>   DW_AT_decl_file   : 6
    <7c1>   DW_AT_decl_line   : 223
    <7c2>   DW_AT_decl_column : 7
    <7c3>   DW_AT_prototyped  : 1
    <7c3>   DW_AT_declaration : 1
    <7c3>   DW_AT_sibling     : <0x7d2>
 <2><7c7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7c8>   DW_AT_type        : <0x76b>
 <2><7cc>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7cd>   DW_AT_type        : <0x7d2>
 <2><7d1>: Abbrev Number: 0
 <1><7d2>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <7d3>   DW_AT_byte_size   : 4
    <7d4>   DW_AT_type        : <0x362>
 <1><7d8>: Abbrev Number: 24 (DW_TAG_subprogram)
    <7d9>   DW_AT_external    : 1
    <7d9>   DW_AT_name        : (indirect string, offset: 0x7fb72): DELAY_TIM_Ms
    <7dd>   DW_AT_decl_file   : 10
    <7de>   DW_AT_decl_line   : 17
    <7df>   DW_AT_decl_column : 6
    <7e0>   DW_AT_prototyped  : 1
    <7e0>   DW_AT_declaration : 1
    <7e0>   DW_AT_sibling     : <0x7ef>
 <2><7e4>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7e5>   DW_AT_type        : <0x765>
 <2><7e9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7ea>   DW_AT_type        : <0x9f>
 <2><7ee>: Abbrev Number: 0
 <1><7ef>: Abbrev Number: 24 (DW_TAG_subprogram)
    <7f0>   DW_AT_external    : 1
    <7f0>   DW_AT_name        : (indirect string, offset: 0x67261): DELAY_TIM_Us
    <7f4>   DW_AT_decl_file   : 10
    <7f5>   DW_AT_decl_line   : 16
    <7f6>   DW_AT_decl_column : 6
    <7f7>   DW_AT_prototyped  : 1
    <7f7>   DW_AT_declaration : 1
    <7f7>   DW_AT_sibling     : <0x806>
 <2><7fb>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7fc>   DW_AT_type        : <0x765>
 <2><800>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <801>   DW_AT_type        : <0x9f>
 <2><805>: Abbrev Number: 0
 <1><806>: Abbrev Number: 24 (DW_TAG_subprogram)
    <807>   DW_AT_external    : 1
    <807>   DW_AT_name        : (indirect string, offset: 0x52647): DELAY_TIM_Init
    <80b>   DW_AT_decl_file   : 10
    <80c>   DW_AT_decl_line   : 15
    <80d>   DW_AT_decl_column : 6
    <80e>   DW_AT_prototyped  : 1
    <80e>   DW_AT_declaration : 1
    <80e>   DW_AT_sibling     : <0x818>
 <2><812>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <813>   DW_AT_type        : <0x765>
 <2><817>: Abbrev Number: 0
 <1><818>: Abbrev Number: 25 (DW_TAG_subprogram)
    <819>   DW_AT_external    : 1
    <819>   DW_AT_name        : (indirect string, offset: 0x507dc): DS18B20_ReadTemp
    <81d>   DW_AT_decl_file   : 1
    <81e>   DW_AT_decl_line   : 106
    <81f>   DW_AT_decl_column : 7
    <820>   DW_AT_prototyped  : 1
    <820>   DW_AT_type        : <0x771>
    <824>   DW_AT_low_pc      : 0x8000e70
    <828>   DW_AT_high_pc     : 0xa4
    <82c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <82e>   DW_AT_GNU_all_tail_call_sites: 1
    <82e>   DW_AT_sibling     : <0x86f>
 <2><832>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <833>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <837>   DW_AT_decl_file   : 1
    <838>   DW_AT_decl_line   : 106
    <839>   DW_AT_decl_column : 38
    <83a>   DW_AT_type        : <0x86f>
    <83e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><841>: Abbrev Number: 27 (DW_TAG_variable)
    <842>   DW_AT_name        : (indirect string, offset: 0x79836): Temp1
    <846>   DW_AT_decl_file   : 1
    <847>   DW_AT_decl_line   : 107
    <848>   DW_AT_decl_column : 10
    <849>   DW_AT_type        : <0x93>
    <84d>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><850>: Abbrev Number: 27 (DW_TAG_variable)
    <851>   DW_AT_name        : (indirect string, offset: 0x85052): Temp2
    <855>   DW_AT_decl_file   : 1
    <856>   DW_AT_decl_line   : 107
    <857>   DW_AT_decl_column : 17
    <858>   DW_AT_type        : <0x93>
    <85c>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><85f>: Abbrev Number: 27 (DW_TAG_variable)
    <860>   DW_AT_name        : (indirect string, offset: 0x507e8): Temp
    <864>   DW_AT_decl_file   : 1
    <865>   DW_AT_decl_line   : 108
    <866>   DW_AT_decl_column : 11
    <867>   DW_AT_type        : <0x9f>
    <86b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><86e>: Abbrev Number: 0
 <1><86f>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <870>   DW_AT_byte_size   : 4
    <871>   DW_AT_type        : <0x778>
 <1><875>: Abbrev Number: 28 (DW_TAG_subprogram)
    <876>   DW_AT_external    : 1
    <876>   DW_AT_name        : (indirect string, offset: 0x7c879): DS18B20_Init
    <87a>   DW_AT_decl_file   : 1
    <87b>   DW_AT_decl_line   : 98
    <87c>   DW_AT_decl_column : 6
    <87d>   DW_AT_prototyped  : 1
    <87d>   DW_AT_low_pc      : 0x8000e42
    <881>   DW_AT_high_pc     : 0x2e
    <885>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <887>   DW_AT_GNU_all_tail_call_sites: 1
    <887>   DW_AT_sibling     : <0x8c8>
 <2><88b>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <88c>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <890>   DW_AT_decl_file   : 1
    <891>   DW_AT_decl_line   : 98
    <892>   DW_AT_decl_column : 33
    <893>   DW_AT_type        : <0x86f>
    <897>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><89a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <89b>   DW_AT_name        : (indirect string, offset: 0x5fe6f): Timer
    <89f>   DW_AT_decl_file   : 1
    <8a0>   DW_AT_decl_line   : 98
    <8a1>   DW_AT_decl_column : 61
    <8a2>   DW_AT_type        : <0x765>
    <8a6>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><8a9>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x66406): DS_PORT
    <8ae>   DW_AT_decl_file   : 1
    <8af>   DW_AT_decl_line   : 99
    <8b0>   DW_AT_decl_column : 17
    <8b1>   DW_AT_type        : <0x76b>
    <8b5>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8b8>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <8b9>   DW_AT_name        : (indirect string, offset: 0x6e73b): DS_Pin
    <8bd>   DW_AT_decl_file   : 1
    <8be>   DW_AT_decl_line   : 99
    <8bf>   DW_AT_decl_column : 35
    <8c0>   DW_AT_type        : <0x9f>
    <8c4>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><8c7>: Abbrev Number: 0
 <1><8c8>: Abbrev Number: 29 (DW_TAG_subprogram)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x2d642): DS18B20_Read
    <8cd>   DW_AT_decl_file   : 1
    <8ce>   DW_AT_decl_line   : 81
    <8cf>   DW_AT_decl_column : 16
    <8d0>   DW_AT_prototyped  : 1
    <8d0>   DW_AT_type        : <0x93>
    <8d4>   DW_AT_low_pc      : 0x8000dd0
    <8d8>   DW_AT_high_pc     : 0x72
    <8dc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8de>   DW_AT_GNU_all_tail_call_sites: 1
    <8de>   DW_AT_sibling     : <0x918>
 <2><8e2>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <8e7>   DW_AT_decl_file   : 1
    <8e8>   DW_AT_decl_line   : 81
    <8e9>   DW_AT_decl_column : 43
    <8ea>   DW_AT_type        : <0x86f>
    <8ee>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8f1>: Abbrev Number: 27 (DW_TAG_variable)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x97679): Value
    <8f6>   DW_AT_decl_file   : 1
    <8f7>   DW_AT_decl_line   : 82
    <8f8>   DW_AT_decl_column : 10
    <8f9>   DW_AT_type        : <0x93>
    <8fd>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><900>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <901>   DW_AT_low_pc      : 0x8000de2
    <905>   DW_AT_high_pc     : 0x56
 <3><909>: Abbrev Number: 31 (DW_TAG_variable)
    <90a>   DW_AT_name        : i
    <90c>   DW_AT_decl_file   : 1
    <90d>   DW_AT_decl_line   : 84
    <90e>   DW_AT_decl_column : 11
    <90f>   DW_AT_type        : <0x85>
    <913>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><916>: Abbrev Number: 0
 <2><917>: Abbrev Number: 0
 <1><918>: Abbrev Number: 32 (DW_TAG_subprogram)
    <919>   DW_AT_name        : (indirect string, offset: 0x76d83): DS18B20_Write
    <91d>   DW_AT_decl_file   : 1
    <91e>   DW_AT_decl_line   : 64
    <91f>   DW_AT_decl_column : 13
    <920>   DW_AT_prototyped  : 1
    <920>   DW_AT_low_pc      : 0x8000d50
    <924>   DW_AT_high_pc     : 0x80
    <928>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <92a>   DW_AT_GNU_all_tail_call_sites: 1
    <92a>   DW_AT_sibling     : <0x964>
 <2><92e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <92f>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <933>   DW_AT_decl_file   : 1
    <934>   DW_AT_decl_line   : 64
    <935>   DW_AT_decl_column : 41
    <936>   DW_AT_type        : <0x86f>
    <93a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><93d>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <93e>   DW_AT_name        : (indirect string, offset: 0x902c9): Data
    <942>   DW_AT_decl_file   : 1
    <943>   DW_AT_decl_line   : 64
    <944>   DW_AT_decl_column : 58
    <945>   DW_AT_type        : <0x93>
    <949>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><94c>: Abbrev Number: 30 (DW_TAG_lexical_block)
    <94d>   DW_AT_low_pc      : 0x8000d62
    <951>   DW_AT_high_pc     : 0x64
 <3><955>: Abbrev Number: 31 (DW_TAG_variable)
    <956>   DW_AT_name        : i
    <958>   DW_AT_decl_file   : 1
    <959>   DW_AT_decl_line   : 66
    <95a>   DW_AT_decl_column : 11
    <95b>   DW_AT_type        : <0x85>
    <95f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><962>: Abbrev Number: 0
 <2><963>: Abbrev Number: 0
 <1><964>: Abbrev Number: 29 (DW_TAG_subprogram)
    <965>   DW_AT_name        : (indirect string, offset: 0x74f03): DS18B20_Start
    <969>   DW_AT_decl_file   : 1
    <96a>   DW_AT_decl_line   : 49
    <96b>   DW_AT_decl_column : 16
    <96c>   DW_AT_prototyped  : 1
    <96c>   DW_AT_type        : <0x93>
    <970>   DW_AT_low_pc      : 0x8000cf4
    <974>   DW_AT_high_pc     : 0x5c
    <978>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <97a>   DW_AT_GNU_all_tail_call_sites: 1
    <97a>   DW_AT_sibling     : <0x99d>
 <2><97e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <97f>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <983>   DW_AT_decl_file   : 1
    <984>   DW_AT_decl_line   : 49
    <985>   DW_AT_decl_column : 44
    <986>   DW_AT_type        : <0x86f>
    <98a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><98d>: Abbrev Number: 27 (DW_TAG_variable)
    <98e>   DW_AT_name        : (indirect string, offset: 0x2e1dd): Response
    <992>   DW_AT_decl_file   : 1
    <993>   DW_AT_decl_line   : 50
    <994>   DW_AT_decl_column : 10
    <995>   DW_AT_type        : <0x93>
    <999>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><99c>: Abbrev Number: 0
 <1><99d>: Abbrev Number: 29 (DW_TAG_subprogram)
    <99e>   DW_AT_name        : (indirect string, offset: 0x59706): DS18B20_ReadPin
    <9a2>   DW_AT_decl_file   : 1
    <9a3>   DW_AT_decl_line   : 45
    <9a4>   DW_AT_decl_column : 16
    <9a5>   DW_AT_prototyped  : 1
    <9a5>   DW_AT_type        : <0x93>
    <9a9>   DW_AT_low_pc      : 0x8000cd2
    <9ad>   DW_AT_high_pc     : 0x22
    <9b1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9b3>   DW_AT_GNU_all_tail_call_sites: 1
    <9b3>   DW_AT_sibling     : <0x9c7>
 <2><9b7>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <9b8>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <9bc>   DW_AT_decl_file   : 1
    <9bd>   DW_AT_decl_line   : 45
    <9be>   DW_AT_decl_column : 46
    <9bf>   DW_AT_type        : <0x86f>
    <9c3>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9c6>: Abbrev Number: 0
 <1><9c7>: Abbrev Number: 32 (DW_TAG_subprogram)
    <9c8>   DW_AT_name        : (indirect string, offset: 0x6cb3f): DS18B20_WritePin
    <9cc>   DW_AT_decl_file   : 1
    <9cd>   DW_AT_decl_line   : 42
    <9ce>   DW_AT_decl_column : 13
    <9cf>   DW_AT_prototyped  : 1
    <9cf>   DW_AT_low_pc      : 0x8000cae
    <9d3>   DW_AT_high_pc     : 0x24
    <9d7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9d9>   DW_AT_GNU_all_tail_call_sites: 1
    <9d9>   DW_AT_sibling     : <0x9fc>
 <2><9dd>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <9de>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <9e2>   DW_AT_decl_file   : 1
    <9e3>   DW_AT_decl_line   : 42
    <9e4>   DW_AT_decl_column : 44
    <9e5>   DW_AT_type        : <0x86f>
    <9e9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9ec>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x97679): Value
    <9f1>   DW_AT_decl_file   : 1
    <9f2>   DW_AT_decl_line   : 42
    <9f3>   DW_AT_decl_column : 61
    <9f4>   DW_AT_type        : <0x93>
    <9f8>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><9fb>: Abbrev Number: 0
 <1><9fc>: Abbrev Number: 32 (DW_TAG_subprogram)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x490cf): DS18B20_SetPinIn
    <a01>   DW_AT_decl_file   : 1
    <a02>   DW_AT_decl_line   : 35
    <a03>   DW_AT_decl_column : 13
    <a04>   DW_AT_prototyped  : 1
    <a04>   DW_AT_low_pc      : 0x8000c72
    <a08>   DW_AT_high_pc     : 0x3c
    <a0c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a0e>   DW_AT_GNU_all_tail_call_sites: 1
    <a0e>   DW_AT_sibling     : <0xa31>
 <2><a12>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a13>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <a17>   DW_AT_decl_file   : 1
    <a18>   DW_AT_decl_line   : 35
    <a19>   DW_AT_decl_column : 44
    <a1a>   DW_AT_type        : <0x86f>
    <a1e>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><a21>: Abbrev Number: 27 (DW_TAG_variable)
    <a22>   DW_AT_name        : (indirect string, offset: 0xd100): GPIO_InitStruct
    <a26>   DW_AT_decl_file   : 1
    <a27>   DW_AT_decl_line   : 36
    <a28>   DW_AT_decl_column : 19
    <a29>   DW_AT_type        : <0x362>
    <a2d>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a30>: Abbrev Number: 0
 <1><a31>: Abbrev Number: 32 (DW_TAG_subprogram)
    <a32>   DW_AT_name        : (indirect string, offset: 0x1d47c): DS18B20_SetPinOut
    <a36>   DW_AT_decl_file   : 1
    <a37>   DW_AT_decl_line   : 28
    <a38>   DW_AT_decl_column : 13
    <a39>   DW_AT_prototyped  : 1
    <a39>   DW_AT_low_pc      : 0x8000c36
    <a3d>   DW_AT_high_pc     : 0x3c
    <a41>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a43>   DW_AT_GNU_all_tail_call_sites: 1
    <a43>   DW_AT_sibling     : <0xa66>
 <2><a47>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a48>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <a4c>   DW_AT_decl_file   : 1
    <a4d>   DW_AT_decl_line   : 28
    <a4e>   DW_AT_decl_column : 45
    <a4f>   DW_AT_type        : <0x86f>
    <a53>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><a56>: Abbrev Number: 27 (DW_TAG_variable)
    <a57>   DW_AT_name        : (indirect string, offset: 0xd100): GPIO_InitStruct
    <a5b>   DW_AT_decl_file   : 1
    <a5c>   DW_AT_decl_line   : 29
    <a5d>   DW_AT_decl_column : 19
    <a5e>   DW_AT_type        : <0x362>
    <a62>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a65>: Abbrev Number: 0
 <1><a66>: Abbrev Number: 32 (DW_TAG_subprogram)
    <a67>   DW_AT_name        : (indirect string, offset: 0x7d542): DS18B20_DelayMs
    <a6b>   DW_AT_decl_file   : 1
    <a6c>   DW_AT_decl_line   : 24
    <a6d>   DW_AT_decl_column : 13
    <a6e>   DW_AT_prototyped  : 1
    <a6e>   DW_AT_low_pc      : 0x8000c14
    <a72>   DW_AT_high_pc     : 0x22
    <a76>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a78>   DW_AT_GNU_all_tail_call_sites: 1
    <a78>   DW_AT_sibling     : <0xa9b>
 <2><a7c>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <a81>   DW_AT_decl_file   : 1
    <a82>   DW_AT_decl_line   : 24
    <a83>   DW_AT_decl_column : 43
    <a84>   DW_AT_type        : <0x86f>
    <a88>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a8b>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x946e8): Time
    <a90>   DW_AT_decl_file   : 1
    <a91>   DW_AT_decl_line   : 24
    <a92>   DW_AT_decl_column : 61
    <a93>   DW_AT_type        : <0x9f>
    <a97>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><a9a>: Abbrev Number: 0
 <1><a9b>: Abbrev Number: 32 (DW_TAG_subprogram)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x31fd5): DS18B20_DelayUs
    <aa0>   DW_AT_decl_file   : 1
    <aa1>   DW_AT_decl_line   : 21
    <aa2>   DW_AT_decl_column : 13
    <aa3>   DW_AT_prototyped  : 1
    <aa3>   DW_AT_low_pc      : 0x8000bf2
    <aa7>   DW_AT_high_pc     : 0x22
    <aab>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aad>   DW_AT_GNU_all_tail_call_sites: 1
    <aad>   DW_AT_sibling     : <0xad0>
 <2><ab1>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <ab6>   DW_AT_decl_file   : 1
    <ab7>   DW_AT_decl_line   : 21
    <ab8>   DW_AT_decl_column : 43
    <ab9>   DW_AT_type        : <0x86f>
    <abd>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ac0>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x946e8): Time
    <ac5>   DW_AT_decl_file   : 1
    <ac6>   DW_AT_decl_line   : 21
    <ac7>   DW_AT_decl_column : 61
    <ac8>   DW_AT_type        : <0x9f>
    <acc>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><acf>: Abbrev Number: 0
 <1><ad0>: Abbrev Number: 33 (DW_TAG_subprogram)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x7436d): DS18B20_DelayInit
    <ad5>   DW_AT_decl_file   : 1
    <ad6>   DW_AT_decl_line   : 18
    <ad7>   DW_AT_decl_column : 13
    <ad8>   DW_AT_prototyped  : 1
    <ad8>   DW_AT_low_pc      : 0x8000bd8
    <adc>   DW_AT_high_pc     : 0x1a
    <ae0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ae2>   DW_AT_GNU_all_tail_call_sites: 1
 <2><ae2>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ae3>   DW_AT_name        : (indirect string, offset: 0x45e9e): DS18B20
    <ae7>   DW_AT_decl_file   : 1
    <ae8>   DW_AT_decl_line   : 18
    <ae9>   DW_AT_decl_column : 45
    <aea>   DW_AT_type        : <0x86f>
    <aee>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><af1>: Abbrev Number: 0
 <1><af2>: Abbrev Number: 0
  Compilation Unit @ offset 0xaf3:
   Length:        0x6fd (32-bit)
   Version:       4
   Abbrev Offset: 0x216
   Pointer Size:  4
 <0><afe>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <aff>   DW_AT_producer    : (indirect string, offset: 0x43a7a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <b03>   DW_AT_language    : 12	(ANSI C99)
    <b04>   DW_AT_name        : (indirect string, offset: 0x85165): ../Core/Src/delay_timer.c
    <b08>   DW_AT_comp_dir    : (indirect string, offset: 0x592c0): D:/STM32/STM32_CUBEIDE/_RTOS/_PROJECT/_RTOS_OLEDDMA_DS18B20/Debug
    <b0c>   DW_AT_ranges      : 0x68
    <b10>   DW_AT_low_pc      : 0x0
    <b14>   DW_AT_stmt_list   : 0x84c
    <b18>   DW_AT_GNU_macros  : 0x15c0a
 <1><b1c>: Abbrev Number: 2 (DW_TAG_base_type)
    <b1d>   DW_AT_byte_size   : 1
    <b1e>   DW_AT_encoding    : 6	(signed char)
    <b1f>   DW_AT_name        : (indirect string, offset: 0x42d48): signed char
 <1><b23>: Abbrev Number: 2 (DW_TAG_base_type)
    <b24>   DW_AT_byte_size   : 1
    <b25>   DW_AT_encoding    : 8	(unsigned char)
    <b26>   DW_AT_name        : (indirect string, offset: 0x1aef6): unsigned char
 <1><b2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <b2b>   DW_AT_byte_size   : 2
    <b2c>   DW_AT_encoding    : 5	(signed)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x63ac8): short int
 <1><b31>: Abbrev Number: 3 (DW_TAG_typedef)
    <b32>   DW_AT_name        : (indirect string, offset: 0x6d5bb): __uint16_t
    <b36>   DW_AT_decl_file   : 2
    <b37>   DW_AT_decl_line   : 57
    <b38>   DW_AT_decl_column : 25
    <b39>   DW_AT_type        : <0xb3d>
 <1><b3d>: Abbrev Number: 2 (DW_TAG_base_type)
    <b3e>   DW_AT_byte_size   : 2
    <b3f>   DW_AT_encoding    : 7	(unsigned)
    <b40>   DW_AT_name        : (indirect string, offset: 0x2b907): short unsigned int
 <1><b44>: Abbrev Number: 2 (DW_TAG_base_type)
    <b45>   DW_AT_byte_size   : 4
    <b46>   DW_AT_encoding    : 5	(signed)
    <b47>   DW_AT_name        : (indirect string, offset: 0xb8d5): long int
 <1><b4b>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4c>   DW_AT_name        : (indirect string, offset: 0x550d3): __uint32_t
    <b50>   DW_AT_decl_file   : 2
    <b51>   DW_AT_decl_line   : 79
    <b52>   DW_AT_decl_column : 25
    <b53>   DW_AT_type        : <0xb57>
 <1><b57>: Abbrev Number: 2 (DW_TAG_base_type)
    <b58>   DW_AT_byte_size   : 4
    <b59>   DW_AT_encoding    : 7	(unsigned)
    <b5a>   DW_AT_name        : (indirect string, offset: 0x1f3d5): long unsigned int
 <1><b5e>: Abbrev Number: 2 (DW_TAG_base_type)
    <b5f>   DW_AT_byte_size   : 8
    <b60>   DW_AT_encoding    : 5	(signed)
    <b61>   DW_AT_name        : (indirect string, offset: 0x3d1fb): long long int
 <1><b65>: Abbrev Number: 2 (DW_TAG_base_type)
    <b66>   DW_AT_byte_size   : 8
    <b67>   DW_AT_encoding    : 7	(unsigned)
    <b68>   DW_AT_name        : (indirect string, offset: 0x1b76c): long long unsigned int
 <1><b6c>: Abbrev Number: 4 (DW_TAG_base_type)
    <b6d>   DW_AT_byte_size   : 4
    <b6e>   DW_AT_encoding    : 5	(signed)
    <b6f>   DW_AT_name        : int
 <1><b73>: Abbrev Number: 2 (DW_TAG_base_type)
    <b74>   DW_AT_byte_size   : 4
    <b75>   DW_AT_encoding    : 7	(unsigned)
    <b76>   DW_AT_name        : (indirect string, offset: 0xb298): unsigned int
 <1><b7a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x88dfb): uint16_t
    <b7f>   DW_AT_decl_file   : 3
    <b80>   DW_AT_decl_line   : 36
    <b81>   DW_AT_decl_column : 20
    <b82>   DW_AT_type        : <0xb31>
 <1><b86>: Abbrev Number: 3 (DW_TAG_typedef)
    <b87>   DW_AT_name        : (indirect string, offset: 0x88ddb): uint32_t
    <b8b>   DW_AT_decl_file   : 3
    <b8c>   DW_AT_decl_line   : 48
    <b8d>   DW_AT_decl_column : 20
    <b8e>   DW_AT_type        : <0xb4b>
 <1><b92>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b93>   DW_AT_type        : <0xb86>
 <1><b97>: Abbrev Number: 6 (DW_TAG_structure_type)
    <b98>   DW_AT_byte_size   : 16
    <b99>   DW_AT_decl_file   : 4
    <b9a>   DW_AT_decl_line   : 290
    <b9c>   DW_AT_decl_column : 9
    <b9d>   DW_AT_sibling     : <0xbda>
 <2><ba1>: Abbrev Number: 7 (DW_TAG_member)
    <ba2>   DW_AT_name        : CCR
    <ba6>   DW_AT_decl_file   : 4
    <ba7>   DW_AT_decl_line   : 292
    <ba9>   DW_AT_decl_column : 17
    <baa>   DW_AT_type        : <0xb92>
    <bae>   DW_AT_data_member_location: 0
 <2><baf>: Abbrev Number: 8 (DW_TAG_member)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x3365d): CNDTR
    <bb4>   DW_AT_decl_file   : 4
    <bb5>   DW_AT_decl_line   : 293
    <bb7>   DW_AT_decl_column : 17
    <bb8>   DW_AT_type        : <0xb92>
    <bbc>   DW_AT_data_member_location: 4
 <2><bbd>: Abbrev Number: 8 (DW_TAG_member)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x7fea3): CPAR
    <bc2>   DW_AT_decl_file   : 4
    <bc3>   DW_AT_decl_line   : 294
    <bc5>   DW_AT_decl_column : 17
    <bc6>   DW_AT_type        : <0xb92>
    <bca>   DW_AT_data_member_location: 8
 <2><bcb>: Abbrev Number: 8 (DW_TAG_member)
    <bcc>   DW_AT_name        : (indirect string, offset: 0x49a07): CMAR
    <bd0>   DW_AT_decl_file   : 4
    <bd1>   DW_AT_decl_line   : 295
    <bd3>   DW_AT_decl_column : 17
    <bd4>   DW_AT_type        : <0xb92>
    <bd8>   DW_AT_data_member_location: 12
 <2><bd9>: Abbrev Number: 0
 <1><bda>: Abbrev Number: 9 (DW_TAG_typedef)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x6cdc1): DMA_Channel_TypeDef
    <bdf>   DW_AT_decl_file   : 4
    <be0>   DW_AT_decl_line   : 296
    <be2>   DW_AT_decl_column : 3
    <be3>   DW_AT_type        : <0xb97>
 <1><be7>: Abbrev Number: 6 (DW_TAG_structure_type)
    <be8>   DW_AT_byte_size   : 8
    <be9>   DW_AT_decl_file   : 4
    <bea>   DW_AT_decl_line   : 298
    <bec>   DW_AT_decl_column : 9
    <bed>   DW_AT_sibling     : <0xc0e>
 <2><bf1>: Abbrev Number: 7 (DW_TAG_member)
    <bf2>   DW_AT_name        : ISR
    <bf6>   DW_AT_decl_file   : 4
    <bf7>   DW_AT_decl_line   : 300
    <bf9>   DW_AT_decl_column : 17
    <bfa>   DW_AT_type        : <0xb92>
    <bfe>   DW_AT_data_member_location: 0
 <2><bff>: Abbrev Number: 8 (DW_TAG_member)
    <c00>   DW_AT_name        : (indirect string, offset: 0x5dc60): IFCR
    <c04>   DW_AT_decl_file   : 4
    <c05>   DW_AT_decl_line   : 301
    <c07>   DW_AT_decl_column : 17
    <c08>   DW_AT_type        : <0xb92>
    <c0c>   DW_AT_data_member_location: 4
 <2><c0d>: Abbrev Number: 0
 <1><c0e>: Abbrev Number: 9 (DW_TAG_typedef)
    <c0f>   DW_AT_name        : (indirect string, offset: 0x305d0): DMA_TypeDef
    <c13>   DW_AT_decl_file   : 4
    <c14>   DW_AT_decl_line   : 302
    <c16>   DW_AT_decl_column : 3
    <c17>   DW_AT_type        : <0xbe7>
 <1><c1b>: Abbrev Number: 6 (DW_TAG_structure_type)
    <c1c>   DW_AT_byte_size   : 84
    <c1d>   DW_AT_decl_file   : 4
    <c1e>   DW_AT_decl_line   : 476
    <c20>   DW_AT_decl_column : 9
    <c21>   DW_AT_sibling     : <0xd4a>
 <2><c25>: Abbrev Number: 7 (DW_TAG_member)
    <c26>   DW_AT_name        : CR1
    <c2a>   DW_AT_decl_file   : 4
    <c2b>   DW_AT_decl_line   : 478
    <c2d>   DW_AT_decl_column : 17
    <c2e>   DW_AT_type        : <0xb92>
    <c32>   DW_AT_data_member_location: 0
 <2><c33>: Abbrev Number: 7 (DW_TAG_member)
    <c34>   DW_AT_name        : CR2
    <c38>   DW_AT_decl_file   : 4
    <c39>   DW_AT_decl_line   : 479
    <c3b>   DW_AT_decl_column : 17
    <c3c>   DW_AT_type        : <0xb92>
    <c40>   DW_AT_data_member_location: 4
 <2><c41>: Abbrev Number: 8 (DW_TAG_member)
    <c42>   DW_AT_name        : (indirect string, offset: 0x602f2): SMCR
    <c46>   DW_AT_decl_file   : 4
    <c47>   DW_AT_decl_line   : 480
    <c49>   DW_AT_decl_column : 17
    <c4a>   DW_AT_type        : <0xb92>
    <c4e>   DW_AT_data_member_location: 8
 <2><c4f>: Abbrev Number: 8 (DW_TAG_member)
    <c50>   DW_AT_name        : (indirect string, offset: 0x2a82d): DIER
    <c54>   DW_AT_decl_file   : 4
    <c55>   DW_AT_decl_line   : 481
    <c57>   DW_AT_decl_column : 17
    <c58>   DW_AT_type        : <0xb92>
    <c5c>   DW_AT_data_member_location: 12
 <2><c5d>: Abbrev Number: 7 (DW_TAG_member)
    <c5e>   DW_AT_name        : SR
    <c61>   DW_AT_decl_file   : 4
    <c62>   DW_AT_decl_line   : 482
    <c64>   DW_AT_decl_column : 17
    <c65>   DW_AT_type        : <0xb92>
    <c69>   DW_AT_data_member_location: 16
 <2><c6a>: Abbrev Number: 7 (DW_TAG_member)
    <c6b>   DW_AT_name        : EGR
    <c6f>   DW_AT_decl_file   : 4
    <c70>   DW_AT_decl_line   : 483
    <c72>   DW_AT_decl_column : 17
    <c73>   DW_AT_type        : <0xb92>
    <c77>   DW_AT_data_member_location: 20
 <2><c78>: Abbrev Number: 8 (DW_TAG_member)
    <c79>   DW_AT_name        : (indirect string, offset: 0x61e20): CCMR1
    <c7d>   DW_AT_decl_file   : 4
    <c7e>   DW_AT_decl_line   : 484
    <c80>   DW_AT_decl_column : 17
    <c81>   DW_AT_type        : <0xb92>
    <c85>   DW_AT_data_member_location: 24
 <2><c86>: Abbrev Number: 8 (DW_TAG_member)
    <c87>   DW_AT_name        : (indirect string, offset: 0x3525f): CCMR2
    <c8b>   DW_AT_decl_file   : 4
    <c8c>   DW_AT_decl_line   : 485
    <c8e>   DW_AT_decl_column : 17
    <c8f>   DW_AT_type        : <0xb92>
    <c93>   DW_AT_data_member_location: 28
 <2><c94>: Abbrev Number: 8 (DW_TAG_member)
    <c95>   DW_AT_name        : (indirect string, offset: 0x17739): CCER
    <c99>   DW_AT_decl_file   : 4
    <c9a>   DW_AT_decl_line   : 486
    <c9c>   DW_AT_decl_column : 17
    <c9d>   DW_AT_type        : <0xb92>
    <ca1>   DW_AT_data_member_location: 32
 <2><ca2>: Abbrev Number: 7 (DW_TAG_member)
    <ca3>   DW_AT_name        : CNT
    <ca7>   DW_AT_decl_file   : 4
    <ca8>   DW_AT_decl_line   : 487
    <caa>   DW_AT_decl_column : 17
    <cab>   DW_AT_type        : <0xb92>
    <caf>   DW_AT_data_member_location: 36
 <2><cb0>: Abbrev Number: 7 (DW_TAG_member)
    <cb1>   DW_AT_name        : PSC
    <cb5>   DW_AT_decl_file   : 4
    <cb6>   DW_AT_decl_line   : 488
    <cb8>   DW_AT_decl_column : 17
    <cb9>   DW_AT_type        : <0xb92>
    <cbd>   DW_AT_data_member_location: 40
 <2><cbe>: Abbrev Number: 7 (DW_TAG_member)
    <cbf>   DW_AT_name        : ARR
    <cc3>   DW_AT_decl_file   : 4
    <cc4>   DW_AT_decl_line   : 489
    <cc6>   DW_AT_decl_column : 17
    <cc7>   DW_AT_type        : <0xb92>
    <ccb>   DW_AT_data_member_location: 44
 <2><ccc>: Abbrev Number: 7 (DW_TAG_member)
    <ccd>   DW_AT_name        : RCR
    <cd1>   DW_AT_decl_file   : 4
    <cd2>   DW_AT_decl_line   : 490
    <cd4>   DW_AT_decl_column : 17
    <cd5>   DW_AT_type        : <0xb92>
    <cd9>   DW_AT_data_member_location: 48
 <2><cda>: Abbrev Number: 8 (DW_TAG_member)
    <cdb>   DW_AT_name        : (indirect string, offset: 0xfde4): CCR1
    <cdf>   DW_AT_decl_file   : 4
    <ce0>   DW_AT_decl_line   : 491
    <ce2>   DW_AT_decl_column : 17
    <ce3>   DW_AT_type        : <0xb92>
    <ce7>   DW_AT_data_member_location: 52
 <2><ce8>: Abbrev Number: 8 (DW_TAG_member)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x38395): CCR2
    <ced>   DW_AT_decl_file   : 4
    <cee>   DW_AT_decl_line   : 492
    <cf0>   DW_AT_decl_column : 17
    <cf1>   DW_AT_type        : <0xb92>
    <cf5>   DW_AT_data_member_location: 56
 <2><cf6>: Abbrev Number: 8 (DW_TAG_member)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x6678e): CCR3
    <cfb>   DW_AT_decl_file   : 4
    <cfc>   DW_AT_decl_line   : 493
    <cfe>   DW_AT_decl_column : 17
    <cff>   DW_AT_type        : <0xb92>
    <d03>   DW_AT_data_member_location: 60
 <2><d04>: Abbrev Number: 8 (DW_TAG_member)
    <d05>   DW_AT_name        : (indirect string, offset: 0x872c): CCR4
    <d09>   DW_AT_decl_file   : 4
    <d0a>   DW_AT_decl_line   : 494
    <d0c>   DW_AT_decl_column : 17
    <d0d>   DW_AT_type        : <0xb92>
    <d11>   DW_AT_data_member_location: 64
 <2><d12>: Abbrev Number: 8 (DW_TAG_member)
    <d13>   DW_AT_name        : (indirect string, offset: 0x3dabe): BDTR
    <d17>   DW_AT_decl_file   : 4
    <d18>   DW_AT_decl_line   : 495
    <d1a>   DW_AT_decl_column : 17
    <d1b>   DW_AT_type        : <0xb92>
    <d1f>   DW_AT_data_member_location: 68
 <2><d20>: Abbrev Number: 7 (DW_TAG_member)
    <d21>   DW_AT_name        : DCR
    <d25>   DW_AT_decl_file   : 4
    <d26>   DW_AT_decl_line   : 496
    <d28>   DW_AT_decl_column : 17
    <d29>   DW_AT_type        : <0xb92>
    <d2d>   DW_AT_data_member_location: 72
 <2><d2e>: Abbrev Number: 8 (DW_TAG_member)
    <d2f>   DW_AT_name        : (indirect string, offset: 0x72c08): DMAR
    <d33>   DW_AT_decl_file   : 4
    <d34>   DW_AT_decl_line   : 497
    <d36>   DW_AT_decl_column : 17
    <d37>   DW_AT_type        : <0xb92>
    <d3b>   DW_AT_data_member_location: 76
 <2><d3c>: Abbrev Number: 7 (DW_TAG_member)
    <d3d>   DW_AT_name        : OR
    <d40>   DW_AT_decl_file   : 4
    <d41>   DW_AT_decl_line   : 498
    <d43>   DW_AT_decl_column : 17
    <d44>   DW_AT_type        : <0xb92>
    <d48>   DW_AT_data_member_location: 80
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 9 (DW_TAG_typedef)
    <d4b>   DW_AT_name        : (indirect string, offset: 0x1c503): TIM_TypeDef
    <d4f>   DW_AT_decl_file   : 4
    <d50>   DW_AT_decl_line   : 499
    <d52>   DW_AT_decl_column : 2
    <d53>   DW_AT_type        : <0xc1b>
 <1><d57>: Abbrev Number: 2 (DW_TAG_base_type)
    <d58>   DW_AT_byte_size   : 8
    <d59>   DW_AT_encoding    : 4	(float)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x859b4): long double
 <1><d5e>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <d5f>   DW_AT_encoding    : 7	(unsigned)
    <d60>   DW_AT_byte_size   : 1
    <d61>   DW_AT_type        : <0xb23>
    <d65>   DW_AT_decl_file   : 5
    <d66>   DW_AT_decl_line   : 39
    <d67>   DW_AT_decl_column : 1
    <d68>   DW_AT_sibling     : <0xd85>
 <2><d6c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x8514b): HAL_OK
    <d71>   DW_AT_const_value : 0
 <2><d72>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d73>   DW_AT_name        : (indirect string, offset: 0x8517f): HAL_ERROR
    <d77>   DW_AT_const_value : 1
 <2><d78>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d79>   DW_AT_name        : (indirect string, offset: 0x85136): HAL_BUSY
    <d7d>   DW_AT_const_value : 2
 <2><d7e>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x8513f): HAL_TIMEOUT
    <d83>   DW_AT_const_value : 3
 <2><d84>: Abbrev Number: 0
 <1><d85>: Abbrev Number: 3 (DW_TAG_typedef)
    <d86>   DW_AT_name        : (indirect string, offset: 0x85124): HAL_StatusTypeDef
    <d8a>   DW_AT_decl_file   : 5
    <d8b>   DW_AT_decl_line   : 44
    <d8c>   DW_AT_decl_column : 3
    <d8d>   DW_AT_type        : <0xd5e>
 <1><d91>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <d92>   DW_AT_encoding    : 7	(unsigned)
    <d93>   DW_AT_byte_size   : 1
    <d94>   DW_AT_type        : <0xb23>
    <d98>   DW_AT_decl_file   : 5
    <d99>   DW_AT_decl_line   : 50
    <d9a>   DW_AT_decl_column : 1
    <d9b>   DW_AT_sibling     : <0xdac>
 <2><d9f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x62dd6): HAL_UNLOCKED
    <da4>   DW_AT_const_value : 0
 <2><da5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0x8464d): HAL_LOCKED
    <daa>   DW_AT_const_value : 1
 <2><dab>: Abbrev Number: 0
 <1><dac>: Abbrev Number: 3 (DW_TAG_typedef)
    <dad>   DW_AT_name        : (indirect string, offset: 0x4e88c): HAL_LockTypeDef
    <db1>   DW_AT_decl_file   : 5
    <db2>   DW_AT_decl_line   : 53
    <db3>   DW_AT_decl_column : 3
    <db4>   DW_AT_type        : <0xd91>
 <1><db8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <db9>   DW_AT_byte_size   : 28
    <dba>   DW_AT_decl_file   : 6
    <dbb>   DW_AT_decl_line   : 47
    <dbc>   DW_AT_decl_column : 9
    <dbd>   DW_AT_sibling     : <0xe1d>
 <2><dc1>: Abbrev Number: 13 (DW_TAG_member)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x931be): Direction
    <dc6>   DW_AT_decl_file   : 6
    <dc7>   DW_AT_decl_line   : 49
    <dc8>   DW_AT_decl_column : 12
    <dc9>   DW_AT_type        : <0xb86>
    <dcd>   DW_AT_data_member_location: 0
 <2><dce>: Abbrev Number: 13 (DW_TAG_member)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x9004): PeriphInc
    <dd3>   DW_AT_decl_file   : 6
    <dd4>   DW_AT_decl_line   : 53
    <dd5>   DW_AT_decl_column : 12
    <dd6>   DW_AT_type        : <0xb86>
    <dda>   DW_AT_data_member_location: 4
 <2><ddb>: Abbrev Number: 13 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x14def): MemInc
    <de0>   DW_AT_decl_file   : 6
    <de1>   DW_AT_decl_line   : 56
    <de2>   DW_AT_decl_column : 12
    <de3>   DW_AT_type        : <0xb86>
    <de7>   DW_AT_data_member_location: 8
 <2><de8>: Abbrev Number: 13 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0x4262f): PeriphDataAlignment
    <ded>   DW_AT_decl_file   : 6
    <dee>   DW_AT_decl_line   : 59
    <def>   DW_AT_decl_column : 12
    <df0>   DW_AT_type        : <0xb86>
    <df4>   DW_AT_data_member_location: 12
 <2><df5>: Abbrev Number: 13 (DW_TAG_member)
    <df6>   DW_AT_name        : (indirect string, offset: 0x783c2): MemDataAlignment
    <dfa>   DW_AT_decl_file   : 6
    <dfb>   DW_AT_decl_line   : 62
    <dfc>   DW_AT_decl_column : 12
    <dfd>   DW_AT_type        : <0xb86>
    <e01>   DW_AT_data_member_location: 16
 <2><e02>: Abbrev Number: 13 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0x93d10): Mode
    <e07>   DW_AT_decl_file   : 6
    <e08>   DW_AT_decl_line   : 65
    <e09>   DW_AT_decl_column : 12
    <e0a>   DW_AT_type        : <0xb86>
    <e0e>   DW_AT_data_member_location: 20
 <2><e0f>: Abbrev Number: 13 (DW_TAG_member)
    <e10>   DW_AT_name        : (indirect string, offset: 0x92413): Priority
    <e14>   DW_AT_decl_file   : 6
    <e15>   DW_AT_decl_line   : 70
    <e16>   DW_AT_decl_column : 12
    <e17>   DW_AT_type        : <0xb86>
    <e1b>   DW_AT_data_member_location: 24
 <2><e1c>: Abbrev Number: 0
 <1><e1d>: Abbrev Number: 3 (DW_TAG_typedef)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x23975): DMA_InitTypeDef
    <e22>   DW_AT_decl_file   : 6
    <e23>   DW_AT_decl_line   : 72
    <e24>   DW_AT_decl_column : 3
    <e25>   DW_AT_type        : <0xdb8>
 <1><e29>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <e2a>   DW_AT_encoding    : 7	(unsigned)
    <e2b>   DW_AT_byte_size   : 1
    <e2c>   DW_AT_type        : <0xb23>
    <e30>   DW_AT_decl_file   : 6
    <e31>   DW_AT_decl_line   : 78
    <e32>   DW_AT_decl_column : 1
    <e33>   DW_AT_sibling     : <0xe50>
 <2><e37>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e38>   DW_AT_name        : (indirect string, offset: 0x63d5a): HAL_DMA_STATE_RESET
    <e3c>   DW_AT_const_value : 0
 <2><e3d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e3e>   DW_AT_name        : (indirect string, offset: 0x2467a): HAL_DMA_STATE_READY
    <e42>   DW_AT_const_value : 1
 <2><e43>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e44>   DW_AT_name        : (indirect string, offset: 0x5cdd5): HAL_DMA_STATE_BUSY
    <e48>   DW_AT_const_value : 2
 <2><e49>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x8240e): HAL_DMA_STATE_TIMEOUT
    <e4e>   DW_AT_const_value : 3
 <2><e4f>: Abbrev Number: 0
 <1><e50>: Abbrev Number: 3 (DW_TAG_typedef)
    <e51>   DW_AT_name        : (indirect string, offset: 0x5935f): HAL_DMA_StateTypeDef
    <e55>   DW_AT_decl_file   : 6
    <e56>   DW_AT_decl_line   : 83
    <e57>   DW_AT_decl_column : 2
    <e58>   DW_AT_type        : <0xe29>
 <1><e5c>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <e5d>   DW_AT_type        : <0xe50>
 <1><e61>: Abbrev Number: 14 (DW_TAG_structure_type)
    <e62>   DW_AT_name        : (indirect string, offset: 0x71c2c): __DMA_HandleTypeDef
    <e66>   DW_AT_byte_size   : 68
    <e67>   DW_AT_decl_file   : 6
    <e68>   DW_AT_decl_line   : 110
    <e69>   DW_AT_decl_column : 16
    <e6a>   DW_AT_sibling     : <0xf0b>
 <2><e6e>: Abbrev Number: 13 (DW_TAG_member)
    <e6f>   DW_AT_name        : (indirect string, offset: 0x33cdc): Instance
    <e73>   DW_AT_decl_file   : 6
    <e74>   DW_AT_decl_line   : 112
    <e75>   DW_AT_decl_column : 31
    <e76>   DW_AT_type        : <0xf0b>
    <e7a>   DW_AT_data_member_location: 0
 <2><e7b>: Abbrev Number: 13 (DW_TAG_member)
    <e7c>   DW_AT_name        : (indirect string, offset: 0x7c881): Init
    <e80>   DW_AT_decl_file   : 6
    <e81>   DW_AT_decl_line   : 114
    <e82>   DW_AT_decl_column : 30
    <e83>   DW_AT_type        : <0xe1d>
    <e87>   DW_AT_data_member_location: 4
 <2><e88>: Abbrev Number: 13 (DW_TAG_member)
    <e89>   DW_AT_name        : (indirect string, offset: 0x5f6ef): Lock
    <e8d>   DW_AT_decl_file   : 6
    <e8e>   DW_AT_decl_line   : 116
    <e8f>   DW_AT_decl_column : 30
    <e90>   DW_AT_type        : <0xdac>
    <e94>   DW_AT_data_member_location: 32
 <2><e95>: Abbrev Number: 13 (DW_TAG_member)
    <e96>   DW_AT_name        : (indirect string, offset: 0x8e434): State
    <e9a>   DW_AT_decl_file   : 6
    <e9b>   DW_AT_decl_line   : 118
    <e9c>   DW_AT_decl_column : 30
    <e9d>   DW_AT_type        : <0xe5c>
    <ea1>   DW_AT_data_member_location: 33
 <2><ea2>: Abbrev Number: 13 (DW_TAG_member)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x7e156): Parent
    <ea7>   DW_AT_decl_file   : 6
    <ea8>   DW_AT_decl_line   : 120
    <ea9>   DW_AT_decl_column : 31
    <eaa>   DW_AT_type        : <0xf11>
    <eae>   DW_AT_data_member_location: 36
 <2><eaf>: Abbrev Number: 13 (DW_TAG_member)
    <eb0>   DW_AT_name        : (indirect string, offset: 0x83c9a): XferCpltCallback
    <eb4>   DW_AT_decl_file   : 6
    <eb5>   DW_AT_decl_line   : 122
    <eb6>   DW_AT_decl_column : 33
    <eb7>   DW_AT_type        : <0xf24>
    <ebb>   DW_AT_data_member_location: 40
 <2><ebc>: Abbrev Number: 13 (DW_TAG_member)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x67ffb): XferHalfCpltCallback
    <ec1>   DW_AT_decl_file   : 6
    <ec2>   DW_AT_decl_line   : 124
    <ec3>   DW_AT_decl_column : 33
    <ec4>   DW_AT_type        : <0xf24>
    <ec8>   DW_AT_data_member_location: 44
 <2><ec9>: Abbrev Number: 13 (DW_TAG_member)
    <eca>   DW_AT_name        : (indirect string, offset: 0x1313f): XferErrorCallback
    <ece>   DW_AT_decl_file   : 6
    <ecf>   DW_AT_decl_line   : 126
    <ed0>   DW_AT_decl_column : 33
    <ed1>   DW_AT_type        : <0xf24>
    <ed5>   DW_AT_data_member_location: 48
 <2><ed6>: Abbrev Number: 13 (DW_TAG_member)
    <ed7>   DW_AT_name        : (indirect string, offset: 0x7bd66): XferAbortCallback
    <edb>   DW_AT_decl_file   : 6
    <edc>   DW_AT_decl_line   : 128
    <edd>   DW_AT_decl_column : 33
    <ede>   DW_AT_type        : <0xf24>
    <ee2>   DW_AT_data_member_location: 52
 <2><ee3>: Abbrev Number: 13 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x8179c): ErrorCode
    <ee8>   DW_AT_decl_file   : 6
    <ee9>   DW_AT_decl_line   : 130
    <eea>   DW_AT_decl_column : 30
    <eeb>   DW_AT_type        : <0xb92>
    <eef>   DW_AT_data_member_location: 56
 <2><ef0>: Abbrev Number: 13 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x39166): DmaBaseAddress
    <ef5>   DW_AT_decl_file   : 6
    <ef6>   DW_AT_decl_line   : 132
    <ef7>   DW_AT_decl_column : 31
    <ef8>   DW_AT_type        : <0xf2a>
    <efc>   DW_AT_data_member_location: 60
 <2><efd>: Abbrev Number: 13 (DW_TAG_member)
    <efe>   DW_AT_name        : (indirect string, offset: 0x1b551): ChannelIndex
    <f02>   DW_AT_decl_file   : 6
    <f03>   DW_AT_decl_line   : 134
    <f04>   DW_AT_decl_column : 30
    <f05>   DW_AT_type        : <0xb86>
    <f09>   DW_AT_data_member_location: 64
 <2><f0a>: Abbrev Number: 0
 <1><f0b>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f0c>   DW_AT_byte_size   : 4
    <f0d>   DW_AT_type        : <0xbda>
 <1><f11>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f12>   DW_AT_byte_size   : 4
 <1><f13>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <f14>   DW_AT_prototyped  : 1
    <f14>   DW_AT_sibling     : <0xf1e>
 <2><f18>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <f19>   DW_AT_type        : <0xf1e>
 <2><f1d>: Abbrev Number: 0
 <1><f1e>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f1f>   DW_AT_byte_size   : 4
    <f20>   DW_AT_type        : <0xe61>
 <1><f24>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f25>   DW_AT_byte_size   : 4
    <f26>   DW_AT_type        : <0xf13>
 <1><f2a>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f2b>   DW_AT_byte_size   : 4
    <f2c>   DW_AT_type        : <0xc0e>
 <1><f30>: Abbrev Number: 3 (DW_TAG_typedef)
    <f31>   DW_AT_name        : (indirect string, offset: 0x71c2e): DMA_HandleTypeDef
    <f35>   DW_AT_decl_file   : 6
    <f36>   DW_AT_decl_line   : 136
    <f37>   DW_AT_decl_column : 3
    <f38>   DW_AT_type        : <0xe61>
 <1><f3c>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f3d>   DW_AT_byte_size   : 4
    <f3e>   DW_AT_type        : <0xf30>
 <1><f42>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f43>   DW_AT_byte_size   : 24
    <f44>   DW_AT_decl_file   : 7
    <f45>   DW_AT_decl_line   : 46
    <f46>   DW_AT_decl_column : 9
    <f47>   DW_AT_sibling     : <0xf9a>
 <2><f4b>: Abbrev Number: 13 (DW_TAG_member)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x9085d): Prescaler
    <f50>   DW_AT_decl_file   : 7
    <f51>   DW_AT_decl_line   : 48
    <f52>   DW_AT_decl_column : 12
    <f53>   DW_AT_type        : <0xb86>
    <f57>   DW_AT_data_member_location: 0
 <2><f58>: Abbrev Number: 13 (DW_TAG_member)
    <f59>   DW_AT_name        : (indirect string, offset: 0x78b9e): CounterMode
    <f5d>   DW_AT_decl_file   : 7
    <f5e>   DW_AT_decl_line   : 51
    <f5f>   DW_AT_decl_column : 12
    <f60>   DW_AT_type        : <0xb86>
    <f64>   DW_AT_data_member_location: 4
 <2><f65>: Abbrev Number: 13 (DW_TAG_member)
    <f66>   DW_AT_name        : (indirect string, offset: 0x686a9): Period
    <f6a>   DW_AT_decl_file   : 7
    <f6b>   DW_AT_decl_line   : 54
    <f6c>   DW_AT_decl_column : 12
    <f6d>   DW_AT_type        : <0xb86>
    <f71>   DW_AT_data_member_location: 8
 <2><f72>: Abbrev Number: 13 (DW_TAG_member)
    <f73>   DW_AT_name        : (indirect string, offset: 0x36405): ClockDivision
    <f77>   DW_AT_decl_file   : 7
    <f78>   DW_AT_decl_line   : 58
    <f79>   DW_AT_decl_column : 12
    <f7a>   DW_AT_type        : <0xb86>
    <f7e>   DW_AT_data_member_location: 12
 <2><f7f>: Abbrev Number: 13 (DW_TAG_member)
    <f80>   DW_AT_name        : (indirect string, offset: 0x5dd38): RepetitionCounter
    <f84>   DW_AT_decl_file   : 7
    <f85>   DW_AT_decl_line   : 61
    <f86>   DW_AT_decl_column : 12
    <f87>   DW_AT_type        : <0xb86>
    <f8b>   DW_AT_data_member_location: 16
 <2><f8c>: Abbrev Number: 13 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0xd712): AutoReloadPreload
    <f91>   DW_AT_decl_file   : 7
    <f92>   DW_AT_decl_line   : 72
    <f93>   DW_AT_decl_column : 12
    <f94>   DW_AT_type        : <0xb86>
    <f98>   DW_AT_data_member_location: 20
 <2><f99>: Abbrev Number: 0
 <1><f9a>: Abbrev Number: 3 (DW_TAG_typedef)
    <f9b>   DW_AT_name        : (indirect string, offset: 0x7741a): TIM_Base_InitTypeDef
    <f9f>   DW_AT_decl_file   : 7
    <fa0>   DW_AT_decl_line   : 74
    <fa1>   DW_AT_decl_column : 3
    <fa2>   DW_AT_type        : <0xf42>
 <1><fa6>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <fa7>   DW_AT_encoding    : 7	(unsigned)
    <fa8>   DW_AT_byte_size   : 1
    <fa9>   DW_AT_type        : <0xb23>
    <fad>   DW_AT_decl_file   : 7
    <fae>   DW_AT_decl_line   : 291
    <fb0>   DW_AT_decl_column : 1
    <fb1>   DW_AT_sibling     : <0xfd4>
 <2><fb5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x43336): HAL_TIM_STATE_RESET
    <fba>   DW_AT_const_value : 0
 <2><fbb>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x4e46): HAL_TIM_STATE_READY
    <fc0>   DW_AT_const_value : 1
 <2><fc1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fc2>   DW_AT_name        : (indirect string, offset: 0x2154f): HAL_TIM_STATE_BUSY
    <fc6>   DW_AT_const_value : 2
 <2><fc7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fc8>   DW_AT_name        : (indirect string, offset: 0x6fdbe): HAL_TIM_STATE_TIMEOUT
    <fcc>   DW_AT_const_value : 3
 <2><fcd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fce>   DW_AT_name        : (indirect string, offset: 0x309e7): HAL_TIM_STATE_ERROR
    <fd2>   DW_AT_const_value : 4
 <2><fd3>: Abbrev Number: 0
 <1><fd4>: Abbrev Number: 9 (DW_TAG_typedef)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x60f71): HAL_TIM_StateTypeDef
    <fd9>   DW_AT_decl_file   : 7
    <fda>   DW_AT_decl_line   : 297
    <fdc>   DW_AT_decl_column : 3
    <fdd>   DW_AT_type        : <0xfa6>
 <1><fe1>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fe2>   DW_AT_type        : <0xfd4>
 <1><fe6>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <fe7>   DW_AT_encoding    : 7	(unsigned)
    <fe8>   DW_AT_byte_size   : 1
    <fe9>   DW_AT_type        : <0xb23>
    <fed>   DW_AT_decl_file   : 7
    <fee>   DW_AT_decl_line   : 303
    <ff0>   DW_AT_decl_column : 1
    <ff1>   DW_AT_sibling     : <0x1008>
 <2><ff5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x2f5b3): HAL_TIM_CHANNEL_STATE_RESET
    <ffa>   DW_AT_const_value : 0
 <2><ffb>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x4e44a): HAL_TIM_CHANNEL_STATE_READY
    <1000>   DW_AT_const_value : 1
 <2><1001>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1002>   DW_AT_name        : (indirect string, offset: 0x406a3): HAL_TIM_CHANNEL_STATE_BUSY
    <1006>   DW_AT_const_value : 2
 <2><1007>: Abbrev Number: 0
 <1><1008>: Abbrev Number: 9 (DW_TAG_typedef)
    <1009>   DW_AT_name        : (indirect string, offset: 0x1baea): HAL_TIM_ChannelStateTypeDef
    <100d>   DW_AT_decl_file   : 7
    <100e>   DW_AT_decl_line   : 307
    <1010>   DW_AT_decl_column : 3
    <1011>   DW_AT_type        : <0xfe6>
 <1><1015>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1016>   DW_AT_type        : <0x1008>
 <1><101a>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <101b>   DW_AT_encoding    : 7	(unsigned)
    <101c>   DW_AT_byte_size   : 1
    <101d>   DW_AT_type        : <0xb23>
    <1021>   DW_AT_decl_file   : 7
    <1022>   DW_AT_decl_line   : 313
    <1024>   DW_AT_decl_column : 1
    <1025>   DW_AT_sibling     : <0x103c>
 <2><1029>: Abbrev Number: 11 (DW_TAG_enumerator)
    <102a>   DW_AT_name        : (indirect string, offset: 0x2b5e): HAL_DMA_BURST_STATE_RESET
    <102e>   DW_AT_const_value : 0
 <2><102f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1030>   DW_AT_name        : (indirect string, offset: 0x497f7): HAL_DMA_BURST_STATE_READY
    <1034>   DW_AT_const_value : 1
 <2><1035>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1036>   DW_AT_name        : (indirect string, offset: 0x64701): HAL_DMA_BURST_STATE_BUSY
    <103a>   DW_AT_const_value : 2
 <2><103b>: Abbrev Number: 0
 <1><103c>: Abbrev Number: 9 (DW_TAG_typedef)
    <103d>   DW_AT_name        : (indirect string, offset: 0x11db1): HAL_TIM_DMABurstStateTypeDef
    <1041>   DW_AT_decl_file   : 7
    <1042>   DW_AT_decl_line   : 317
    <1044>   DW_AT_decl_column : 3
    <1045>   DW_AT_type        : <0x101a>
 <1><1049>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <104a>   DW_AT_type        : <0x103c>
 <1><104e>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <104f>   DW_AT_encoding    : 7	(unsigned)
    <1050>   DW_AT_byte_size   : 1
    <1051>   DW_AT_type        : <0xb23>
    <1055>   DW_AT_decl_file   : 7
    <1056>   DW_AT_decl_line   : 323
    <1058>   DW_AT_decl_column : 1
    <1059>   DW_AT_sibling     : <0x107c>
 <2><105d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <105e>   DW_AT_name        : (indirect string, offset: 0x4ad62): HAL_TIM_ACTIVE_CHANNEL_1
    <1062>   DW_AT_const_value : 1
 <2><1063>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1064>   DW_AT_name        : (indirect string, offset: 0x4ad7b): HAL_TIM_ACTIVE_CHANNEL_2
    <1068>   DW_AT_const_value : 2
 <2><1069>: Abbrev Number: 11 (DW_TAG_enumerator)
    <106a>   DW_AT_name        : (indirect string, offset: 0x4ad94): HAL_TIM_ACTIVE_CHANNEL_3
    <106e>   DW_AT_const_value : 4
 <2><106f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1070>   DW_AT_name        : (indirect string, offset: 0x4adad): HAL_TIM_ACTIVE_CHANNEL_4
    <1074>   DW_AT_const_value : 8
 <2><1075>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1076>   DW_AT_name        : (indirect string, offset: 0x3707b): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <107a>   DW_AT_const_value : 0
 <2><107b>: Abbrev Number: 0
 <1><107c>: Abbrev Number: 9 (DW_TAG_typedef)
    <107d>   DW_AT_name        : (indirect string, offset: 0x1ad5f): HAL_TIM_ActiveChannel
    <1081>   DW_AT_decl_file   : 7
    <1082>   DW_AT_decl_line   : 329
    <1084>   DW_AT_decl_column : 3
    <1085>   DW_AT_type        : <0x104e>
 <1><1089>: Abbrev Number: 6 (DW_TAG_structure_type)
    <108a>   DW_AT_byte_size   : 72
    <108b>   DW_AT_decl_file   : 7
    <108c>   DW_AT_decl_line   : 337
    <108e>   DW_AT_decl_column : 9
    <108f>   DW_AT_sibling     : <0x1112>
 <2><1093>: Abbrev Number: 8 (DW_TAG_member)
    <1094>   DW_AT_name        : (indirect string, offset: 0x33cdc): Instance
    <1098>   DW_AT_decl_file   : 7
    <1099>   DW_AT_decl_line   : 340
    <109b>   DW_AT_decl_column : 39
    <109c>   DW_AT_type        : <0x1112>
    <10a0>   DW_AT_data_member_location: 0
 <2><10a1>: Abbrev Number: 8 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x7c881): Init
    <10a6>   DW_AT_decl_file   : 7
    <10a7>   DW_AT_decl_line   : 341
    <10a9>   DW_AT_decl_column : 38
    <10aa>   DW_AT_type        : <0xf9a>
    <10ae>   DW_AT_data_member_location: 4
 <2><10af>: Abbrev Number: 8 (DW_TAG_member)
    <10b0>   DW_AT_name        : (indirect string, offset: 0x1ad6d): Channel
    <10b4>   DW_AT_decl_file   : 7
    <10b5>   DW_AT_decl_line   : 342
    <10b7>   DW_AT_decl_column : 38
    <10b8>   DW_AT_type        : <0x107c>
    <10bc>   DW_AT_data_member_location: 28
 <2><10bd>: Abbrev Number: 8 (DW_TAG_member)
    <10be>   DW_AT_name        : (indirect string, offset: 0x50230): hdma
    <10c2>   DW_AT_decl_file   : 7
    <10c3>   DW_AT_decl_line   : 343
    <10c5>   DW_AT_decl_column : 39
    <10c6>   DW_AT_type        : <0x1118>
    <10ca>   DW_AT_data_member_location: 32
 <2><10cb>: Abbrev Number: 8 (DW_TAG_member)
    <10cc>   DW_AT_name        : (indirect string, offset: 0x5f6ef): Lock
    <10d0>   DW_AT_decl_file   : 7
    <10d1>   DW_AT_decl_line   : 345
    <10d3>   DW_AT_decl_column : 38
    <10d4>   DW_AT_type        : <0xdac>
    <10d8>   DW_AT_data_member_location: 60
 <2><10d9>: Abbrev Number: 8 (DW_TAG_member)
    <10da>   DW_AT_name        : (indirect string, offset: 0x8e434): State
    <10de>   DW_AT_decl_file   : 7
    <10df>   DW_AT_decl_line   : 346
    <10e1>   DW_AT_decl_column : 38
    <10e2>   DW_AT_type        : <0xfe1>
    <10e6>   DW_AT_data_member_location: 61
 <2><10e7>: Abbrev Number: 8 (DW_TAG_member)
    <10e8>   DW_AT_name        : (indirect string, offset: 0x94367): ChannelState
    <10ec>   DW_AT_decl_file   : 7
    <10ed>   DW_AT_decl_line   : 347
    <10ef>   DW_AT_decl_column : 38
    <10f0>   DW_AT_type        : <0x1138>
    <10f4>   DW_AT_data_member_location: 62
 <2><10f5>: Abbrev Number: 8 (DW_TAG_member)
    <10f6>   DW_AT_name        : (indirect string, offset: 0x948fa): ChannelNState
