Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x9b2 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x45352): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x5cfdc): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x7c3cc): D:/STM32/STM32_CUBEIDE/_RTOS/_INTERRUPT/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0xb6f4): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x3eb99): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8

 <1><4c>: Abbrev Number: 4 (DW_TAG_typedef)
    <4d>   DW_AT_name        : (indirect string, offset: 0x27f11): __uint8_t
    <51>   DW_AT_decl_file   : 2
    <52>   DW_AT_decl_line   : 43
    <53>   DW_AT_decl_column : 24
    <54>   DW_AT_type        : <0x58>
 <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
    <59>   DW_AT_byte_size   : 1
    <5a>   DW_AT_encoding    : 8	(unsigned char)
    <5b>   DW_AT_name        : (indirect string, offset: 0x1bc27): unsigned char
 <1><5f>: Abbrev Number: 3 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 2
    <61>   DW_AT_encoding    : 5	(signed)
    <62>   DW_AT_name        : (indirect string, offset: 0x65ffe): short int
 <1><66>: Abbrev Number: 4 (DW_TAG_typedef)
    <67>   DW_AT_name        : (indirect string, offset: 0x6fea4): __uint16_t
    <6b>   DW_AT_decl_file   : 2
    <6c>   DW_AT_decl_line   : 57
    <6d>   DW_AT_decl_column : 25
    <6e>   DW_AT_type        : <0x72>
 <1><72>: Abbrev Number: 3 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 2
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0x2c95a): short unsigned int
 <1><79>: Abbrev Number: 3 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : (indirect string, offset: 0xbd4d): long int
 <1><80>: Abbrev Number: 4 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x56d85): __uint32_t
    <85>   DW_AT_decl_file   : 2
    <86>   DW_AT_decl_line   : 79
    <87>   DW_AT_decl_column : 25
    <88>   DW_AT_type        : <0x8c>
 <1><8c>: Abbrev Number: 3 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x202d6): long unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_base_type)
    <94>   DW_AT_byte_size   : 8
    <95>   DW_AT_encoding    : 7	(unsigned)
    <96>   DW_AT_name        : (indirect string, offset: 0x1c45b): long long unsigned int
 <1><9a>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b>   DW_AT_name        : (indirect string, offset: 0x27f13): uint8_t
    <9f>   DW_AT_decl_file   : 3
    <a0>   DW_AT_decl_line   : 24
    <a1>   DW_AT_decl_column : 19
    <a2>   DW_AT_type        : <0x4c>
 <1><a6>: Abbrev Number: 4 (DW_TAG_typedef)
    <a7>   DW_AT_name        : (indirect string, offset: 0x63e80): uint16_t
    <ab>   DW_AT_decl_file   : 3
    <ac>   DW_AT_decl_line   : 36
    <ad>   DW_AT_decl_column : 20
    <ae>   DW_AT_type        : <0x66>
 <1><b2>: Abbrev Number: 4 (DW_TAG_typedef)
    <b3>   DW_AT_name        : (indirect string, offset: 0x63817): uint32_t
    <b7>   DW_AT_decl_file   : 3
    <b8>   DW_AT_decl_line   : 48
    <b9>   DW_AT_decl_column : 20
    <ba>   DW_AT_type        : <0x80>
 <1><be>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <bf>   DW_AT_byte_size   : 4
 <1><c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <c1>   DW_AT_name        : (indirect string, offset: 0x64138): StackType_t
    <c5>   DW_AT_decl_file   : 4
    <c6>   DW_AT_decl_line   : 55
    <c7>   DW_AT_decl_column : 24
    <c8>   DW_AT_type        : <0xb2>
 <1><cc>: Abbrev Number: 4 (DW_TAG_typedef)
    <cd>   DW_AT_name        : (indirect string, offset: 0x7d524): UBaseType_t
    <d1>   DW_AT_decl_file   : 4
    <d2>   DW_AT_decl_line   : 57
    <d3>   DW_AT_decl_column : 23
    <d4>   DW_AT_type        : <0x8c>
 <1><d8>: Abbrev Number: 4 (DW_TAG_typedef)
    <d9>   DW_AT_name        : (indirect string, offset: 0x4afde): TickType_t
    <dd>   DW_AT_decl_file   : 4
    <de>   DW_AT_decl_line   : 63
    <df>   DW_AT_decl_column : 19
    <e0>   DW_AT_type        : <0xb2>
 <1><e4>: Abbrev Number: 6 (DW_TAG_typedef)
    <e5>   DW_AT_name        : (indirect string, offset: 0x87e6c): wint_t
    <e9>   DW_AT_decl_file   : 5
    <ea>   DW_AT_decl_line   : 350
    <ec>   DW_AT_decl_column : 23
    <ed>   DW_AT_type        : <0x30>
 <1><f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <f2>   DW_AT_name        : (indirect string, offset: 0x7bcae): _off_t
    <f6>   DW_AT_decl_file   : 6
    <f7>   DW_AT_decl_line   : 46
    <f8>   DW_AT_decl_column : 14
    <f9>   DW_AT_type        : <0x79>
 <1><fd>: Abbrev Number: 4 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x1e442): _fpos_t
    <102>   DW_AT_decl_file   : 6
    <103>   DW_AT_decl_line   : 116
    <104>   DW_AT_decl_column : 14
    <105>   DW_AT_type        : <0x79>
 <1><109>: Abbrev Number: 7 (DW_TAG_union_type)
    <10a>   DW_AT_byte_size   : 4
    <10b>   DW_AT_decl_file   : 6
    <10c>   DW_AT_decl_line   : 165
    <10d>   DW_AT_decl_column : 3
    <10e>   DW_AT_sibling     : <0x12b>
 <2><112>: Abbrev Number: 8 (DW_TAG_member)
    <113>   DW_AT_name        : (indirect string, offset: 0x80535): __wch
    <117>   DW_AT_decl_file   : 6
    <118>   DW_AT_decl_line   : 167
    <119>   DW_AT_decl_column : 12
    <11a>   DW_AT_type        : <0xe4>
 <2><11e>: Abbrev Number: 8 (DW_TAG_member)
    <11f>   DW_AT_name        : (indirect string, offset: 0x46430): __wchb
    <123>   DW_AT_decl_file   : 6
    <124>   DW_AT_decl_line   : 168
    <125>   DW_AT_decl_column : 19
    <126>   DW_AT_type        : <0x12b>
 <2><12a>: Abbrev Number: 0
 <1><12b>: Abbrev Number: 9 (DW_TAG_array_type)
    <12c>   DW_AT_type        : <0x58>
    <130>   DW_AT_sibling     : <0x13b>
 <2><134>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <135>   DW_AT_type        : <0x30>
    <139>   DW_AT_upper_bound : 3
 <2><13a>: Abbrev Number: 0
 <1><13b>: Abbrev Number: 11 (DW_TAG_structure_type)
    <13c>   DW_AT_byte_size   : 8
    <13d>   DW_AT_decl_file   : 6
    <13e>   DW_AT_decl_line   : 162
    <13f>   DW_AT_decl_column : 9
    <140>   DW_AT_sibling     : <0x15f>
 <2><144>: Abbrev Number: 12 (DW_TAG_member)
    <145>   DW_AT_name        : (indirect string, offset: 0x26795): __count
    <149>   DW_AT_decl_file   : 6
    <14a>   DW_AT_decl_line   : 164
    <14b>   DW_AT_decl_column : 7
    <14c>   DW_AT_type        : <0x29>
    <150>   DW_AT_data_member_location: 0
 <2><151>: Abbrev Number: 12 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x1bcea): __value
    <156>   DW_AT_decl_file   : 6
    <157>   DW_AT_decl_line   : 169
    <158>   DW_AT_decl_column : 5
    <159>   DW_AT_type        : <0x109>
    <15d>   DW_AT_data_member_location: 4
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 4 (DW_TAG_typedef)
    <160>   DW_AT_name        : (indirect string, offset: 0x47663): _mbstate_t
    <164>   DW_AT_decl_file   : 6
    <165>   DW_AT_decl_line   : 170
    <166>   DW_AT_decl_column : 3
    <167>   DW_AT_type        : <0x13b>
 <1><16b>: Abbrev Number: 4 (DW_TAG_typedef)
    <16c>   DW_AT_name        : (indirect string, offset: 0x79dbc): __ULong
    <170>   DW_AT_decl_file   : 7
    <171>   DW_AT_decl_line   : 22
    <172>   DW_AT_decl_column : 25
    <173>   DW_AT_type        : <0x8c>
 <1><177>: Abbrev Number: 4 (DW_TAG_typedef)
    <178>   DW_AT_name        : (indirect string, offset: 0x4ac60): _LOCK_T
    <17c>   DW_AT_decl_file   : 8
    <17d>   DW_AT_decl_line   : 34
    <17e>   DW_AT_decl_column : 25
    <17f>   DW_AT_type        : <0x183>
 <1><183>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <184>   DW_AT_byte_size   : 4
    <185>   DW_AT_type        : <0x189>
 <1><189>: Abbrev Number: 14 (DW_TAG_structure_type)
    <18a>   DW_AT_name        : (indirect string, offset: 0x114d1): __lock
    <18e>   DW_AT_declaration : 1
 <1><18e>: Abbrev Number: 4 (DW_TAG_typedef)
    <18f>   DW_AT_name        : (indirect string, offset: 0x4372a): _flock_t
    <193>   DW_AT_decl_file   : 7
    <194>   DW_AT_decl_line   : 35
    <195>   DW_AT_decl_column : 27
    <196>   DW_AT_type        : <0x177>
 <1><19a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <19b>   DW_AT_name        : (indirect string, offset: 0x2ec7b): _Bigint
    <19f>   DW_AT_byte_size   : 24
    <1a0>   DW_AT_decl_file   : 7
    <1a1>   DW_AT_decl_line   : 52
    <1a2>   DW_AT_decl_column : 8
    <1a3>   DW_AT_sibling     : <0x1f4>
 <2><1a7>: Abbrev Number: 12 (DW_TAG_member)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x510d1): _next
    <1ac>   DW_AT_decl_file   : 7
    <1ad>   DW_AT_decl_line   : 54
    <1ae>   DW_AT_decl_column : 19
    <1af>   DW_AT_type        : <0x1f4>
    <1b3>   DW_AT_data_member_location: 0
 <2><1b4>: Abbrev Number: 16 (DW_TAG_member)
    <1b5>   DW_AT_name        : _k
    <1b8>   DW_AT_decl_file   : 7
    <1b9>   DW_AT_decl_line   : 55
    <1ba>   DW_AT_decl_column : 7
    <1bb>   DW_AT_type        : <0x29>
    <1bf>   DW_AT_data_member_location: 4
 <2><1c0>: Abbrev Number: 12 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x62366): _maxwds
    <1c5>   DW_AT_decl_file   : 7
    <1c6>   DW_AT_decl_line   : 55
    <1c7>   DW_AT_decl_column : 11
    <1c8>   DW_AT_type        : <0x29>
    <1cc>   DW_AT_data_member_location: 8
 <2><1cd>: Abbrev Number: 12 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x488eb): _sign
    <1d2>   DW_AT_decl_file   : 7
    <1d3>   DW_AT_decl_line   : 55
    <1d4>   DW_AT_decl_column : 20
    <1d5>   DW_AT_type        : <0x29>
    <1d9>   DW_AT_data_member_location: 12
 <2><1da>: Abbrev Number: 12 (DW_TAG_member)
    <1db>   DW_AT_name        : (indirect string, offset: 0x487b4): _wds
    <1df>   DW_AT_decl_file   : 7
    <1e0>   DW_AT_decl_line   : 55
    <1e1>   DW_AT_decl_column : 27
    <1e2>   DW_AT_type        : <0x29>
    <1e6>   DW_AT_data_member_location: 16
 <2><1e7>: Abbrev Number: 16 (DW_TAG_member)
    <1e8>   DW_AT_name        : _x
    <1eb>   DW_AT_decl_file   : 7
    <1ec>   DW_AT_decl_line   : 56
    <1ed>   DW_AT_decl_column : 11
    <1ee>   DW_AT_type        : <0x1fa>
    <1f2>   DW_AT_data_member_location: 20
 <2><1f3>: Abbrev Number: 0
 <1><1f4>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <1f5>   DW_AT_byte_size   : 4
    <1f6>   DW_AT_type        : <0x19a>
 <1><1fa>: Abbrev Number: 9 (DW_TAG_array_type)
    <1fb>   DW_AT_type        : <0x16b>
    <1ff>   DW_AT_sibling     : <0x20a>
 <2><203>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <204>   DW_AT_type        : <0x30>
    <208>   DW_AT_upper_bound : 0
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <20b>   DW_AT_name        : (indirect string, offset: 0x251c5): __tm
    <20f>   DW_AT_byte_size   : 36
    <210>   DW_AT_decl_file   : 7
    <211>   DW_AT_decl_line   : 60
    <212>   DW_AT_decl_column : 8
    <213>   DW_AT_sibling     : <0x28d>
 <2><217>: Abbrev Number: 12 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0x70315): __tm_sec
    <21c>   DW_AT_decl_file   : 7
    <21d>   DW_AT_decl_line   : 62
    <21e>   DW_AT_decl_column : 9
    <21f>   DW_AT_type        : <0x29>
    <223>   DW_AT_data_member_location: 0
 <2><224>: Abbrev Number: 12 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x938): __tm_min
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 63
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0x29>
    <230>   DW_AT_data_member_location: 4
 <2><231>: Abbrev Number: 12 (DW_TAG_member)
    <232>   DW_AT_name        : (indirect string, offset: 0x1d127): __tm_hour
    <236>   DW_AT_decl_file   : 7
    <237>   DW_AT_decl_line   : 64
    <238>   DW_AT_decl_column : 9
    <239>   DW_AT_type        : <0x29>
    <23d>   DW_AT_data_member_location: 8
 <2><23e>: Abbrev Number: 12 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x4fc19): __tm_mday
    <243>   DW_AT_decl_file   : 7
    <244>   DW_AT_decl_line   : 65
    <245>   DW_AT_decl_column : 9
    <246>   DW_AT_type        : <0x29>
    <24a>   DW_AT_data_member_location: 12
 <2><24b>: Abbrev Number: 12 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x25ec): __tm_mon
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 66
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0x29>
    <257>   DW_AT_data_member_location: 16
 <2><258>: Abbrev Number: 12 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0x7eb9c): __tm_year
    <25d>   DW_AT_decl_file   : 7
    <25e>   DW_AT_decl_line   : 67
    <25f>   DW_AT_decl_column : 9
    <260>   DW_AT_type        : <0x29>
    <264>   DW_AT_data_member_location: 20
 <2><265>: Abbrev Number: 12 (DW_TAG_member)
    <266>   DW_AT_name        : (indirect string, offset: 0x3a208): __tm_wday
    <26a>   DW_AT_decl_file   : 7
    <26b>   DW_AT_decl_line   : 68
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0x29>
    <271>   DW_AT_data_member_location: 24
 <2><272>: Abbrev Number: 12 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0x75729): __tm_yday
    <277>   DW_AT_decl_file   : 7
    <278>   DW_AT_decl_line   : 69
    <279>   DW_AT_decl_column : 9
    <27a>   DW_AT_type        : <0x29>
    <27e>   DW_AT_data_member_location: 28
 <2><27f>: Abbrev Number: 12 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x7ac67): __tm_isdst
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 70
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0x29>
    <28b>   DW_AT_data_member_location: 32
 <2><28c>: Abbrev Number: 0
 <1><28d>: Abbrev Number: 15 (DW_TAG_structure_type)
    <28e>   DW_AT_name        : (indirect string, offset: 0x5b5e9): __sbuf
    <292>   DW_AT_byte_size   : 8
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 122
    <295>   DW_AT_decl_column : 8
    <296>   DW_AT_sibling     : <0x2b5>
 <2><29a>: Abbrev Number: 12 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0x870d8): _base
    <29f>   DW_AT_decl_file   : 7
    <2a0>   DW_AT_decl_line   : 123
    <2a1>   DW_AT_decl_column : 17
    <2a2>   DW_AT_type        : <0x2b5>
    <2a6>   DW_AT_data_member_location: 0
 <2><2a7>: Abbrev Number: 12 (DW_TAG_member)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x4dab0): _size
    <2ac>   DW_AT_decl_file   : 7
    <2ad>   DW_AT_decl_line   : 124
    <2ae>   DW_AT_decl_column : 6
    <2af>   DW_AT_type        : <0x29>
    <2b3>   DW_AT_data_member_location: 4
 <2><2b4>: Abbrev Number: 0
 <1><2b5>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <2b6>   DW_AT_byte_size   : 4
    <2b7>   DW_AT_type        : <0x58>
 <1><2bb>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x92491): _reent
    <2c0>   DW_AT_byte_size   : 96
    <2c1>   DW_AT_decl_file   : 7
    <2c2>   DW_AT_decl_line   : 377
    <2c4>   DW_AT_decl_column : 8
    <2c5>   DW_AT_sibling     : <0x3fe>
 <2><2c9>: Abbrev Number: 18 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x4fd34): _errno
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 381
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x29>
    <2d6>   DW_AT_data_member_location: 0
 <2><2d7>: Abbrev Number: 18 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x9184b): _stdin
    <2dc>   DW_AT_decl_file   : 7
    <2dd>   DW_AT_decl_line   : 386
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0x651>
    <2e4>   DW_AT_data_member_location: 4
 <2><2e5>: Abbrev Number: 18 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x92374): _stdout
    <2ea>   DW_AT_decl_file   : 7
    <2eb>   DW_AT_decl_line   : 386
    <2ed>   DW_AT_decl_column : 20
    <2ee>   DW_AT_type        : <0x651>
    <2f2>   DW_AT_data_member_location: 8
 <2><2f3>: Abbrev Number: 18 (DW_TAG_member)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x9231d): _stderr
    <2f8>   DW_AT_decl_file   : 7
    <2f9>   DW_AT_decl_line   : 386
    <2fb>   DW_AT_decl_column : 30
    <2fc>   DW_AT_type        : <0x651>
    <300>   DW_AT_data_member_location: 12
 <2><301>: Abbrev Number: 18 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0x56602): _inc
    <306>   DW_AT_decl_file   : 7
    <307>   DW_AT_decl_line   : 388
    <309>   DW_AT_decl_column : 8
    <30a>   DW_AT_type        : <0x29>
    <30e>   DW_AT_data_member_location: 16
 <2><30f>: Abbrev Number: 18 (DW_TAG_member)
    <310>   DW_AT_name        : (indirect string, offset: 0x6bf41): _emergency
    <314>   DW_AT_decl_file   : 7
    <315>   DW_AT_decl_line   : 390
    <317>   DW_AT_decl_column : 9
    <318>   DW_AT_type        : <0x565>
    <31c>   DW_AT_data_member_location: 20
 <2><31d>: Abbrev Number: 18 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x3bcce): __sdidinit
    <322>   DW_AT_decl_file   : 7
    <323>   DW_AT_decl_line   : 392
    <325>   DW_AT_decl_column : 7
    <326>   DW_AT_type        : <0x29>
    <32a>   DW_AT_data_member_location: 24
 <2><32b>: Abbrev Number: 18 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0xc9a9): _unspecified_locale_info
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 394
    <333>   DW_AT_decl_column : 7
    <334>   DW_AT_type        : <0x29>
    <338>   DW_AT_data_member_location: 28
 <2><339>: Abbrev Number: 18 (DW_TAG_member)
    <33a>   DW_AT_name        : (indirect string, offset: 0x79096): _locale
    <33e>   DW_AT_decl_file   : 7
    <33f>   DW_AT_decl_line   : 395
    <341>   DW_AT_decl_column : 22
    <342>   DW_AT_type        : <0x7b9>
    <346>   DW_AT_data_member_location: 32
 <2><347>: Abbrev Number: 19 (DW_TAG_member)
    <348>   DW_AT_name        : _mp
    <34c>   DW_AT_decl_file   : 7
    <34d>   DW_AT_decl_line   : 397
    <34f>   DW_AT_decl_column : 18
    <350>   DW_AT_type        : <0x7bf>
    <354>   DW_AT_data_member_location: 36
 <2><355>: Abbrev Number: 18 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x15230): __cleanup
    <35a>   DW_AT_decl_file   : 7
    <35b>   DW_AT_decl_line   : 399
    <35d>   DW_AT_decl_column : 10
    <35e>   DW_AT_type        : <0x7d0>
    <362>   DW_AT_data_member_location: 40
 <2><363>: Abbrev Number: 18 (DW_TAG_member)
    <364>   DW_AT_name        : (indirect string, offset: 0x22125): _gamma_signgam
    <368>   DW_AT_decl_file   : 7
    <369>   DW_AT_decl_line   : 401
    <36b>   DW_AT_decl_column : 7
    <36c>   DW_AT_type        : <0x29>
    <370>   DW_AT_data_member_location: 44
 <2><371>: Abbrev Number: 18 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x6dbef): _cvtlen
    <376>   DW_AT_decl_file   : 7
    <377>   DW_AT_decl_line   : 404
    <379>   DW_AT_decl_column : 7
    <37a>   DW_AT_type        : <0x29>
    <37e>   DW_AT_data_member_location: 48
 <2><37f>: Abbrev Number: 18 (DW_TAG_member)
    <380>   DW_AT_name        : (indirect string, offset: 0x3f766): _cvtbuf
    <384>   DW_AT_decl_file   : 7
    <385>   DW_AT_decl_line   : 405
    <387>   DW_AT_decl_column : 9
    <388>   DW_AT_type        : <0x565>
    <38c>   DW_AT_data_member_location: 52
 <2><38d>: Abbrev Number: 18 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x664a4): _r48
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 407
    <395>   DW_AT_decl_column : 19
    <396>   DW_AT_type        : <0x7d6>
    <39a>   DW_AT_data_member_location: 56
 <2><39b>: Abbrev Number: 18 (DW_TAG_member)
    <39c>   DW_AT_name        : (indirect string, offset: 0x71e87): _localtime_buf
    <3a0>   DW_AT_decl_file   : 7
    <3a1>   DW_AT_decl_line   : 408
    <3a3>   DW_AT_decl_column : 16
    <3a4>   DW_AT_type        : <0x7dc>
    <3a8>   DW_AT_data_member_location: 60
 <2><3a9>: Abbrev Number: 18 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x20281): _asctime_buf
    <3ae>   DW_AT_decl_file   : 7
    <3af>   DW_AT_decl_line   : 409
    <3b1>   DW_AT_decl_column : 9
    <3b2>   DW_AT_type        : <0x565>
    <3b6>   DW_AT_data_member_location: 64
 <2><3b7>: Abbrev Number: 18 (DW_TAG_member)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x70787): _sig_func
    <3bc>   DW_AT_decl_file   : 7
    <3bd>   DW_AT_decl_line   : 412
    <3bf>   DW_AT_decl_column : 12
    <3c0>   DW_AT_type        : <0x7ed>
    <3c4>   DW_AT_data_member_location: 68
 <2><3c5>: Abbrev Number: 18 (DW_TAG_member)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x6215c): __sglue
    <3ca>   DW_AT_decl_file   : 7
    <3cb>   DW_AT_decl_line   : 420
    <3cd>   DW_AT_decl_column : 16
    <3ce>   DW_AT_type        : <0x612>
    <3d2>   DW_AT_data_member_location: 72
 <2><3d3>: Abbrev Number: 18 (DW_TAG_member)
    <3d4>   DW_AT_name        : (indirect string, offset: 0x24dc7): __sf
    <3d8>   DW_AT_decl_file   : 7
    <3d9>   DW_AT_decl_line   : 421
    <3db>   DW_AT_decl_column : 11
    <3dc>   DW_AT_type        : <0x651>
    <3e0>   DW_AT_data_member_location: 84
 <2><3e1>: Abbrev Number: 18 (DW_TAG_member)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x3e27a): _misc
    <3e6>   DW_AT_decl_file   : 7
    <3e7>   DW_AT_decl_line   : 422
    <3e9>   DW_AT_decl_column : 23
    <3ea>   DW_AT_type        : <0x7f9>
    <3ee>   DW_AT_data_member_location: 88
 <2><3ef>: Abbrev Number: 18 (DW_TAG_member)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x55228): _signal_buf
    <3f4>   DW_AT_decl_file   : 7
    <3f5>   DW_AT_decl_line   : 423
    <3f7>   DW_AT_decl_column : 9
    <3f8>   DW_AT_type        : <0x565>
    <3fc>   DW_AT_data_member_location: 92
 <2><3fd>: Abbrev Number: 0
 <1><3fe>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <3ff>   DW_AT_byte_size   : 4
    <400>   DW_AT_type        : <0x2bb>
 <1><404>: Abbrev Number: 15 (DW_TAG_structure_type)
    <405>   DW_AT_name        : (indirect string, offset: 0x68f80): __sFILE
    <409>   DW_AT_byte_size   : 104
    <40a>   DW_AT_decl_file   : 7
    <40b>   DW_AT_decl_line   : 186
    <40c>   DW_AT_decl_column : 8
    <40d>   DW_AT_sibling     : <0x547>
 <2><411>: Abbrev Number: 16 (DW_TAG_member)
    <412>   DW_AT_name        : _p
    <415>   DW_AT_decl_file   : 7
    <416>   DW_AT_decl_line   : 187
    <417>   DW_AT_decl_column : 18
    <418>   DW_AT_type        : <0x2b5>
    <41c>   DW_AT_data_member_location: 0
 <2><41d>: Abbrev Number: 16 (DW_TAG_member)
    <41e>   DW_AT_name        : _r
    <421>   DW_AT_decl_file   : 7
    <422>   DW_AT_decl_line   : 188
    <423>   DW_AT_decl_column : 7
    <424>   DW_AT_type        : <0x29>
    <428>   DW_AT_data_member_location: 4
 <2><429>: Abbrev Number: 16 (DW_TAG_member)
    <42a>   DW_AT_name        : _w
    <42d>   DW_AT_decl_file   : 7
    <42e>   DW_AT_decl_line   : 189
    <42f>   DW_AT_decl_column : 7
    <430>   DW_AT_type        : <0x29>
    <434>   DW_AT_data_member_location: 8
 <2><435>: Abbrev Number: 12 (DW_TAG_member)
    <436>   DW_AT_name        : (indirect string, offset: 0x3ec47): _flags
    <43a>   DW_AT_decl_file   : 7
    <43b>   DW_AT_decl_line   : 190
    <43c>   DW_AT_decl_column : 9
    <43d>   DW_AT_type        : <0x5f>
    <441>   DW_AT_data_member_location: 12
 <2><442>: Abbrev Number: 12 (DW_TAG_member)
    <443>   DW_AT_name        : (indirect string, offset: 0x14ba5): _file
    <447>   DW_AT_decl_file   : 7
    <448>   DW_AT_decl_line   : 191
    <449>   DW_AT_decl_column : 9
    <44a>   DW_AT_type        : <0x5f>
    <44e>   DW_AT_data_member_location: 14
 <2><44f>: Abbrev Number: 16 (DW_TAG_member)
    <450>   DW_AT_name        : _bf
    <454>   DW_AT_decl_file   : 7
    <455>   DW_AT_decl_line   : 192
    <456>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0x28d>
    <45b>   DW_AT_data_member_location: 16
 <2><45c>: Abbrev Number: 12 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0x3f0cf): _lbfsize
    <461>   DW_AT_decl_file   : 7
    <462>   DW_AT_decl_line   : 193
    <463>   DW_AT_decl_column : 7
    <464>   DW_AT_type        : <0x29>
    <468>   DW_AT_data_member_location: 24
 <2><469>: Abbrev Number: 12 (DW_TAG_member)
    <46a>   DW_AT_name        : (indirect string, offset: 0x906dd): _data
    <46e>   DW_AT_decl_file   : 7
    <46f>   DW_AT_decl_line   : 196
    <470>   DW_AT_decl_column : 18
    <471>   DW_AT_type        : <0x3fe>
    <475>   DW_AT_data_member_location: 28
 <2><476>: Abbrev Number: 12 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0x79a3d): _cookie
    <47b>   DW_AT_decl_file   : 7
    <47c>   DW_AT_decl_line   : 200
    <47d>   DW_AT_decl_column : 10
    <47e>   DW_AT_type        : <0xbe>
    <482>   DW_AT_data_member_location: 32
 <2><483>: Abbrev Number: 12 (DW_TAG_member)
    <484>   DW_AT_name        : (indirect string, offset: 0x6be5c): _read
    <488>   DW_AT_decl_file   : 7
    <489>   DW_AT_decl_line   : 202
    <48a>   DW_AT_decl_column : 29
    <48b>   DW_AT_type        : <0x577>
    <48f>   DW_AT_data_member_location: 36
 <2><490>: Abbrev Number: 12 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x11507): _write
    <495>   DW_AT_decl_file   : 7
    <496>   DW_AT_decl_line   : 204
    <497>   DW_AT_decl_column : 29
    <498>   DW_AT_type        : <0x5a1>
    <49c>   DW_AT_data_member_location: 40
 <2><49d>: Abbrev Number: 12 (DW_TAG_member)
    <49e>   DW_AT_name        : (indirect string, offset: 0x85689): _seek
    <4a2>   DW_AT_decl_file   : 7
    <4a3>   DW_AT_decl_line   : 207
    <4a4>   DW_AT_decl_column : 13
    <4a5>   DW_AT_type        : <0x5c5>
    <4a9>   DW_AT_data_member_location: 44
 <2><4aa>: Abbrev Number: 12 (DW_TAG_member)
    <4ab>   DW_AT_name        : (indirect string, offset: 0x3c883): _close
    <4af>   DW_AT_decl_file   : 7
    <4b0>   DW_AT_decl_line   : 208
    <4b1>   DW_AT_decl_column : 9
    <4b2>   DW_AT_type        : <0x5df>
    <4b6>   DW_AT_data_member_location: 48
 <2><4b7>: Abbrev Number: 16 (DW_TAG_member)
    <4b8>   DW_AT_name        : _ub
    <4bc>   DW_AT_decl_file   : 7
    <4bd>   DW_AT_decl_line   : 211
    <4be>   DW_AT_decl_column : 17
    <4bf>   DW_AT_type        : <0x28d>
    <4c3>   DW_AT_data_member_location: 52
 <2><4c4>: Abbrev Number: 16 (DW_TAG_member)
    <4c5>   DW_AT_name        : _up
    <4c9>   DW_AT_decl_file   : 7
    <4ca>   DW_AT_decl_line   : 212
    <4cb>   DW_AT_decl_column : 18
    <4cc>   DW_AT_type        : <0x2b5>
    <4d0>   DW_AT_data_member_location: 60
 <2><4d1>: Abbrev Number: 16 (DW_TAG_member)
    <4d2>   DW_AT_name        : _ur
    <4d6>   DW_AT_decl_file   : 7
    <4d7>   DW_AT_decl_line   : 213
    <4d8>   DW_AT_decl_column : 7
    <4d9>   DW_AT_type        : <0x29>
    <4dd>   DW_AT_data_member_location: 64
 <2><4de>: Abbrev Number: 12 (DW_TAG_member)
    <4df>   DW_AT_name        : (indirect string, offset: 0x24e85): _ubuf
    <4e3>   DW_AT_decl_file   : 7
    <4e4>   DW_AT_decl_line   : 216
    <4e5>   DW_AT_decl_column : 17
    <4e6>   DW_AT_type        : <0x5e5>
    <4ea>   DW_AT_data_member_location: 68
 <2><4eb>: Abbrev Number: 12 (DW_TAG_member)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x5d11f): _nbuf
    <4f0>   DW_AT_decl_file   : 7
    <4f1>   DW_AT_decl_line   : 217
    <4f2>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x5f5>
    <4f7>   DW_AT_data_member_location: 71
 <2><4f8>: Abbrev Number: 16 (DW_TAG_member)
    <4f9>   DW_AT_name        : _lb
    <4fd>   DW_AT_decl_file   : 7
    <4fe>   DW_AT_decl_line   : 220
    <4ff>   DW_AT_decl_column : 17
    <500>   DW_AT_type        : <0x28d>
    <504>   DW_AT_data_member_location: 72
 <2><505>: Abbrev Number: 12 (DW_TAG_member)
    <506>   DW_AT_name        : (indirect string, offset: 0x226f6): _blksize
    <50a>   DW_AT_decl_file   : 7
    <50b>   DW_AT_decl_line   : 223
    <50c>   DW_AT_decl_column : 7
    <50d>   DW_AT_type        : <0x29>
    <511>   DW_AT_data_member_location: 80
 <2><512>: Abbrev Number: 12 (DW_TAG_member)
    <513>   DW_AT_name        : (indirect string, offset: 0x2be14): _offset
    <517>   DW_AT_decl_file   : 7
    <518>   DW_AT_decl_line   : 224
    <519>   DW_AT_decl_column : 10
    <51a>   DW_AT_type        : <0xf1>
    <51e>   DW_AT_data_member_location: 84
 <2><51f>: Abbrev Number: 12 (DW_TAG_member)
    <520>   DW_AT_name        : (indirect string, offset: 0x114d2): _lock
    <524>   DW_AT_decl_file   : 7
    <525>   DW_AT_decl_line   : 231
    <526>   DW_AT_decl_column : 12
    <527>   DW_AT_type        : <0x18e>
    <52b>   DW_AT_data_member_location: 88
 <2><52c>: Abbrev Number: 12 (DW_TAG_member)
    <52d>   DW_AT_name        : (indirect string, offset: 0x10133): _mbstate
    <531>   DW_AT_decl_file   : 7
    <532>   DW_AT_decl_line   : 233
    <533>   DW_AT_decl_column : 14
    <534>   DW_AT_type        : <0x15f>
    <538>   DW_AT_data_member_location: 92
 <2><539>: Abbrev Number: 12 (DW_TAG_member)
    <53a>   DW_AT_name        : (indirect string, offset: 0x6f76a): _flags2
    <53e>   DW_AT_decl_file   : 7
    <53f>   DW_AT_decl_line   : 234
    <540>   DW_AT_decl_column : 9
    <541>   DW_AT_type        : <0x29>
    <545>   DW_AT_data_member_location: 100
 <2><546>: Abbrev Number: 0
 <1><547>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <548>   DW_AT_prototyped  : 1
    <548>   DW_AT_type        : <0x29>
    <54c>   DW_AT_sibling     : <0x565>
 <2><550>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <551>   DW_AT_type        : <0x3fe>
 <2><555>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <556>   DW_AT_type        : <0xbe>
 <2><55a>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <55b>   DW_AT_type        : <0x565>
 <2><55f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <560>   DW_AT_type        : <0x29>
 <2><564>: Abbrev Number: 0
 <1><565>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <566>   DW_AT_byte_size   : 4
    <567>   DW_AT_type        : <0x56b>
 <1><56b>: Abbrev Number: 3 (DW_TAG_base_type)
    <56c>   DW_AT_byte_size   : 1
    <56d>   DW_AT_encoding    : 8	(unsigned char)
    <56e>   DW_AT_name        : (indirect string, offset: 0x2c1b8): char
 <1><572>: Abbrev Number: 22 (DW_TAG_const_type)
    <573>   DW_AT_type        : <0x56b>
 <1><577>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <578>   DW_AT_byte_size   : 4
    <579>   DW_AT_type        : <0x547>
 <1><57d>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <57e>   DW_AT_prototyped  : 1
    <57e>   DW_AT_type        : <0x29>
    <582>   DW_AT_sibling     : <0x59b>
 <2><586>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <587>   DW_AT_type        : <0x3fe>
 <2><58b>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <58c>   DW_AT_type        : <0xbe>
 <2><590>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <591>   DW_AT_type        : <0x59b>
 <2><595>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <596>   DW_AT_type        : <0x29>
 <2><59a>: Abbrev Number: 0
 <1><59b>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <59c>   DW_AT_byte_size   : 4
    <59d>   DW_AT_type        : <0x572>
 <1><5a1>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5a2>   DW_AT_byte_size   : 4
    <5a3>   DW_AT_type        : <0x57d>
 <1><5a7>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5a8>   DW_AT_prototyped  : 1
    <5a8>   DW_AT_type        : <0xfd>
    <5ac>   DW_AT_sibling     : <0x5c5>
 <2><5b0>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5b1>   DW_AT_type        : <0x3fe>
 <2><5b5>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5b6>   DW_AT_type        : <0xbe>
 <2><5ba>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5bb>   DW_AT_type        : <0xfd>
 <2><5bf>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5c0>   DW_AT_type        : <0x29>
 <2><5c4>: Abbrev Number: 0
 <1><5c5>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5c6>   DW_AT_byte_size   : 4
    <5c7>   DW_AT_type        : <0x5a7>
 <1><5cb>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5cc>   DW_AT_prototyped  : 1
    <5cc>   DW_AT_type        : <0x29>
    <5d0>   DW_AT_sibling     : <0x5df>
 <2><5d4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5d5>   DW_AT_type        : <0x3fe>
 <2><5d9>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5da>   DW_AT_type        : <0xbe>
 <2><5de>: Abbrev Number: 0
 <1><5df>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5e0>   DW_AT_byte_size   : 4
    <5e1>   DW_AT_type        : <0x5cb>
 <1><5e5>: Abbrev Number: 9 (DW_TAG_array_type)
    <5e6>   DW_AT_type        : <0x58>
    <5ea>   DW_AT_sibling     : <0x5f5>
 <2><5ee>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <5ef>   DW_AT_type        : <0x30>
    <5f3>   DW_AT_upper_bound : 2
 <2><5f4>: Abbrev Number: 0
 <1><5f5>: Abbrev Number: 9 (DW_TAG_array_type)
    <5f6>   DW_AT_type        : <0x58>
    <5fa>   DW_AT_sibling     : <0x605>
 <2><5fe>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <5ff>   DW_AT_type        : <0x30>
    <603>   DW_AT_upper_bound : 0
 <2><604>: Abbrev Number: 0
 <1><605>: Abbrev Number: 6 (DW_TAG_typedef)
    <606>   DW_AT_name        : (indirect string, offset: 0x6da18): __FILE
    <60a>   DW_AT_decl_file   : 7
    <60b>   DW_AT_decl_line   : 292
    <60d>   DW_AT_decl_column : 26
    <60e>   DW_AT_type        : <0x404>
 <1><612>: Abbrev Number: 17 (DW_TAG_structure_type)
    <613>   DW_AT_name        : (indirect string, offset: 0x691af): _glue
    <617>   DW_AT_byte_size   : 12
    <618>   DW_AT_decl_file   : 7
    <619>   DW_AT_decl_line   : 296
    <61b>   DW_AT_decl_column : 8
    <61c>   DW_AT_sibling     : <0x64b>
 <2><620>: Abbrev Number: 18 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0x510d1): _next
    <625>   DW_AT_decl_file   : 7
    <626>   DW_AT_decl_line   : 298
    <628>   DW_AT_decl_column : 17
    <629>   DW_AT_type        : <0x64b>
    <62d>   DW_AT_data_member_location: 0
 <2><62e>: Abbrev Number: 18 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x3334f): _niobs
    <633>   DW_AT_decl_file   : 7
    <634>   DW_AT_decl_line   : 299
    <636>   DW_AT_decl_column : 7
    <637>   DW_AT_type        : <0x29>
    <63b>   DW_AT_data_member_location: 4
 <2><63c>: Abbrev Number: 18 (DW_TAG_member)
    <63d>   DW_AT_name        : (indirect string, offset: 0x44f30): _iobs
    <641>   DW_AT_decl_file   : 7
    <642>   DW_AT_decl_line   : 300
    <644>   DW_AT_decl_column : 11
    <645>   DW_AT_type        : <0x651>
    <649>   DW_AT_data_member_location: 8
 <2><64a>: Abbrev Number: 0
 <1><64b>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <64c>   DW_AT_byte_size   : 4
    <64d>   DW_AT_type        : <0x612>
 <1><651>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <652>   DW_AT_byte_size   : 4
    <653>   DW_AT_type        : <0x605>
 <1><657>: Abbrev Number: 17 (DW_TAG_structure_type)
    <658>   DW_AT_name        : (indirect string, offset: 0x2f6c5): _rand48
    <65c>   DW_AT_byte_size   : 24
    <65d>   DW_AT_decl_file   : 7
    <65e>   DW_AT_decl_line   : 324
    <660>   DW_AT_decl_column : 8
    <661>   DW_AT_sibling     : <0x69e>
 <2><665>: Abbrev Number: 18 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0x8564e): _seed
    <66a>   DW_AT_decl_file   : 7
    <66b>   DW_AT_decl_line   : 325
    <66d>   DW_AT_decl_column : 18
    <66e>   DW_AT_type        : <0x69e>
    <672>   DW_AT_data_member_location: 0
 <2><673>: Abbrev Number: 18 (DW_TAG_member)
    <674>   DW_AT_name        : (indirect string, offset: 0xbb5e): _mult
    <678>   DW_AT_decl_file   : 7
    <679>   DW_AT_decl_line   : 326
    <67b>   DW_AT_decl_column : 18
    <67c>   DW_AT_type        : <0x69e>
    <680>   DW_AT_data_member_location: 6
 <2><681>: Abbrev Number: 18 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x4653d): _add
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 327
    <689>   DW_AT_decl_column : 18
    <68a>   DW_AT_type        : <0x72>
    <68e>   DW_AT_data_member_location: 12
 <2><68f>: Abbrev Number: 18 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x510cc): _rand_next
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 330
    <697>   DW_AT_decl_column : 36
    <698>   DW_AT_type        : <0x93>
    <69c>   DW_AT_data_member_location: 16
 <2><69d>: Abbrev Number: 0
 <1><69e>: Abbrev Number: 9 (DW_TAG_array_type)
    <69f>   DW_AT_type        : <0x72>
    <6a3>   DW_AT_sibling     : <0x6ae>
 <2><6a7>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <6a8>   DW_AT_type        : <0x30>
    <6ac>   DW_AT_upper_bound : 2
 <2><6ad>: Abbrev Number: 0
 <1><6ae>: Abbrev Number: 17 (DW_TAG_structure_type)
    <6af>   DW_AT_name        : (indirect string, offset: 0x3de61): _mprec
    <6b3>   DW_AT_byte_size   : 16
    <6b4>   DW_AT_decl_file   : 7
    <6b5>   DW_AT_decl_line   : 349
    <6b7>   DW_AT_decl_column : 8
    <6b8>   DW_AT_sibling     : <0x6f5>
 <2><6bc>: Abbrev Number: 18 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x879f9): _result
    <6c1>   DW_AT_decl_file   : 7
    <6c2>   DW_AT_decl_line   : 352
    <6c4>   DW_AT_decl_column : 19
    <6c5>   DW_AT_type        : <0x1f4>
    <6c9>   DW_AT_data_member_location: 0
 <2><6ca>: Abbrev Number: 18 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x59c76): _result_k
    <6cf>   DW_AT_decl_file   : 7
    <6d0>   DW_AT_decl_line   : 353
    <6d2>   DW_AT_decl_column : 7
    <6d3>   DW_AT_type        : <0x29>
    <6d7>   DW_AT_data_member_location: 4
 <2><6d8>: Abbrev Number: 18 (DW_TAG_member)
    <6d9>   DW_AT_name        : (indirect string, offset: 0x4119f): _p5s
    <6dd>   DW_AT_decl_file   : 7
    <6de>   DW_AT_decl_line   : 354
    <6e0>   DW_AT_decl_column : 19
    <6e1>   DW_AT_type        : <0x1f4>
    <6e5>   DW_AT_data_member_location: 8
 <2><6e6>: Abbrev Number: 18 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x4e9a7): _freelist
    <6eb>   DW_AT_decl_file   : 7
    <6ec>   DW_AT_decl_line   : 355
    <6ee>   DW_AT_decl_column : 20
    <6ef>   DW_AT_type        : <0x6f5>
    <6f3>   DW_AT_data_member_location: 12
 <2><6f4>: Abbrev Number: 0
 <1><6f5>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <6f6>   DW_AT_byte_size   : 4
    <6f7>   DW_AT_type        : <0x1f4>
 <1><6fb>: Abbrev Number: 17 (DW_TAG_structure_type)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x41167): _misc_reent
    <700>   DW_AT_byte_size   : 80
    <701>   DW_AT_decl_file   : 7
    <702>   DW_AT_decl_line   : 359
    <704>   DW_AT_decl_column : 8
    <705>   DW_AT_sibling     : <0x7a4>
 <2><709>: Abbrev Number: 18 (DW_TAG_member)
    <70a>   DW_AT_name        : (indirect string, offset: 0x7cada): _strtok_last
    <70e>   DW_AT_decl_file   : 7
    <70f>   DW_AT_decl_line   : 362
    <711>   DW_AT_decl_column : 9
    <712>   DW_AT_type        : <0x565>
    <716>   DW_AT_data_member_location: 0
 <2><717>: Abbrev Number: 18 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0x3c223): _mblen_state
    <71c>   DW_AT_decl_file   : 7
    <71d>   DW_AT_decl_line   : 363
    <71f>   DW_AT_decl_column : 14
    <720>   DW_AT_type        : <0x15f>
    <724>   DW_AT_data_member_location: 4
 <2><725>: Abbrev Number: 18 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x7cae7): _wctomb_state
    <72a>   DW_AT_decl_file   : 7
    <72b>   DW_AT_decl_line   : 364
    <72d>   DW_AT_decl_column : 14
    <72e>   DW_AT_type        : <0x15f>
    <732>   DW_AT_data_member_location: 12
 <2><733>: Abbrev Number: 18 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x74d0c): _mbtowc_state
    <738>   DW_AT_decl_file   : 7
    <739>   DW_AT_decl_line   : 365
    <73b>   DW_AT_decl_column : 14
    <73c>   DW_AT_type        : <0x15f>
    <740>   DW_AT_data_member_location: 20
 <2><741>: Abbrev Number: 18 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0x2205b): _l64a_buf
    <746>   DW_AT_decl_file   : 7
    <747>   DW_AT_decl_line   : 366
    <749>   DW_AT_decl_column : 8
    <74a>   DW_AT_type        : <0x7a4>
    <74e>   DW_AT_data_member_location: 28
 <2><74f>: Abbrev Number: 18 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x7bca1): _getdate_err
    <754>   DW_AT_decl_file   : 7
    <755>   DW_AT_decl_line   : 367
    <757>   DW_AT_decl_column : 7
    <758>   DW_AT_type        : <0x29>
    <75c>   DW_AT_data_member_location: 36
 <2><75d>: Abbrev Number: 18 (DW_TAG_member)
    <75e>   DW_AT_name        : (indirect string, offset: 0x421c6): _mbrlen_state
    <762>   DW_AT_decl_file   : 7
    <763>   DW_AT_decl_line   : 368
    <765>   DW_AT_decl_column : 14
    <766>   DW_AT_type        : <0x15f>
    <76a>   DW_AT_data_member_location: 40
 <2><76b>: Abbrev Number: 18 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x7bfe8): _mbrtowc_state
    <770>   DW_AT_decl_file   : 7
    <771>   DW_AT_decl_line   : 369
    <773>   DW_AT_decl_column : 14
    <774>   DW_AT_type        : <0x15f>
    <778>   DW_AT_data_member_location: 48
 <2><779>: Abbrev Number: 18 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0x26b32): _mbsrtowcs_state
    <77e>   DW_AT_decl_file   : 7
    <77f>   DW_AT_decl_line   : 370
    <781>   DW_AT_decl_column : 14
    <782>   DW_AT_type        : <0x15f>
    <786>   DW_AT_data_member_location: 56
 <2><787>: Abbrev Number: 18 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0x2a4b6): _wcrtomb_state
    <78c>   DW_AT_decl_file   : 7
    <78d>   DW_AT_decl_line   : 371
    <78f>   DW_AT_decl_column : 14
    <790>   DW_AT_type        : <0x15f>
    <794>   DW_AT_data_member_location: 64
 <2><795>: Abbrev Number: 18 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x4d36e): _wcsrtombs_state
    <79a>   DW_AT_decl_file   : 7
    <79b>   DW_AT_decl_line   : 372
    <79d>   DW_AT_decl_column : 14
    <79e>   DW_AT_type        : <0x15f>
    <7a2>   DW_AT_data_member_location: 72
 <2><7a3>: Abbrev Number: 0
 <1><7a4>: Abbrev Number: 9 (DW_TAG_array_type)
    <7a5>   DW_AT_type        : <0x56b>
    <7a9>   DW_AT_sibling     : <0x7b4>
 <2><7ad>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <7ae>   DW_AT_type        : <0x30>
    <7b2>   DW_AT_upper_bound : 7
 <2><7b3>: Abbrev Number: 0
 <1><7b4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x755a1): __locale_t
    <7b9>   DW_AT_declaration : 1
 <1><7b9>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7ba>   DW_AT_byte_size   : 4
    <7bb>   DW_AT_type        : <0x7b4>
 <1><7bf>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7c0>   DW_AT_byte_size   : 4
    <7c1>   DW_AT_type        : <0x6ae>
 <1><7c5>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7c6>   DW_AT_prototyped  : 1
    <7c6>   DW_AT_sibling     : <0x7d0>
 <2><7ca>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <7cb>   DW_AT_type        : <0x3fe>
 <2><7cf>: Abbrev Number: 0
 <1><7d0>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7d1>   DW_AT_byte_size   : 4
    <7d2>   DW_AT_type        : <0x7c5>
 <1><7d6>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7d7>   DW_AT_byte_size   : 4
    <7d8>   DW_AT_type        : <0x657>
 <1><7dc>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7dd>   DW_AT_byte_size   : 4
    <7de>   DW_AT_type        : <0x20a>
 <1><7e2>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7e3>   DW_AT_prototyped  : 1
    <7e3>   DW_AT_sibling     : <0x7ed>
 <2><7e7>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <7e8>   DW_AT_type        : <0x29>
 <2><7ec>: Abbrev Number: 0
 <1><7ed>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7ee>   DW_AT_byte_size   : 4
    <7ef>   DW_AT_type        : <0x7f3>
 <1><7f3>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7f4>   DW_AT_byte_size   : 4
    <7f5>   DW_AT_type        : <0x7e2>
 <1><7f9>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7fa>   DW_AT_byte_size   : 4
    <7fb>   DW_AT_type        : <0x6fb>
 <1><7ff>: Abbrev Number: 17 (DW_TAG_structure_type)
    <800>   DW_AT_name        : (indirect string, offset: 0x729ba): xSTATIC_LIST_ITEM
    <804>   DW_AT_byte_size   : 20
    <805>   DW_AT_decl_file   : 9
    <806>   DW_AT_decl_line   : 948
    <808>   DW_AT_decl_column : 8
    <809>   DW_AT_sibling     : <0x82a>
 <2><80d>: Abbrev Number: 18 (DW_TAG_member)
    <80e>   DW_AT_name        : (indirect string, offset: 0x1bc36): xDummy1
    <812>   DW_AT_decl_file   : 9
    <813>   DW_AT_decl_line   : 950
    <815>   DW_AT_decl_column : 13
    <816>   DW_AT_type        : <0xd8>
    <81a>   DW_AT_data_member_location: 0
 <2><81b>: Abbrev Number: 18 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0x315ed): pvDummy2
    <820>   DW_AT_decl_file   : 9
    <821>   DW_AT_decl_line   : 951
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0x82a>
    <828>   DW_AT_data_member_location: 4
 <2><829>: Abbrev Number: 0
 <1><82a>: Abbrev Number: 9 (DW_TAG_array_type)
    <82b>   DW_AT_type        : <0xbe>
    <82f>   DW_AT_sibling     : <0x83a>
 <2><833>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <834>   DW_AT_type        : <0x30>
    <838>   DW_AT_upper_bound : 3
 <2><839>: Abbrev Number: 0
 <1><83a>: Abbrev Number: 6 (DW_TAG_typedef)
    <83b>   DW_AT_name        : (indirect string, offset: 0x3177e): StaticListItem_t
    <83f>   DW_AT_decl_file   : 9
    <840>   DW_AT_decl_line   : 953
    <842>   DW_AT_decl_column : 34
    <843>   DW_AT_type        : <0x7ff>
 <1><847>: Abbrev Number: 17 (DW_TAG_structure_type)
    <848>   DW_AT_name        : (indirect string, offset: 0x5b549): xSTATIC_TCB
    <84c>   DW_AT_byte_size   : 180
    <84d>   DW_AT_decl_file   : 9
    <84e>   DW_AT_decl_line   : 984
    <850>   DW_AT_decl_column : 16
    <851>   DW_AT_sibling     : <0x8e2>
 <2><855>: Abbrev Number: 18 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0x1bc35): pxDummy1
    <85a>   DW_AT_decl_file   : 9
    <85b>   DW_AT_decl_line   : 986
    <85d>   DW_AT_decl_column : 11
    <85e>   DW_AT_type        : <0xbe>
    <862>   DW_AT_data_member_location: 0
 <2><863>: Abbrev Number: 18 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x1a11c): xDummy3
    <868>   DW_AT_decl_file   : 9
    <869>   DW_AT_decl_line   : 990
    <86b>   DW_AT_decl_column : 19
    <86c>   DW_AT_type        : <0x8e2>
    <870>   DW_AT_data_member_location: 4
 <2><871>: Abbrev Number: 18 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0x12cc8): uxDummy5
    <876>   DW_AT_decl_file   : 9
    <877>   DW_AT_decl_line   : 991
    <879>   DW_AT_decl_column : 16
    <87a>   DW_AT_type        : <0xcc>
    <87e>   DW_AT_data_member_location: 44
 <2><87f>: Abbrev Number: 18 (DW_TAG_member)
    <880>   DW_AT_name        : (indirect string, offset: 0x1bc58): pxDummy6
    <884>   DW_AT_decl_file   : 9
    <885>   DW_AT_decl_line   : 992
    <887>   DW_AT_decl_column : 11
    <888>   DW_AT_type        : <0xbe>
    <88c>   DW_AT_data_member_location: 48
 <2><88d>: Abbrev Number: 18 (DW_TAG_member)
    <88e>   DW_AT_name        : (indirect string, offset: 0x30413): ucDummy7
    <892>   DW_AT_decl_file   : 9
    <893>   DW_AT_decl_line   : 993
    <895>   DW_AT_decl_column : 13
    <896>   DW_AT_type        : <0x8f2>
    <89a>   DW_AT_data_member_location: 52
 <2><89b>: Abbrev Number: 18 (DW_TAG_member)
    <89c>   DW_AT_name        : (indirect string, offset: 0x1e0a3): uxDummy12
    <8a0>   DW_AT_decl_file   : 9
    <8a1>   DW_AT_decl_line   : 1004
    <8a3>   DW_AT_decl_column : 16
    <8a4>   DW_AT_type        : <0x902>
    <8a8>   DW_AT_data_member_location: 68
 <2><8a9>: Abbrev Number: 18 (DW_TAG_member)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x6d3fd): xDummy17
    <8ae>   DW_AT_decl_file   : 9
    <8af>   DW_AT_decl_line   : 1016
    <8b1>   DW_AT_decl_column : 17
    <8b2>   DW_AT_type        : <0x2bb>
    <8b6>   DW_AT_data_member_location: 76
 <2><8b7>: Abbrev Number: 18 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x139ee): ulDummy18
    <8bc>   DW_AT_decl_file   : 9
    <8bd>   DW_AT_decl_line   : 1019
    <8bf>   DW_AT_decl_column : 14
    <8c0>   DW_AT_type        : <0xb2>
    <8c4>   DW_AT_data_member_location: 172
 <2><8c5>: Abbrev Number: 18 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x29ebd): ucDummy19
    <8ca>   DW_AT_decl_file   : 9
    <8cb>   DW_AT_decl_line   : 1020
    <8cd>   DW_AT_decl_column : 13
    <8ce>   DW_AT_type        : <0x9a>
    <8d2>   DW_AT_data_member_location: 176
 <2><8d3>: Abbrev Number: 18 (DW_TAG_member)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x7b4fa): uxDummy20
    <8d8>   DW_AT_decl_file   : 9
    <8d9>   DW_AT_decl_line   : 1023
    <8db>   DW_AT_decl_column : 13
    <8dc>   DW_AT_type        : <0x9a>
    <8e0>   DW_AT_data_member_location: 177
 <2><8e1>: Abbrev Number: 0
 <1><8e2>: Abbrev Number: 9 (DW_TAG_array_type)
    <8e3>   DW_AT_type        : <0x83a>
    <8e7>   DW_AT_sibling     : <0x8f2>
 <2><8eb>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <8ec>   DW_AT_type        : <0x30>
    <8f0>   DW_AT_upper_bound : 1
 <2><8f1>: Abbrev Number: 0
 <1><8f2>: Abbrev Number: 9 (DW_TAG_array_type)
    <8f3>   DW_AT_type        : <0x9a>
    <8f7>   DW_AT_sibling     : <0x902>
 <2><8fb>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <8fc>   DW_AT_type        : <0x30>
    <900>   DW_AT_upper_bound : 15
 <2><901>: Abbrev Number: 0
 <1><902>: Abbrev Number: 9 (DW_TAG_array_type)
    <903>   DW_AT_type        : <0xcc>
    <907>   DW_AT_sibling     : <0x912>
 <2><90b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <90c>   DW_AT_type        : <0x30>
    <910>   DW_AT_upper_bound : 1
 <2><911>: Abbrev Number: 0
 <1><912>: Abbrev Number: 6 (DW_TAG_typedef)
    <913>   DW_AT_name        : (indirect string, offset: 0x438ee): StaticTask_t
    <917>   DW_AT_decl_file   : 9
    <918>   DW_AT_decl_line   : 1030
    <91a>   DW_AT_decl_column : 3
    <91b>   DW_AT_type        : <0x847>
 <1><91f>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <920>   DW_AT_byte_size   : 4
    <921>   DW_AT_type        : <0xc0>
 <1><925>: Abbrev Number: 24 (DW_TAG_variable)
    <926>   DW_AT_name        : (indirect string, offset: 0x481bb): xIdleTaskTCBBuffer
    <92a>   DW_AT_decl_file   : 1
    <92b>   DW_AT_decl_line   : 59
    <92c>   DW_AT_decl_column : 21
    <92d>   DW_AT_type        : <0x912>
    <931>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><937>: Abbrev Number: 9 (DW_TAG_array_type)
    <938>   DW_AT_type        : <0xc0>
    <93c>   DW_AT_sibling     : <0x947>
 <2><940>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <941>   DW_AT_type        : <0x30>
    <945>   DW_AT_upper_bound : 127
 <2><946>: Abbrev Number: 0
 <1><947>: Abbrev Number: 24 (DW_TAG_variable)
    <948>   DW_AT_name        : (indirect string, offset: 0x332c2): xIdleStack
    <94c>   DW_AT_decl_file   : 1
    <94d>   DW_AT_decl_line   : 60
    <94e>   DW_AT_decl_column : 20
    <94f>   DW_AT_type        : <0x937>
    <953>   DW_AT_location    : 5 byte block: 3 48 1 0 20 	(DW_OP_addr: 20000148)
 <1><959>: Abbrev Number: 25 (DW_TAG_subprogram)
    <95a>   DW_AT_external    : 1
    <95a>   DW_AT_name        : (indirect string, offset: 0x85031): vApplicationGetIdleTaskMemory
    <95e>   DW_AT_decl_file   : 1
    <95f>   DW_AT_decl_line   : 62
    <960>   DW_AT_decl_column : 6
    <961>   DW_AT_prototyped  : 1
    <961>   DW_AT_low_pc      : 0x8000160
    <965>   DW_AT_high_pc     : 0x30
    <969>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <96b>   DW_AT_GNU_all_call_sites: 1
    <96b>   DW_AT_sibling     : <0x99d>
 <2><96f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <970>   DW_AT_name        : (indirect string, offset: 0x481b9): ppxIdleTaskTCBBuffer
    <974>   DW_AT_decl_file   : 1
    <975>   DW_AT_decl_line   : 62
    <976>   DW_AT_decl_column : 52
    <977>   DW_AT_type        : <0x99d>
    <97b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><97e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <97f>   DW_AT_name        : (indirect string, offset: 0x4ebb1): ppxIdleTaskStackBuffer
    <983>   DW_AT_decl_file   : 1
    <984>   DW_AT_decl_line   : 62
    <985>   DW_AT_decl_column : 88
    <986>   DW_AT_type        : <0x9a9>
    <98a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><98d>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <98e>   DW_AT_name        : (indirect string, offset: 0x4ab0f): pulIdleTaskStackSize
    <992>   DW_AT_decl_file   : 1
    <993>   DW_AT_decl_line   : 62
    <994>   DW_AT_decl_column : 122
    <995>   DW_AT_type        : <0x9af>
    <999>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><99c>: Abbrev Number: 0
 <1><99d>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <99e>   DW_AT_byte_size   : 4
    <99f>   DW_AT_type        : <0x9a3>
 <1><9a3>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9a4>   DW_AT_byte_size   : 4
    <9a5>   DW_AT_type        : <0x912>
 <1><9a9>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9aa>   DW_AT_byte_size   : 4
    <9ab>   DW_AT_type        : <0x91f>
 <1><9af>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9b0>   DW_AT_byte_size   : 4
    <9b1>   DW_AT_type        : <0xb2>
 <1><9b5>: Abbrev Number: 0
  Compilation Unit @ offset 0x9b6:
   Length:        0x1b79 (32-bit)
   Version:       4
   Abbrev Offset: 0x169
   Pointer Size:  4
 <0><9c1>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <9c2>   DW_AT_producer    : (indirect string, offset: 0x45352): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <9c6>   DW_AT_language    : 12	(ANSI C99)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x8d5b1): ../Core/Src/main.c
    <9cb>   DW_AT_comp_dir    : (indirect string, offset: 0x7c3cc): D:/STM32/STM32_CUBEIDE/_RTOS/_INTERRUPT/Debug
    <9cf>   DW_AT_ranges      : 0x10
    <9d3>   DW_AT_low_pc      : 0x0
    <9d7>   DW_AT_stmt_list   : 0x89a
    <9db>   DW_AT_GNU_macros  : 0x16737
 <1><9df>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <9e0>   DW_AT_encoding    : 5	(signed)
    <9e1>   DW_AT_byte_size   : 1
    <9e2>   DW_AT_type        : <0xb26>
    <9e6>   DW_AT_decl_file   : 3
    <9e7>   DW_AT_decl_line   : 69
    <9e8>   DW_AT_decl_column : 1
    <9e9>   DW_AT_sibling     : <0xb26>
 <2><9ed>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x89376): NonMaskableInt_IRQn
    <9f2>   DW_AT_const_value : -14
 <2><9f3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x890cc): HardFault_IRQn
    <9f8>   DW_AT_const_value : -13
 <2><9f9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9fa>   DW_AT_name        : (indirect string, offset: 0x8b18b): MemoryManagement_IRQn
    <9fe>   DW_AT_const_value : -12
 <2><9ff>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a00>   DW_AT_name        : (indirect string, offset: 0x8ca91): BusFault_IRQn
    <a04>   DW_AT_const_value : -11
 <2><a05>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a06>   DW_AT_name        : (indirect string, offset: 0x8c021): UsageFault_IRQn
    <a0a>   DW_AT_const_value : -10
 <2><a0b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x88a13): SVCall_IRQn
    <a10>   DW_AT_const_value : -5
 <2><a11>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a12>   DW_AT_name        : (indirect string, offset: 0x8b1a1): DebugMonitor_IRQn
    <a16>   DW_AT_const_value : -4
 <2><a17>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a18>   DW_AT_name        : (indirect string, offset: 0x8b737): PendSV_IRQn
    <a1c>   DW_AT_const_value : -2
 <2><a1d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a1e>   DW_AT_name        : (indirect string, offset: 0x8cd48): SysTick_IRQn
    <a22>   DW_AT_const_value : -1
 <2><a23>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a24>   DW_AT_name        : (indirect string, offset: 0x8c13d): WWDG_IRQn
    <a28>   DW_AT_const_value : 0
 <2><a29>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a2a>   DW_AT_name        : (indirect string, offset: 0x8933f): PVD_IRQn
    <a2e>   DW_AT_const_value : 1
 <2><a2f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a30>   DW_AT_name        : (indirect string, offset: 0x8a49b): TAMPER_IRQn
    <a34>   DW_AT_const_value : 2
 <2><a35>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a36>   DW_AT_name        : (indirect string, offset: 0x8b1d2): RTC_IRQn
    <a3a>   DW_AT_const_value : 3
 <2><a3b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0x89a4f): FLASH_IRQn
    <a40>   DW_AT_const_value : 4
 <2><a41>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a42>   DW_AT_name        : (indirect string, offset: 0x8ca3a): RCC_IRQn
    <a46>   DW_AT_const_value : 5
 <2><a47>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a48>   DW_AT_name        : (indirect string, offset: 0x8b1b3): EXTI0_IRQn
    <a4c>   DW_AT_const_value : 6
 <2><a4d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a4e>   DW_AT_name        : (indirect string, offset: 0x8daa4): EXTI1_IRQn
    <a52>   DW_AT_const_value : 7
 <2><a53>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a54>   DW_AT_name        : (indirect string, offset: 0x8a9d2): EXTI2_IRQn
    <a58>   DW_AT_const_value : 8
 <2><a59>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a5a>   DW_AT_name        : (indirect string, offset: 0x8cdeb): EXTI3_IRQn
    <a5e>   DW_AT_const_value : 9
 <2><a5f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a60>   DW_AT_name        : (indirect string, offset: 0x892b9): EXTI4_IRQn
    <a64>   DW_AT_const_value : 10
 <2><a65>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0x89d4a): DMA1_Channel1_IRQn
    <a6a>   DW_AT_const_value : 11
 <2><a6b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x8c447): DMA1_Channel2_IRQn
    <a70>   DW_AT_const_value : 12
 <2><a71>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0x891f8): DMA1_Channel3_IRQn
    <a76>   DW_AT_const_value : 13
 <2><a77>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0x8b971): DMA1_Channel4_IRQn
    <a7c>   DW_AT_const_value : 14
 <2><a7d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x88b18): DMA1_Channel5_IRQn
    <a82>   DW_AT_const_value : 15
 <2><a83>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x8ad2c): DMA1_Channel6_IRQn
    <a88>   DW_AT_const_value : 16
 <2><a89>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x8d5c4): DMA1_Channel7_IRQn
    <a8e>   DW_AT_const_value : 17
 <2><a8f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a90>   DW_AT_name        : (indirect string, offset: 0x48798): ADC1_2_IRQn
    <a94>   DW_AT_const_value : 18
 <2><a95>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a96>   DW_AT_name        : (indirect string, offset: 0x3c6e5): USB_HP_CAN1_TX_IRQn
    <a9a>   DW_AT_const_value : 19
 <2><a9b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x8333b): USB_LP_CAN1_RX0_IRQn
    <aa0>   DW_AT_const_value : 20
 <2><aa1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aa2>   DW_AT_name        : (indirect string, offset: 0x8c03f): CAN1_RX1_IRQn
    <aa6>   DW_AT_const_value : 21
 <2><aa7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x8c031): CAN1_SCE_IRQn
    <aac>   DW_AT_const_value : 22
 <2><aad>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aae>   DW_AT_name        : (indirect string, offset: 0x8d5d7): EXTI9_5_IRQn
    <ab2>   DW_AT_const_value : 23
 <2><ab3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x25c71): TIM1_BRK_IRQn
    <ab8>   DW_AT_const_value : 24
 <2><ab9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aba>   DW_AT_name        : (indirect string, offset: 0x50ced): TIM1_UP_IRQn
    <abe>   DW_AT_const_value : 25
 <2><abf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ac0>   DW_AT_name        : (indirect string, offset: 0x2bd89): TIM1_TRG_COM_IRQn
    <ac4>   DW_AT_const_value : 26
 <2><ac5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x8c8b9): TIM1_CC_IRQn
    <aca>   DW_AT_const_value : 27
 <2><acb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <acc>   DW_AT_name        : (indirect string, offset: 0x89145): TIM2_IRQn
    <ad0>   DW_AT_const_value : 28
 <2><ad1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x8b95e): TIM3_IRQn
    <ad6>   DW_AT_const_value : 29
 <2><ad7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ad8>   DW_AT_name        : (indirect string, offset: 0x8a491): TIM4_IRQn
    <adc>   DW_AT_const_value : 30
 <2><add>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ade>   DW_AT_name        : (indirect string, offset: 0x8a4ae): I2C1_EV_IRQn
    <ae2>   DW_AT_const_value : 31
 <2><ae3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x8bda8): I2C1_ER_IRQn
    <ae8>   DW_AT_const_value : 32
 <2><ae9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aea>   DW_AT_name        : (indirect string, offset: 0x89125): I2C2_EV_IRQn
    <aee>   DW_AT_const_value : 33
 <2><aef>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af0>   DW_AT_name        : (indirect string, offset: 0x8a971): I2C2_ER_IRQn
    <af4>   DW_AT_const_value : 34
 <2><af5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af6>   DW_AT_name        : (indirect string, offset: 0x89132): SPI1_IRQn
    <afa>   DW_AT_const_value : 35
 <2><afb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <afc>   DW_AT_name        : (indirect string, offset: 0x8b8e0): SPI2_IRQn
    <b00>   DW_AT_const_value : 36
 <2><b01>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b02>   DW_AT_name        : (indirect string, offset: 0x8cb24): USART1_IRQn
    <b06>   DW_AT_const_value : 37
 <2><b07>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b08>   DW_AT_name        : (indirect string, offset: 0x89be0): USART2_IRQn
    <b0c>   DW_AT_const_value : 38
 <2><b0d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x8c180): USART3_IRQn
    <b12>   DW_AT_const_value : 39
 <2><b13>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b14>   DW_AT_name        : (indirect string, offset: 0x6ceb4): EXTI15_10_IRQn
    <b18>   DW_AT_const_value : 40
 <2><b19>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x8d03a): RTC_Alarm_IRQn
    <b1e>   DW_AT_const_value : 41
 <2><b1f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b20>   DW_AT_name        : (indirect string, offset: 0x83aa8): USBWakeUp_IRQn
    <b24>   DW_AT_const_value : 42
 <2><b25>: Abbrev Number: 0
 <1><b26>: Abbrev Number: 5 (DW_TAG_base_type)
    <b27>   DW_AT_byte_size   : 1
    <b28>   DW_AT_encoding    : 6	(signed char)
    <b29>   DW_AT_name        : (indirect string, offset: 0x4474f): signed char
 <1><b2d>: Abbrev Number: 6 (DW_TAG_typedef)
    <b2e>   DW_AT_name        : (indirect string, offset: 0x8d369): IRQn_Type
    <b32>   DW_AT_decl_file   : 3
    <b33>   DW_AT_decl_line   : 125
    <b34>   DW_AT_decl_column : 3
    <b35>   DW_AT_type        : <0x9df>
 <1><b39>: Abbrev Number: 6 (DW_TAG_typedef)
    <b3a>   DW_AT_name        : (indirect string, offset: 0x27f11): __uint8_t
    <b3e>   DW_AT_decl_file   : 4
    <b3f>   DW_AT_decl_line   : 43
    <b40>   DW_AT_decl_column : 24
    <b41>   DW_AT_type        : <0xb45>
 <1><b45>: Abbrev Number: 5 (DW_TAG_base_type)
    <b46>   DW_AT_byte_size   : 1
    <b47>   DW_AT_encoding    : 8	(unsigned char)
    <b48>   DW_AT_name        : (indirect string, offset: 0x1bc27): unsigned char
 <1><b4c>: Abbrev Number: 5 (DW_TAG_base_type)
    <b4d>   DW_AT_byte_size   : 2
    <b4e>   DW_AT_encoding    : 5	(signed)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x65ffe): short int
 <1><b53>: Abbrev Number: 6 (DW_TAG_typedef)
    <b54>   DW_AT_name        : (indirect string, offset: 0x6fea4): __uint16_t
    <b58>   DW_AT_decl_file   : 4
    <b59>   DW_AT_decl_line   : 57
    <b5a>   DW_AT_decl_column : 25
    <b5b>   DW_AT_type        : <0xb5f>
 <1><b5f>: Abbrev Number: 5 (DW_TAG_base_type)
    <b60>   DW_AT_byte_size   : 2
    <b61>   DW_AT_encoding    : 7	(unsigned)
    <b62>   DW_AT_name        : (indirect string, offset: 0x2c95a): short unsigned int
 <1><b66>: Abbrev Number: 5 (DW_TAG_base_type)
    <b67>   DW_AT_byte_size   : 4
    <b68>   DW_AT_encoding    : 5	(signed)
    <b69>   DW_AT_name        : (indirect string, offset: 0xbd4d): long int
 <1><b6d>: Abbrev Number: 6 (DW_TAG_typedef)
    <b6e>   DW_AT_name        : (indirect string, offset: 0x56d85): __uint32_t
    <b72>   DW_AT_decl_file   : 4
    <b73>   DW_AT_decl_line   : 79
    <b74>   DW_AT_decl_column : 25
    <b75>   DW_AT_type        : <0xb79>
 <1><b79>: Abbrev Number: 5 (DW_TAG_base_type)
    <b7a>   DW_AT_byte_size   : 4
    <b7b>   DW_AT_encoding    : 7	(unsigned)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x202d6): long unsigned int
 <1><b80>: Abbrev Number: 5 (DW_TAG_base_type)
    <b81>   DW_AT_byte_size   : 8
    <b82>   DW_AT_encoding    : 5	(signed)
    <b83>   DW_AT_name        : (indirect string, offset: 0x3eb99): long long int
 <1><b87>: Abbrev Number: 5 (DW_TAG_base_type)
    <b88>   DW_AT_byte_size   : 8
    <b89>   DW_AT_encoding    : 7	(unsigned)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x1c45b): long long unsigned int
 <1><b8e>: Abbrev Number: 7 (DW_TAG_base_type)
    <b8f>   DW_AT_byte_size   : 4
    <b90>   DW_AT_encoding    : 5	(signed)
    <b91>   DW_AT_name        : int
 <1><b95>: Abbrev Number: 5 (DW_TAG_base_type)
    <b96>   DW_AT_byte_size   : 4
    <b97>   DW_AT_encoding    : 7	(unsigned)
    <b98>   DW_AT_name        : (indirect string, offset: 0xb6f4): unsigned int
 <1><b9c>: Abbrev Number: 6 (DW_TAG_typedef)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x27f13): uint8_t
    <ba1>   DW_AT_decl_file   : 5
    <ba2>   DW_AT_decl_line   : 24
    <ba3>   DW_AT_decl_column : 19
    <ba4>   DW_AT_type        : <0xb39>
 <1><ba8>: Abbrev Number: 8 (DW_TAG_const_type)
    <ba9>   DW_AT_type        : <0xb9c>
 <1><bad>: Abbrev Number: 6 (DW_TAG_typedef)
    <bae>   DW_AT_name        : (indirect string, offset: 0x63e80): uint16_t
    <bb2>   DW_AT_decl_file   : 5
    <bb3>   DW_AT_decl_line   : 36
    <bb4>   DW_AT_decl_column : 20
    <bb5>   DW_AT_type        : <0xb53>
 <1><bb9>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <bba>   DW_AT_type        : <0xbad>
 <1><bbe>: Abbrev Number: 8 (DW_TAG_const_type)
    <bbf>   DW_AT_type        : <0xbad>
 <1><bc3>: Abbrev Number: 6 (DW_TAG_typedef)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x63817): uint32_t
    <bc8>   DW_AT_decl_file   : 5
    <bc9>   DW_AT_decl_line   : 48
    <bca>   DW_AT_decl_column : 20
    <bcb>   DW_AT_type        : <0xb6d>
 <1><bcf>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <bd0>   DW_AT_type        : <0xbc3>
 <1><bd4>: Abbrev Number: 10 (DW_TAG_structure_type)
    <bd5>   DW_AT_byte_size   : 16
    <bd6>   DW_AT_decl_file   : 3
    <bd7>   DW_AT_decl_line   : 290
    <bd9>   DW_AT_decl_column : 9
    <bda>   DW_AT_sibling     : <0xc17>
 <2><bde>: Abbrev Number: 11 (DW_TAG_member)
    <bdf>   DW_AT_name        : CCR
    <be3>   DW_AT_decl_file   : 3
    <be4>   DW_AT_decl_line   : 292
    <be6>   DW_AT_decl_column : 17
    <be7>   DW_AT_type        : <0xbcf>
    <beb>   DW_AT_data_member_location: 0
 <2><bec>: Abbrev Number: 12 (DW_TAG_member)
    <bed>   DW_AT_name        : (indirect string, offset: 0x8a8df): CNDTR
    <bf1>   DW_AT_decl_file   : 3
    <bf2>   DW_AT_decl_line   : 293
    <bf4>   DW_AT_decl_column : 17
    <bf5>   DW_AT_type        : <0xbcf>
    <bf9>   DW_AT_data_member_location: 4
 <2><bfa>: Abbrev Number: 12 (DW_TAG_member)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x8db79): CPAR
    <bff>   DW_AT_decl_file   : 3
    <c00>   DW_AT_decl_line   : 294
    <c02>   DW_AT_decl_column : 17
    <c03>   DW_AT_type        : <0xbcf>
    <c07>   DW_AT_data_member_location: 8
 <2><c08>: Abbrev Number: 12 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0x8b831): CMAR
    <c0d>   DW_AT_decl_file   : 3
    <c0e>   DW_AT_decl_line   : 295
    <c10>   DW_AT_decl_column : 17
    <c11>   DW_AT_type        : <0xbcf>
    <c15>   DW_AT_data_member_location: 12
 <2><c16>: Abbrev Number: 0
 <1><c17>: Abbrev Number: 13 (DW_TAG_typedef)
    <c18>   DW_AT_name        : (indirect string, offset: 0x8cdf6): DMA_Channel_TypeDef
    <c1c>   DW_AT_decl_file   : 3
    <c1d>   DW_AT_decl_line   : 296
    <c1f>   DW_AT_decl_column : 3
    <c20>   DW_AT_type        : <0xbd4>
 <1><c24>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c25>   DW_AT_byte_size   : 8
    <c26>   DW_AT_decl_file   : 3
    <c27>   DW_AT_decl_line   : 298
    <c29>   DW_AT_decl_column : 9
    <c2a>   DW_AT_sibling     : <0xc4b>
 <2><c2e>: Abbrev Number: 11 (DW_TAG_member)
    <c2f>   DW_AT_name        : ISR
    <c33>   DW_AT_decl_file   : 3
    <c34>   DW_AT_decl_line   : 300
    <c36>   DW_AT_decl_column : 17
    <c37>   DW_AT_type        : <0xbcf>
    <c3b>   DW_AT_data_member_location: 0
 <2><c3c>: Abbrev Number: 12 (DW_TAG_member)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x8c3e1): IFCR
    <c41>   DW_AT_decl_file   : 3
    <c42>   DW_AT_decl_line   : 301
    <c44>   DW_AT_decl_column : 17
    <c45>   DW_AT_type        : <0xbcf>
    <c49>   DW_AT_data_member_location: 4
 <2><c4a>: Abbrev Number: 0
 <1><c4b>: Abbrev Number: 13 (DW_TAG_typedef)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x8a5f9): DMA_TypeDef
    <c50>   DW_AT_decl_file   : 3
    <c51>   DW_AT_decl_line   : 302
    <c53>   DW_AT_decl_column : 3
    <c54>   DW_AT_type        : <0xc24>
 <1><c58>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c59>   DW_AT_byte_size   : 28
    <c5a>   DW_AT_decl_file   : 3
    <c5b>   DW_AT_decl_line   : 357
    <c5d>   DW_AT_decl_column : 9
    <c5e>   DW_AT_sibling     : <0xcc5>
 <2><c62>: Abbrev Number: 11 (DW_TAG_member)
    <c63>   DW_AT_name        : CRL
    <c67>   DW_AT_decl_file   : 3
    <c68>   DW_AT_decl_line   : 359
    <c6a>   DW_AT_decl_column : 17
    <c6b>   DW_AT_type        : <0xbcf>
    <c6f>   DW_AT_data_member_location: 0
 <2><c70>: Abbrev Number: 11 (DW_TAG_member)
    <c71>   DW_AT_name        : CRH
    <c75>   DW_AT_decl_file   : 3
    <c76>   DW_AT_decl_line   : 360
    <c78>   DW_AT_decl_column : 17
    <c79>   DW_AT_type        : <0xbcf>
    <c7d>   DW_AT_data_member_location: 4
 <2><c7e>: Abbrev Number: 11 (DW_TAG_member)
    <c7f>   DW_AT_name        : IDR
    <c83>   DW_AT_decl_file   : 3
    <c84>   DW_AT_decl_line   : 361
    <c86>   DW_AT_decl_column : 17
    <c87>   DW_AT_type        : <0xbcf>
    <c8b>   DW_AT_data_member_location: 8
 <2><c8c>: Abbrev Number: 11 (DW_TAG_member)
    <c8d>   DW_AT_name        : ODR
    <c91>   DW_AT_decl_file   : 3
    <c92>   DW_AT_decl_line   : 362
    <c94>   DW_AT_decl_column : 17
    <c95>   DW_AT_type        : <0xbcf>
    <c99>   DW_AT_data_member_location: 12
 <2><c9a>: Abbrev Number: 12 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x89b51): BSRR
    <c9f>   DW_AT_decl_file   : 3
    <ca0>   DW_AT_decl_line   : 363
    <ca2>   DW_AT_decl_column : 17
    <ca3>   DW_AT_type        : <0xbcf>
    <ca7>   DW_AT_data_member_location: 16
 <2><ca8>: Abbrev Number: 11 (DW_TAG_member)
    <ca9>   DW_AT_name        : BRR
    <cad>   DW_AT_decl_file   : 3
    <cae>   DW_AT_decl_line   : 364
    <cb0>   DW_AT_decl_column : 17
    <cb1>   DW_AT_type        : <0xbcf>
    <cb5>   DW_AT_data_member_location: 20
 <2><cb6>: Abbrev Number: 12 (DW_TAG_member)
    <cb7>   DW_AT_name        : (indirect string, offset: 0x8d1ef): LCKR
    <cbb>   DW_AT_decl_file   : 3
    <cbc>   DW_AT_decl_line   : 365
    <cbe>   DW_AT_decl_column : 17
    <cbf>   DW_AT_type        : <0xbcf>
    <cc3>   DW_AT_data_member_location: 24
 <2><cc4>: Abbrev Number: 0
 <1><cc5>: Abbrev Number: 13 (DW_TAG_typedef)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x8db97): GPIO_TypeDef
    <cca>   DW_AT_decl_file   : 3
    <ccb>   DW_AT_decl_line   : 366
    <ccd>   DW_AT_decl_column : 3
    <cce>   DW_AT_type        : <0xc58>
 <1><cd2>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cd3>   DW_AT_byte_size   : 40
    <cd4>   DW_AT_decl_file   : 3
    <cd5>   DW_AT_decl_line   : 423
    <cd7>   DW_AT_decl_column : 9
    <cd8>   DW_AT_sibling     : <0xd68>
 <2><cdc>: Abbrev Number: 11 (DW_TAG_member)
    <cdd>   DW_AT_name        : CR
    <ce0>   DW_AT_decl_file   : 3
    <ce1>   DW_AT_decl_line   : 425
    <ce3>   DW_AT_decl_column : 17
    <ce4>   DW_AT_type        : <0xbcf>
    <ce8>   DW_AT_data_member_location: 0
 <2><ce9>: Abbrev Number: 12 (DW_TAG_member)
    <cea>   DW_AT_name        : (indirect string, offset: 0x8bba7): CFGR
    <cee>   DW_AT_decl_file   : 3
    <cef>   DW_AT_decl_line   : 426
    <cf1>   DW_AT_decl_column : 17
    <cf2>   DW_AT_type        : <0xbcf>
    <cf6>   DW_AT_data_member_location: 4
 <2><cf7>: Abbrev Number: 11 (DW_TAG_member)
    <cf8>   DW_AT_name        : CIR
    <cfc>   DW_AT_decl_file   : 3
    <cfd>   DW_AT_decl_line   : 427
    <cff>   DW_AT_decl_column : 17
    <d00>   DW_AT_type        : <0xbcf>
    <d04>   DW_AT_data_member_location: 8
 <2><d05>: Abbrev Number: 12 (DW_TAG_member)
    <d06>   DW_AT_name        : (indirect string, offset: 0x8ad23): APB2RSTR
    <d0a>   DW_AT_decl_file   : 3
    <d0b>   DW_AT_decl_line   : 428
    <d0d>   DW_AT_decl_column : 17
    <d0e>   DW_AT_type        : <0xbcf>
    <d12>   DW_AT_data_member_location: 12
 <2><d13>: Abbrev Number: 12 (DW_TAG_member)
    <d14>   DW_AT_name        : (indirect string, offset: 0x8913c): APB1RSTR
    <d18>   DW_AT_decl_file   : 3
    <d19>   DW_AT_decl_line   : 429
    <d1b>   DW_AT_decl_column : 17
    <d1c>   DW_AT_type        : <0xbcf>
    <d20>   DW_AT_data_member_location: 16
 <2><d21>: Abbrev Number: 12 (DW_TAG_member)
    <d22>   DW_AT_name        : (indirect string, offset: 0x88fb6): AHBENR
    <d26>   DW_AT_decl_file   : 3
    <d27>   DW_AT_decl_line   : 430
    <d29>   DW_AT_decl_column : 17
    <d2a>   DW_AT_type        : <0xbcf>
    <d2e>   DW_AT_data_member_location: 20
 <2><d2f>: Abbrev Number: 12 (DW_TAG_member)
    <d30>   DW_AT_name        : (indirect string, offset: 0x891f0): APB2ENR
    <d34>   DW_AT_decl_file   : 3
    <d35>   DW_AT_decl_line   : 431
    <d37>   DW_AT_decl_column : 17
    <d38>   DW_AT_type        : <0xbcf>
    <d3c>   DW_AT_data_member_location: 24
 <2><d3d>: Abbrev Number: 12 (DW_TAG_member)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x8c7ae): APB1ENR
    <d42>   DW_AT_decl_file   : 3
    <d43>   DW_AT_decl_line   : 432
    <d45>   DW_AT_decl_column : 17
    <d46>   DW_AT_type        : <0xbcf>
    <d4a>   DW_AT_data_member_location: 28
 <2><d4b>: Abbrev Number: 12 (DW_TAG_member)
    <d4c>   DW_AT_name        : (indirect string, offset: 0x892c4): BDCR
    <d50>   DW_AT_decl_file   : 3
    <d51>   DW_AT_decl_line   : 433
    <d53>   DW_AT_decl_column : 17
    <d54>   DW_AT_type        : <0xbcf>
    <d58>   DW_AT_data_member_location: 32
 <2><d59>: Abbrev Number: 11 (DW_TAG_member)
    <d5a>   DW_AT_name        : CSR
    <d5e>   DW_AT_decl_file   : 3
    <d5f>   DW_AT_decl_line   : 434
    <d61>   DW_AT_decl_column : 17
    <d62>   DW_AT_type        : <0xbcf>
    <d66>   DW_AT_data_member_location: 36
 <2><d67>: Abbrev Number: 0
 <1><d68>: Abbrev Number: 13 (DW_TAG_typedef)
    <d69>   DW_AT_name        : (indirect string, offset: 0x8ae19): RCC_TypeDef
    <d6d>   DW_AT_decl_file   : 3
    <d6e>   DW_AT_decl_line   : 437
    <d70>   DW_AT_decl_column : 3
    <d71>   DW_AT_type        : <0xcd2>
 <1><d75>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d76>   DW_AT_byte_size   : 84
    <d77>   DW_AT_decl_file   : 3
    <d78>   DW_AT_decl_line   : 476
    <d7a>   DW_AT_decl_column : 9
    <d7b>   DW_AT_sibling     : <0xea4>
 <2><d7f>: Abbrev Number: 11 (DW_TAG_member)
    <d80>   DW_AT_name        : CR1
    <d84>   DW_AT_decl_file   : 3
    <d85>   DW_AT_decl_line   : 478
    <d87>   DW_AT_decl_column : 17
    <d88>   DW_AT_type        : <0xbcf>
    <d8c>   DW_AT_data_member_location: 0
 <2><d8d>: Abbrev Number: 11 (DW_TAG_member)
    <d8e>   DW_AT_name        : CR2
    <d92>   DW_AT_decl_file   : 3
    <d93>   DW_AT_decl_line   : 479
    <d95>   DW_AT_decl_column : 17
    <d96>   DW_AT_type        : <0xbcf>
    <d9a>   DW_AT_data_member_location: 4
 <2><d9b>: Abbrev Number: 12 (DW_TAG_member)
    <d9c>   DW_AT_name        : (indirect string, offset: 0x6282c): SMCR
    <da0>   DW_AT_decl_file   : 3
    <da1>   DW_AT_decl_line   : 480
    <da3>   DW_AT_decl_column : 17
    <da4>   DW_AT_type        : <0xbcf>
    <da8>   DW_AT_data_member_location: 8
 <2><da9>: Abbrev Number: 12 (DW_TAG_member)
    <daa>   DW_AT_name        : (indirect string, offset: 0x2b86f): DIER
    <dae>   DW_AT_decl_file   : 3
    <daf>   DW_AT_decl_line   : 481
    <db1>   DW_AT_decl_column : 17
    <db2>   DW_AT_type        : <0xbcf>
    <db6>   DW_AT_data_member_location: 12
 <2><db7>: Abbrev Number: 11 (DW_TAG_member)
    <db8>   DW_AT_name        : SR
    <dbb>   DW_AT_decl_file   : 3
    <dbc>   DW_AT_decl_line   : 482
    <dbe>   DW_AT_decl_column : 17
    <dbf>   DW_AT_type        : <0xbcf>
    <dc3>   DW_AT_data_member_location: 16
 <2><dc4>: Abbrev Number: 11 (DW_TAG_member)
    <dc5>   DW_AT_name        : EGR
    <dc9>   DW_AT_decl_file   : 3
    <dca>   DW_AT_decl_line   : 483
    <dcc>   DW_AT_decl_column : 17
    <dcd>   DW_AT_type        : <0xbcf>
    <dd1>   DW_AT_data_member_location: 20
 <2><dd2>: Abbrev Number: 12 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x64311): CCMR1
    <dd7>   DW_AT_decl_file   : 3
    <dd8>   DW_AT_decl_line   : 484
    <dda>   DW_AT_decl_column : 17
    <ddb>   DW_AT_type        : <0xbcf>
    <ddf>   DW_AT_data_member_location: 24
 <2><de0>: Abbrev Number: 12 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0x36ae9): CCMR2
    <de5>   DW_AT_decl_file   : 3
    <de6>   DW_AT_decl_line   : 485
    <de8>   DW_AT_decl_column : 17
    <de9>   DW_AT_type        : <0xbcf>
    <ded>   DW_AT_data_member_location: 28
 <2><dee>: Abbrev Number: 12 (DW_TAG_member)
    <def>   DW_AT_name        : (indirect string, offset: 0x18260): CCER
    <df3>   DW_AT_decl_file   : 3
    <df4>   DW_AT_decl_line   : 486
    <df6>   DW_AT_decl_column : 17
    <df7>   DW_AT_type        : <0xbcf>
    <dfb>   DW_AT_data_member_location: 32
 <2><dfc>: Abbrev Number: 11 (DW_TAG_member)
    <dfd>   DW_AT_name        : CNT
    <e01>   DW_AT_decl_file   : 3
    <e02>   DW_AT_decl_line   : 487
    <e04>   DW_AT_decl_column : 17
    <e05>   DW_AT_type        : <0xbcf>
    <e09>   DW_AT_data_member_location: 36
 <2><e0a>: Abbrev Number: 11 (DW_TAG_member)
    <e0b>   DW_AT_name        : PSC
    <e0f>   DW_AT_decl_file   : 3
    <e10>   DW_AT_decl_line   : 488
    <e12>   DW_AT_decl_column : 17
    <e13>   DW_AT_type        : <0xbcf>
    <e17>   DW_AT_data_member_location: 40
 <2><e18>: Abbrev Number: 11 (DW_TAG_member)
    <e19>   DW_AT_name        : ARR
    <e1d>   DW_AT_decl_file   : 3
    <e1e>   DW_AT_decl_line   : 489
    <e20>   DW_AT_decl_column : 17
    <e21>   DW_AT_type        : <0xbcf>
    <e25>   DW_AT_data_member_location: 44
 <2><e26>: Abbrev Number: 11 (DW_TAG_member)
    <e27>   DW_AT_name        : RCR
    <e2b>   DW_AT_decl_file   : 3
    <e2c>   DW_AT_decl_line   : 490
    <e2e>   DW_AT_decl_column : 17
    <e2f>   DW_AT_type        : <0xbcf>
    <e33>   DW_AT_data_member_location: 48
 <2><e34>: Abbrev Number: 12 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0x10700): CCR1
    <e39>   DW_AT_decl_file   : 3
    <e3a>   DW_AT_decl_line   : 491
    <e3c>   DW_AT_decl_column : 17
    <e3d>   DW_AT_type        : <0xbcf>
    <e41>   DW_AT_data_member_location: 52
 <2><e42>: Abbrev Number: 12 (DW_TAG_member)
    <e43>   DW_AT_name        : (indirect string, offset: 0x39b1e): CCR2
    <e47>   DW_AT_decl_file   : 3
    <e48>   DW_AT_decl_line   : 492
    <e4a>   DW_AT_decl_column : 17
    <e4b>   DW_AT_type        : <0xbcf>
    <e4f>   DW_AT_data_member_location: 56
 <2><e50>: Abbrev Number: 12 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x68e1f): CCR3
    <e55>   DW_AT_decl_file   : 3
    <e56>   DW_AT_decl_line   : 493
    <e58>   DW_AT_decl_column : 17
    <e59>   DW_AT_type        : <0xbcf>
    <e5d>   DW_AT_data_member_location: 60
 <2><e5e>: Abbrev Number: 12 (DW_TAG_member)
    <e5f>   DW_AT_name        : (indirect string, offset: 0x8ab8): CCR4
    <e63>   DW_AT_decl_file   : 3
    <e64>   DW_AT_decl_line   : 494
    <e66>   DW_AT_decl_column : 17
    <e67>   DW_AT_type        : <0xbcf>
    <e6b>   DW_AT_data_member_location: 64
 <2><e6c>: Abbrev Number: 12 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x3f49f): BDTR
    <e71>   DW_AT_decl_file   : 3
    <e72>   DW_AT_decl_line   : 495
    <e74>   DW_AT_decl_column : 17
    <e75>   DW_AT_type        : <0xbcf>
    <e79>   DW_AT_data_member_location: 68
 <2><e7a>: Abbrev Number: 11 (DW_TAG_member)
    <e7b>   DW_AT_name        : DCR
    <e7f>   DW_AT_decl_file   : 3
    <e80>   DW_AT_decl_line   : 496
    <e82>   DW_AT_decl_column : 17
    <e83>   DW_AT_type        : <0xbcf>
    <e87>   DW_AT_data_member_location: 72
 <2><e88>: Abbrev Number: 12 (DW_TAG_member)
    <e89>   DW_AT_name        : (indirect string, offset: 0x759a6): DMAR
    <e8d>   DW_AT_decl_file   : 3
    <e8e>   DW_AT_decl_line   : 497
    <e90>   DW_AT_decl_column : 17
    <e91>   DW_AT_type        : <0xbcf>
    <e95>   DW_AT_data_member_location: 76
 <2><e96>: Abbrev Number: 11 (DW_TAG_member)
    <e97>   DW_AT_name        : OR
    <e9a>   DW_AT_decl_file   : 3
    <e9b>   DW_AT_decl_line   : 498
    <e9d>   DW_AT_decl_column : 17
    <e9e>   DW_AT_type        : <0xbcf>
    <ea2>   DW_AT_data_member_location: 80
 <2><ea3>: Abbrev Number: 0
 <1><ea4>: Abbrev Number: 13 (DW_TAG_typedef)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x88b61): TIM_TypeDef
    <ea9>   DW_AT_decl_file   : 3
    <eaa>   DW_AT_decl_line   : 499
    <eac>   DW_AT_decl_column : 2
    <ead>   DW_AT_type        : <0xd75>
 <1><eb1>: Abbrev Number: 10 (DW_TAG_structure_type)
    <eb2>   DW_AT_byte_size   : 28
    <eb3>   DW_AT_decl_file   : 3
    <eb4>   DW_AT_decl_line   : 506
    <eb6>   DW_AT_decl_column : 9
    <eb7>   DW_AT_sibling     : <0xf1c>
 <2><ebb>: Abbrev Number: 11 (DW_TAG_member)
    <ebc>   DW_AT_name        : SR
    <ebf>   DW_AT_decl_file   : 3
    <ec0>   DW_AT_decl_line   : 508
    <ec2>   DW_AT_decl_column : 17
    <ec3>   DW_AT_type        : <0xbcf>
    <ec7>   DW_AT_data_member_location: 0
 <2><ec8>: Abbrev Number: 11 (DW_TAG_member)
    <ec9>   DW_AT_name        : DR
    <ecc>   DW_AT_decl_file   : 3
    <ecd>   DW_AT_decl_line   : 509
    <ecf>   DW_AT_decl_column : 17
    <ed0>   DW_AT_type        : <0xbcf>
    <ed4>   DW_AT_data_member_location: 4
 <2><ed5>: Abbrev Number: 11 (DW_TAG_member)
    <ed6>   DW_AT_name        : BRR
    <eda>   DW_AT_decl_file   : 3
    <edb>   DW_AT_decl_line   : 510
    <edd>   DW_AT_decl_column : 17
    <ede>   DW_AT_type        : <0xbcf>
    <ee2>   DW_AT_data_member_location: 8
 <2><ee3>: Abbrev Number: 11 (DW_TAG_member)
    <ee4>   DW_AT_name        : CR1
    <ee8>   DW_AT_decl_file   : 3
    <ee9>   DW_AT_decl_line   : 511
    <eeb>   DW_AT_decl_column : 17
    <eec>   DW_AT_type        : <0xbcf>
    <ef0>   DW_AT_data_member_location: 12
 <2><ef1>: Abbrev Number: 11 (DW_TAG_member)
    <ef2>   DW_AT_name        : CR2
    <ef6>   DW_AT_decl_file   : 3
    <ef7>   DW_AT_decl_line   : 512
    <ef9>   DW_AT_decl_column : 17
    <efa>   DW_AT_type        : <0xbcf>
    <efe>   DW_AT_data_member_location: 16
 <2><eff>: Abbrev Number: 11 (DW_TAG_member)
    <f00>   DW_AT_name        : CR3
    <f04>   DW_AT_decl_file   : 3
    <f05>   DW_AT_decl_line   : 513
    <f07>   DW_AT_decl_column : 17
    <f08>   DW_AT_type        : <0xbcf>
    <f0c>   DW_AT_data_member_location: 20
 <2><f0d>: Abbrev Number: 12 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0x89f50): GTPR
    <f12>   DW_AT_decl_file   : 3
    <f13>   DW_AT_decl_line   : 514
    <f15>   DW_AT_decl_column : 17
    <f16>   DW_AT_type        : <0xbcf>
    <f1a>   DW_AT_data_member_location: 24
 <2><f1b>: Abbrev Number: 0
 <1><f1c>: Abbrev Number: 13 (DW_TAG_typedef)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x8dd77): USART_TypeDef
    <f21>   DW_AT_decl_file   : 3
    <f22>   DW_AT_decl_line   : 515
    <f24>   DW_AT_decl_column : 3
    <f25>   DW_AT_type        : <0xeb1>
 <1><f29>: Abbrev Number: 6 (DW_TAG_typedef)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x1044c): size_t
    <f2e>   DW_AT_decl_file   : 6
    <f2f>   DW_AT_decl_line   : 209
    <f30>   DW_AT_decl_column : 23
    <f31>   DW_AT_type        : <0xb95>
 <1><f35>: Abbrev Number: 5 (DW_TAG_base_type)
    <f36>   DW_AT_byte_size   : 8
    <f37>   DW_AT_encoding    : 4	(float)
    <f38>   DW_AT_name        : (indirect string, offset: 0xcfc2): long double
 <1><f3c>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f3d>   DW_AT_encoding    : 7	(unsigned)
    <f3e>   DW_AT_byte_size   : 1
    <f3f>   DW_AT_type        : <0xb45>
    <f43>   DW_AT_decl_file   : 7
    <f44>   DW_AT_decl_line   : 39
    <f45>   DW_AT_decl_column : 1
    <f46>   DW_AT_sibling     : <0xf63>
 <2><f4a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x8a4a7): HAL_OK
    <f4f>   DW_AT_const_value : 0
 <2><f50>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f51>   DW_AT_name        : (indirect string, offset: 0x8be81): HAL_ERROR
    <f55>   DW_AT_const_value : 1
 <2><f56>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f57>   DW_AT_name        : (indirect string, offset: 0x894c0): HAL_BUSY
    <f5b>   DW_AT_const_value : 2
 <2><f5c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x8a0ca): HAL_TIMEOUT
    <f61>   DW_AT_const_value : 3
 <2><f62>: Abbrev Number: 0
 <1><f63>: Abbrev Number: 6 (DW_TAG_typedef)
    <f64>   DW_AT_name        : (indirect string, offset: 0x88a1f): HAL_StatusTypeDef
    <f68>   DW_AT_decl_file   : 7
    <f69>   DW_AT_decl_line   : 44
    <f6a>   DW_AT_decl_column : 3
    <f6b>   DW_AT_type        : <0xf3c>
 <1><f6f>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f70>   DW_AT_encoding    : 7	(unsigned)
    <f71>   DW_AT_byte_size   : 1
    <f72>   DW_AT_type        : <0xb45>
    <f76>   DW_AT_decl_file   : 7
    <f77>   DW_AT_decl_line   : 50
    <f78>   DW_AT_decl_column : 1
    <f79>   DW_AT_sibling     : <0xf8a>
 <2><f7d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x8c56f): HAL_UNLOCKED
    <f82>   DW_AT_const_value : 0
 <2><f83>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f84>   DW_AT_name        : (indirect string, offset: 0x8ddbe): HAL_LOCKED
    <f88>   DW_AT_const_value : 1
 <2><f89>: Abbrev Number: 0
 <1><f8a>: Abbrev Number: 6 (DW_TAG_typedef)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x8bb14): HAL_LockTypeDef
    <f8f>   DW_AT_decl_file   : 7
    <f90>   DW_AT_decl_line   : 53
    <f91>   DW_AT_decl_column : 3
    <f92>   DW_AT_type        : <0xf6f>
 <1><f96>: Abbrev Number: 14 (DW_TAG_structure_type)
    <f97>   DW_AT_byte_size   : 12
    <f98>   DW_AT_decl_file   : 8
    <f99>   DW_AT_decl_line   : 47
    <f9a>   DW_AT_decl_column : 9
    <f9b>   DW_AT_sibling     : <0xfc7>
 <2><f9f>: Abbrev Number: 15 (DW_TAG_member)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x8c085): PLLState
    <fa4>   DW_AT_decl_file   : 8
    <fa5>   DW_AT_decl_line   : 49
    <fa6>   DW_AT_decl_column : 12
    <fa7>   DW_AT_type        : <0xbc3>
    <fab>   DW_AT_data_member_location: 0
 <2><fac>: Abbrev Number: 15 (DW_TAG_member)
    <fad>   DW_AT_name        : (indirect string, offset: 0x8c133): PLLSource
    <fb1>   DW_AT_decl_file   : 8
    <fb2>   DW_AT_decl_line   : 52
    <fb3>   DW_AT_decl_column : 12
    <fb4>   DW_AT_type        : <0xbc3>
    <fb8>   DW_AT_data_member_location: 4
 <2><fb9>: Abbrev Number: 15 (DW_TAG_member)
    <fba>   DW_AT_name        : (indirect string, offset: 0x8d69d): PLLMUL
    <fbe>   DW_AT_decl_file   : 8
    <fbf>   DW_AT_decl_line   : 55
    <fc0>   DW_AT_decl_column : 12
    <fc1>   DW_AT_type        : <0xbc3>
    <fc5>   DW_AT_data_member_location: 8
 <2><fc6>: Abbrev Number: 0
 <1><fc7>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc8>   DW_AT_name        : (indirect string, offset: 0x8bb94): RCC_PLLInitTypeDef
    <fcc>   DW_AT_decl_file   : 8
    <fcd>   DW_AT_decl_line   : 57
    <fce>   DW_AT_decl_column : 3
    <fcf>   DW_AT_type        : <0xf96>
 <1><fd3>: Abbrev Number: 14 (DW_TAG_structure_type)
    <fd4>   DW_AT_byte_size   : 20
    <fd5>   DW_AT_decl_file   : 8
    <fd6>   DW_AT_decl_line   : 62
    <fd7>   DW_AT_decl_column : 9
    <fd8>   DW_AT_sibling     : <0x101e>
 <2><fdc>: Abbrev Number: 15 (DW_TAG_member)
    <fdd>   DW_AT_name        : (indirect string, offset: 0x8a15d): ClockType
    <fe1>   DW_AT_decl_file   : 8
    <fe2>   DW_AT_decl_line   : 64
    <fe3>   DW_AT_decl_column : 12
    <fe4>   DW_AT_type        : <0xbc3>
    <fe8>   DW_AT_data_member_location: 0
 <2><fe9>: Abbrev Number: 15 (DW_TAG_member)
    <fea>   DW_AT_name        : (indirect string, offset: 0x8bb87): SYSCLKSource
    <fee>   DW_AT_decl_file   : 8
    <fef>   DW_AT_decl_line   : 67
    <ff0>   DW_AT_decl_column : 12
    <ff1>   DW_AT_type        : <0xbc3>
    <ff5>   DW_AT_data_member_location: 4
 <2><ff6>: Abbrev Number: 15 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x8ce5c): AHBCLKDivider
    <ffb>   DW_AT_decl_file   : 8
    <ffc>   DW_AT_decl_line   : 70
    <ffd>   DW_AT_decl_column : 12
    <ffe>   DW_AT_type        : <0xbc3>
    <1002>   DW_AT_data_member_location: 8
 <2><1003>: Abbrev Number: 15 (DW_TAG_member)
    <1004>   DW_AT_name        : (indirect string, offset: 0x88b81): APB1CLKDivider
    <1008>   DW_AT_decl_file   : 8
    <1009>   DW_AT_decl_line   : 73
    <100a>   DW_AT_decl_column : 12
    <100b>   DW_AT_type        : <0xbc3>
    <100f>   DW_AT_data_member_location: 12
 <2><1010>: Abbrev Number: 15 (DW_TAG_member)
    <1011>   DW_AT_name        : (indirect string, offset: 0x8adfd): APB2CLKDivider
    <1015>   DW_AT_decl_file   : 8
    <1016>   DW_AT_decl_line   : 76
    <1017>   DW_AT_decl_column : 12
    <1018>   DW_AT_type        : <0xbc3>
    <101c>   DW_AT_data_member_location: 16
 <2><101d>: Abbrev Number: 0
 <1><101e>: Abbrev Number: 6 (DW_TAG_typedef)
    <101f>   DW_AT_name        : (indirect string, offset: 0x8a167): RCC_ClkInitTypeDef
    <1023>   DW_AT_decl_file   : 8
    <1024>   DW_AT_decl_line   : 78
    <1025>   DW_AT_decl_column : 3
    <1026>   DW_AT_type        : <0xfd3>
 <1><102a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <102b>   DW_AT_byte_size   : 40
    <102c>   DW_AT_decl_file   : 9
    <102d>   DW_AT_decl_line   : 226
    <102e>   DW_AT_decl_column : 9
    <102f>   DW_AT_sibling     : <0x109c>
 <2><1033>: Abbrev Number: 15 (DW_TAG_member)
    <1034>   DW_AT_name        : (indirect string, offset: 0x88d33): OscillatorType
    <1038>   DW_AT_decl_file   : 9
    <1039>   DW_AT_decl_line   : 228
    <103a>   DW_AT_decl_column : 12
    <103b>   DW_AT_type        : <0xbc3>
    <103f>   DW_AT_data_member_location: 0
 <2><1040>: Abbrev Number: 15 (DW_TAG_member)
    <1041>   DW_AT_name        : (indirect string, offset: 0x8c11a): HSEState
    <1045>   DW_AT_decl_file   : 9
    <1046>   DW_AT_decl_line   : 236
    <1047>   DW_AT_decl_column : 12
    <1048>   DW_AT_type        : <0xbc3>
    <104c>   DW_AT_data_member_location: 4
 <2><104d>: Abbrev Number: 15 (DW_TAG_member)
    <104e>   DW_AT_name        : (indirect string, offset: 0x8c0e7): HSEPredivValue
    <1052>   DW_AT_decl_file   : 9
    <1053>   DW_AT_decl_line   : 239
    <1054>   DW_AT_decl_column : 12
    <1055>   DW_AT_type        : <0xbc3>
    <1059>   DW_AT_data_member_location: 8
 <2><105a>: Abbrev Number: 15 (DW_TAG_member)
    <105b>   DW_AT_name        : (indirect string, offset: 0x8bf38): LSEState
    <105f>   DW_AT_decl_file   : 9
    <1060>   DW_AT_decl_line   : 242
    <1061>   DW_AT_decl_column : 12
    <1062>   DW_AT_type        : <0xbc3>
    <1066>   DW_AT_data_member_location: 12
 <2><1067>: Abbrev Number: 15 (DW_TAG_member)
    <1068>   DW_AT_name        : (indirect string, offset: 0x8ad6a): HSIState
    <106c>   DW_AT_decl_file   : 9
    <106d>   DW_AT_decl_line   : 245
    <106e>   DW_AT_decl_column : 12
    <106f>   DW_AT_type        : <0xbc3>
    <1073>   DW_AT_data_member_location: 16
 <2><1074>: Abbrev Number: 15 (DW_TAG_member)
    <1075>   DW_AT_name        : (indirect string, offset: 0x8d21e): HSICalibrationValue
    <1079>   DW_AT_decl_file   : 9
    <107a>   DW_AT_decl_line   : 248
    <107b>   DW_AT_decl_column : 12
    <107c>   DW_AT_type        : <0xbc3>
    <1080>   DW_AT_data_member_location: 20
 <2><1081>: Abbrev Number: 15 (DW_TAG_member)
    <1082>   DW_AT_name        : (indirect string, offset: 0x8d603): LSIState
    <1086>   DW_AT_decl_file   : 9
    <1087>   DW_AT_decl_line   : 251
    <1088>   DW_AT_decl_column : 12
    <1089>   DW_AT_type        : <0xbc3>
    <108d>   DW_AT_data_member_location: 24
 <2><108e>: Abbrev Number: 16 (DW_TAG_member)
    <108f>   DW_AT_name        : PLL
    <1093>   DW_AT_decl_file   : 9
    <1094>   DW_AT_decl_line   : 254
    <1095>   DW_AT_decl_column : 22
    <1096>   DW_AT_type        : <0xfc7>
    <109a>   DW_AT_data_member_location: 28
 <2><109b>: Abbrev Number: 0
 <1><109c>: Abbrev Number: 13 (DW_TAG_typedef)
    <109d>   DW_AT_name        : (indirect string, offset: 0x8b545): RCC_OscInitTypeDef
    <10a1>   DW_AT_decl_file   : 9
    <10a2>   DW_AT_decl_line   : 259
    <10a4>   DW_AT_decl_column : 3
    <10a5>   DW_AT_type        : <0x102a>
 <1><10a9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <10aa>   DW_AT_byte_size   : 16
    <10ab>   DW_AT_decl_file   : 10
    <10ac>   DW_AT_decl_line   : 46
    <10ad>   DW_AT_decl_column : 9
    <10ae>   DW_AT_sibling     : <0x10e7>
 <2><10b2>: Abbrev Number: 16 (DW_TAG_member)
    <10b3>   DW_AT_name        : Pin
    <10b7>   DW_AT_decl_file   : 10
    <10b8>   DW_AT_decl_line   : 48
    <10b9>   DW_AT_decl_column : 12
    <10ba>   DW_AT_type        : <0xbc3>
    <10be>   DW_AT_data_member_location: 0
 <2><10bf>: Abbrev Number: 15 (DW_TAG_member)
    <10c0>   DW_AT_name        : (indirect string, offset: 0x8f427): Mode
    <10c4>   DW_AT_decl_file   : 10
    <10c5>   DW_AT_decl_line   : 51
    <10c6>   DW_AT_decl_column : 12
    <10c7>   DW_AT_type        : <0xbc3>
    <10cb>   DW_AT_data_member_location: 4
 <2><10cc>: Abbrev Number: 15 (DW_TAG_member)
    <10cd>   DW_AT_name        : (indirect string, offset: 0x88abb): Pull
    <10d1>   DW_AT_decl_file   : 10
    <10d2>   DW_AT_decl_line   : 54
    <10d3>   DW_AT_decl_column : 12
    <10d4>   DW_AT_type        : <0xbc3>
    <10d8>   DW_AT_data_member_location: 8
 <2><10d9>: Abbrev Number: 15 (DW_TAG_member)
    <10da>   DW_AT_name        : (indirect string, offset: 0x8ba83): Speed
    <10de>   DW_AT_decl_file   : 10
    <10df>   DW_AT_decl_line   : 57
    <10e0>   DW_AT_decl_column : 12
    <10e1>   DW_AT_type        : <0xbc3>
    <10e5>   DW_AT_data_member_location: 12
 <2><10e6>: Abbrev Number: 0
 <1><10e7>: Abbrev Number: 6 (DW_TAG_typedef)
    <10e8>   DW_AT_name        : (indirect string, offset: 0x8d84e): GPIO_InitTypeDef
    <10ec>   DW_AT_decl_file   : 10
    <10ed>   DW_AT_decl_line   : 59
    <10ee>   DW_AT_decl_column : 3
    <10ef>   DW_AT_type        : <0x10a9>
 <1><10f3>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <10f4>   DW_AT_encoding    : 7	(unsigned)
    <10f5>   DW_AT_byte_size   : 1
    <10f6>   DW_AT_type        : <0xb45>
    <10fa>   DW_AT_decl_file   : 10
    <10fb>   DW_AT_decl_line   : 65
    <10fc>   DW_AT_decl_column : 1
    <10fd>   DW_AT_sibling     : <0x110e>
 <2><1101>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1102>   DW_AT_name        : (indirect string, offset: 0x898b3): GPIO_PIN_RESET
    <1106>   DW_AT_const_value : 0
 <2><1107>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1108>   DW_AT_name        : (indirect string, offset: 0x894c9): GPIO_PIN_SET
    <110c>   DW_AT_const_value : 1
 <2><110d>: Abbrev Number: 0
 <1><110e>: Abbrev Number: 6 (DW_TAG_typedef)
    <110f>   DW_AT_name        : (indirect string, offset: 0x8dbd0): GPIO_PinState
    <1113>   DW_AT_decl_file   : 10
    <1114>   DW_AT_decl_line   : 68
    <1115>   DW_AT_decl_column : 3
    <1116>   DW_AT_type        : <0x10f3>
 <1><111a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <111b>   DW_AT_byte_size   : 28
    <111c>   DW_AT_decl_file   : 11
    <111d>   DW_AT_decl_line   : 47
    <111e>   DW_AT_decl_column : 9
    <111f>   DW_AT_sibling     : <0x117f>
 <2><1123>: Abbrev Number: 15 (DW_TAG_member)
    <1124>   DW_AT_name        : (indirect string, offset: 0x8a6d4): Direction
    <1128>   DW_AT_decl_file   : 11
    <1129>   DW_AT_decl_line   : 49
    <112a>   DW_AT_decl_column : 12
    <112b>   DW_AT_type        : <0xbc3>
    <112f>   DW_AT_data_member_location: 0
 <2><1130>: Abbrev Number: 15 (DW_TAG_member)
    <1131>   DW_AT_name        : (indirect string, offset: 0x88e8f): PeriphInc
    <1135>   DW_AT_decl_file   : 11
    <1136>   DW_AT_decl_line   : 53
    <1137>   DW_AT_decl_column : 12
    <1138>   DW_AT_type        : <0xbc3>
    <113c>   DW_AT_data_member_location: 4
 <2><113d>: Abbrev Number: 15 (DW_TAG_member)
    <113e>   DW_AT_name        : (indirect string, offset: 0x8939f): MemInc
    <1142>   DW_AT_decl_file   : 11
    <1143>   DW_AT_decl_line   : 56
    <1144>   DW_AT_decl_column : 12
    <1145>   DW_AT_type        : <0xbc3>
    <1149>   DW_AT_data_member_location: 8
 <2><114a>: Abbrev Number: 15 (DW_TAG_member)
    <114b>   DW_AT_name        : (indirect string, offset: 0x8b1be): PeriphDataAlignment
    <114f>   DW_AT_decl_file   : 11
    <1150>   DW_AT_decl_line   : 59
    <1151>   DW_AT_decl_column : 12
    <1152>   DW_AT_type        : <0xbc3>
    <1156>   DW_AT_data_member_location: 12
