Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x9b2 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x445ad): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x5bc1d): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x44e36): D:/STM32/STM32_CUBEIDE/_RTOS/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0xb603): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x3dfe5): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8
    <40>   DW_AT_encoding    : 4	(float)

 <1><4c>: Abbrev Number: 4 (DW_TAG_typedef)
    <4d>   DW_AT_name        : (indirect string, offset: 0x27873): __uint8_t
    <51>   DW_AT_decl_file   : 2
    <52>   DW_AT_decl_line   : 43
    <53>   DW_AT_decl_column : 24
    <54>   DW_AT_type        : <0x58>
 <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
    <59>   DW_AT_byte_size   : 1
    <5a>   DW_AT_encoding    : 8	(unsigned char)
    <5b>   DW_AT_name        : (indirect string, offset: 0x1b87d): unsigned char
 <1><5f>: Abbrev Number: 3 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 2
    <61>   DW_AT_encoding    : 5	(signed)
    <62>   DW_AT_name        : (indirect string, offset: 0x64835): short int
 <1><66>: Abbrev Number: 4 (DW_TAG_typedef)
    <67>   DW_AT_name        : (indirect string, offset: 0x6e671): __uint16_t
    <6b>   DW_AT_decl_file   : 2
    <6c>   DW_AT_decl_line   : 57
    <6d>   DW_AT_decl_column : 25
    <6e>   DW_AT_type        : <0x72>
 <1><72>: Abbrev Number: 3 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 2
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0x2c203): short unsigned int
 <1><79>: Abbrev Number: 3 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : (indirect string, offset: 0xbc5c): long int
 <1><80>: Abbrev Number: 4 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x55b01): __uint32_t
    <85>   DW_AT_decl_file   : 2
    <86>   DW_AT_decl_line   : 79
    <87>   DW_AT_decl_column : 25
    <88>   DW_AT_type        : <0x8c>
 <1><8c>: Abbrev Number: 3 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x1fe3a): long unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_base_type)
    <94>   DW_AT_byte_size   : 8
    <95>   DW_AT_encoding    : 7	(unsigned)
    <96>   DW_AT_name        : (indirect string, offset: 0x1c041): long long unsigned int
 <1><9a>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b>   DW_AT_name        : (indirect string, offset: 0x27875): uint8_t
    <9f>   DW_AT_decl_file   : 3
    <a0>   DW_AT_decl_line   : 24
    <a1>   DW_AT_decl_column : 19
    <a2>   DW_AT_type        : <0x4c>
 <1><a6>: Abbrev Number: 4 (DW_TAG_typedef)
    <a7>   DW_AT_name        : (indirect string, offset: 0x62874): uint16_t
    <ab>   DW_AT_decl_file   : 3
    <ac>   DW_AT_decl_line   : 36
    <ad>   DW_AT_decl_column : 20
    <ae>   DW_AT_type        : <0x66>
 <1><b2>: Abbrev Number: 4 (DW_TAG_typedef)
    <b3>   DW_AT_name        : (indirect string, offset: 0x6220b): uint32_t
    <b7>   DW_AT_decl_file   : 3
    <b8>   DW_AT_decl_line   : 48
    <b9>   DW_AT_decl_column : 20
    <ba>   DW_AT_type        : <0x80>
 <1><be>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <bf>   DW_AT_byte_size   : 4
 <1><c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <c1>   DW_AT_name        : (indirect string, offset: 0x62b2c): StackType_t
    <c5>   DW_AT_decl_file   : 4
    <c6>   DW_AT_decl_line   : 55
    <c7>   DW_AT_decl_column : 24
    <c8>   DW_AT_type        : <0xb2>
 <1><cc>: Abbrev Number: 4 (DW_TAG_typedef)
    <cd>   DW_AT_name        : (indirect string, offset: 0x7bad5): UBaseType_t
    <d1>   DW_AT_decl_file   : 4
    <d2>   DW_AT_decl_line   : 57
    <d3>   DW_AT_decl_column : 23
    <d4>   DW_AT_type        : <0x8c>
 <1><d8>: Abbrev Number: 4 (DW_TAG_typedef)
    <d9>   DW_AT_name        : (indirect string, offset: 0x4a039): TickType_t
    <dd>   DW_AT_decl_file   : 4
    <de>   DW_AT_decl_line   : 63
    <df>   DW_AT_decl_column : 19
    <e0>   DW_AT_type        : <0xb2>
 <1><e4>: Abbrev Number: 6 (DW_TAG_typedef)
    <e5>   DW_AT_name        : (indirect string, offset: 0x86255): wint_t
    <e9>   DW_AT_decl_file   : 5
    <ea>   DW_AT_decl_line   : 350
    <ec>   DW_AT_decl_column : 23
    <ed>   DW_AT_type        : <0x30>
 <1><f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <f2>   DW_AT_name        : (indirect string, offset: 0x7a301): _off_t
    <f6>   DW_AT_decl_file   : 6
    <f7>   DW_AT_decl_line   : 46
    <f8>   DW_AT_decl_column : 14
    <f9>   DW_AT_type        : <0x79>
 <1><fd>: Abbrev Number: 4 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x1e004): _fpos_t
    <102>   DW_AT_decl_file   : 6
    <103>   DW_AT_decl_line   : 116
    <104>   DW_AT_decl_column : 14
    <105>   DW_AT_type        : <0x79>
 <1><109>: Abbrev Number: 7 (DW_TAG_union_type)
    <10a>   DW_AT_byte_size   : 4
    <10b>   DW_AT_decl_file   : 6
    <10c>   DW_AT_decl_line   : 165
    <10d>   DW_AT_decl_column : 3
    <10e>   DW_AT_sibling     : <0x12b>
 <2><112>: Abbrev Number: 8 (DW_TAG_member)
    <113>   DW_AT_name        : (indirect string, offset: 0x7ea49): __wch
    <117>   DW_AT_decl_file   : 6
    <118>   DW_AT_decl_line   : 167
    <119>   DW_AT_decl_column : 12
    <11a>   DW_AT_type        : <0xe4>
 <2><11e>: Abbrev Number: 8 (DW_TAG_member)
    <11f>   DW_AT_name        : (indirect string, offset: 0x45697): __wchb
    <123>   DW_AT_decl_file   : 6
    <124>   DW_AT_decl_line   : 168
    <125>   DW_AT_decl_column : 19
    <126>   DW_AT_type        : <0x12b>
 <2><12a>: Abbrev Number: 0
 <1><12b>: Abbrev Number: 9 (DW_TAG_array_type)
    <12c>   DW_AT_type        : <0x58>
    <130>   DW_AT_sibling     : <0x13b>
 <2><134>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <135>   DW_AT_type        : <0x30>
    <139>   DW_AT_upper_bound : 3
 <2><13a>: Abbrev Number: 0
 <1><13b>: Abbrev Number: 11 (DW_TAG_structure_type)
    <13c>   DW_AT_byte_size   : 8
    <13d>   DW_AT_decl_file   : 6
    <13e>   DW_AT_decl_line   : 162
    <13f>   DW_AT_decl_column : 9
    <140>   DW_AT_sibling     : <0x15f>
 <2><144>: Abbrev Number: 12 (DW_TAG_member)
    <145>   DW_AT_name        : (indirect string, offset: 0x2616f): __count
    <149>   DW_AT_decl_file   : 6
    <14a>   DW_AT_decl_line   : 164
    <14b>   DW_AT_decl_column : 7
    <14c>   DW_AT_type        : <0x29>
    <150>   DW_AT_data_member_location: 0
 <2><151>: Abbrev Number: 12 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x1b919): __value
    <156>   DW_AT_decl_file   : 6
    <157>   DW_AT_decl_line   : 169
    <158>   DW_AT_decl_column : 5
    <159>   DW_AT_type        : <0x109>
    <15d>   DW_AT_data_member_location: 4
 <2><15e>: Abbrev Number: 0
 <1><15f>: Abbrev Number: 4 (DW_TAG_typedef)
    <160>   DW_AT_name        : (indirect string, offset: 0x467d9): _mbstate_t
    <164>   DW_AT_decl_file   : 6
    <165>   DW_AT_decl_line   : 170
    <166>   DW_AT_decl_column : 3
    <167>   DW_AT_type        : <0x13b>
 <1><16b>: Abbrev Number: 4 (DW_TAG_typedef)
    <16c>   DW_AT_name        : (indirect string, offset: 0x78457): __ULong
    <170>   DW_AT_decl_file   : 7
    <171>   DW_AT_decl_line   : 22
    <172>   DW_AT_decl_column : 25
    <173>   DW_AT_type        : <0x8c>
 <1><177>: Abbrev Number: 4 (DW_TAG_typedef)
    <178>   DW_AT_name        : (indirect string, offset: 0x49cbb): _LOCK_T
    <17c>   DW_AT_decl_file   : 8
    <17d>   DW_AT_decl_line   : 34
    <17e>   DW_AT_decl_column : 25
    <17f>   DW_AT_type        : <0x183>
 <1><183>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <184>   DW_AT_byte_size   : 4
    <185>   DW_AT_type        : <0x189>
 <1><189>: Abbrev Number: 14 (DW_TAG_structure_type)
    <18a>   DW_AT_name        : (indirect string, offset: 0x1136e): __lock
    <18e>   DW_AT_declaration : 1
 <1><18e>: Abbrev Number: 4 (DW_TAG_typedef)
    <18f>   DW_AT_name        : (indirect string, offset: 0x42a05): _flock_t
    <193>   DW_AT_decl_file   : 7
    <194>   DW_AT_decl_line   : 35
    <195>   DW_AT_decl_column : 27
    <196>   DW_AT_type        : <0x177>
 <1><19a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <19b>   DW_AT_name        : (indirect string, offset: 0x2e4c1): _Bigint
    <19f>   DW_AT_byte_size   : 24
    <1a0>   DW_AT_decl_file   : 7
    <1a1>   DW_AT_decl_line   : 52
    <1a2>   DW_AT_decl_column : 8
    <1a3>   DW_AT_sibling     : <0x1f4>
 <2><1a7>: Abbrev Number: 12 (DW_TAG_member)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x4ff88): _next
    <1ac>   DW_AT_decl_file   : 7
    <1ad>   DW_AT_decl_line   : 54
    <1ae>   DW_AT_decl_column : 19
    <1af>   DW_AT_type        : <0x1f4>
    <1b3>   DW_AT_data_member_location: 0
 <2><1b4>: Abbrev Number: 16 (DW_TAG_member)
    <1b5>   DW_AT_name        : _k
    <1b8>   DW_AT_decl_file   : 7
    <1b9>   DW_AT_decl_line   : 55
    <1ba>   DW_AT_decl_column : 7
    <1bb>   DW_AT_type        : <0x29>
    <1bf>   DW_AT_data_member_location: 4
 <2><1c0>: Abbrev Number: 12 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x60d94): _maxwds
    <1c5>   DW_AT_decl_file   : 7
    <1c6>   DW_AT_decl_line   : 55
    <1c7>   DW_AT_decl_column : 11
    <1c8>   DW_AT_type        : <0x29>
    <1cc>   DW_AT_data_member_location: 8
 <2><1cd>: Abbrev Number: 12 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x47a15): _sign
    <1d2>   DW_AT_decl_file   : 7
    <1d3>   DW_AT_decl_line   : 55
    <1d4>   DW_AT_decl_column : 20
    <1d5>   DW_AT_type        : <0x29>
    <1d9>   DW_AT_data_member_location: 12
 <2><1da>: Abbrev Number: 12 (DW_TAG_member)
    <1db>   DW_AT_name        : (indirect string, offset: 0x478de): _wds
    <1df>   DW_AT_decl_file   : 7
    <1e0>   DW_AT_decl_line   : 55
    <1e1>   DW_AT_decl_column : 27
    <1e2>   DW_AT_type        : <0x29>
    <1e6>   DW_AT_data_member_location: 16
 <2><1e7>: Abbrev Number: 16 (DW_TAG_member)
    <1e8>   DW_AT_name        : _x
    <1eb>   DW_AT_decl_file   : 7
    <1ec>   DW_AT_decl_line   : 56
    <1ed>   DW_AT_decl_column : 11
    <1ee>   DW_AT_type        : <0x1fa>
    <1f2>   DW_AT_data_member_location: 20
 <2><1f3>: Abbrev Number: 0
 <1><1f4>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <1f5>   DW_AT_byte_size   : 4
    <1f6>   DW_AT_type        : <0x19a>
 <1><1fa>: Abbrev Number: 9 (DW_TAG_array_type)
    <1fb>   DW_AT_type        : <0x16b>
    <1ff>   DW_AT_sibling     : <0x20a>
 <2><203>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <204>   DW_AT_type        : <0x30>
    <208>   DW_AT_upper_bound : 0
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <20b>   DW_AT_name        : (indirect string, offset: 0x24b9f): __tm
    <20f>   DW_AT_byte_size   : 36
    <210>   DW_AT_decl_file   : 7
    <211>   DW_AT_decl_line   : 60
    <212>   DW_AT_decl_column : 8
    <213>   DW_AT_sibling     : <0x28d>
 <2><217>: Abbrev Number: 12 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0x6eae2): __tm_sec
    <21c>   DW_AT_decl_file   : 7
    <21d>   DW_AT_decl_line   : 62
    <21e>   DW_AT_decl_column : 9
    <21f>   DW_AT_type        : <0x29>
    <223>   DW_AT_data_member_location: 0
 <2><224>: Abbrev Number: 12 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x938): __tm_min
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 63
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0x29>
    <230>   DW_AT_data_member_location: 4
 <2><231>: Abbrev Number: 12 (DW_TAG_member)
    <232>   DW_AT_name        : (indirect string, offset: 0x1cce9): __tm_hour
    <236>   DW_AT_decl_file   : 7
    <237>   DW_AT_decl_line   : 64
    <238>   DW_AT_decl_column : 9
    <239>   DW_AT_type        : <0x29>
    <23d>   DW_AT_data_member_location: 8
 <2><23e>: Abbrev Number: 12 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x4ebe8): __tm_mday
    <243>   DW_AT_decl_file   : 7
    <244>   DW_AT_decl_line   : 65
    <245>   DW_AT_decl_column : 9
    <246>   DW_AT_type        : <0x29>
    <24a>   DW_AT_data_member_location: 12
 <2><24b>: Abbrev Number: 12 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x25ec): __tm_mon
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 66
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0x29>
    <257>   DW_AT_data_member_location: 16
 <2><258>: Abbrev Number: 12 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0x7d14d): __tm_year
    <25d>   DW_AT_decl_file   : 7
    <25e>   DW_AT_decl_line   : 67
    <25f>   DW_AT_decl_column : 9
    <260>   DW_AT_type        : <0x29>
    <264>   DW_AT_data_member_location: 20
 <2><265>: Abbrev Number: 12 (DW_TAG_member)
    <266>   DW_AT_name        : (indirect string, offset: 0x3970c): __tm_wday
    <26a>   DW_AT_decl_file   : 7
    <26b>   DW_AT_decl_line   : 68
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0x29>
    <271>   DW_AT_data_member_location: 24
 <2><272>: Abbrev Number: 12 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0x73ee0): __tm_yday
    <277>   DW_AT_decl_file   : 7
    <278>   DW_AT_decl_line   : 69
    <279>   DW_AT_decl_column : 9
    <27a>   DW_AT_type        : <0x29>
    <27e>   DW_AT_data_member_location: 28
 <2><27f>: Abbrev Number: 12 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x79302): __tm_isdst
    <284>   DW_AT_decl_file   : 7
    <285>   DW_AT_decl_line   : 70
    <286>   DW_AT_decl_column : 9
    <287>   DW_AT_type        : <0x29>
    <28b>   DW_AT_data_member_location: 32
 <2><28c>: Abbrev Number: 0
 <1><28d>: Abbrev Number: 15 (DW_TAG_structure_type)
    <28e>   DW_AT_name        : (indirect string, offset: 0x5a29f): __sbuf
    <292>   DW_AT_byte_size   : 8
    <293>   DW_AT_decl_file   : 7
    <294>   DW_AT_decl_line   : 122
    <295>   DW_AT_decl_column : 8
    <296>   DW_AT_sibling     : <0x2b5>
 <2><29a>: Abbrev Number: 12 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0x854c1): _base
    <29f>   DW_AT_decl_file   : 7
    <2a0>   DW_AT_decl_line   : 123
    <2a1>   DW_AT_decl_column : 17
    <2a2>   DW_AT_type        : <0x2b5>
    <2a6>   DW_AT_data_member_location: 0
 <2><2a7>: Abbrev Number: 12 (DW_TAG_member)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x4caf6): _size
    <2ac>   DW_AT_decl_file   : 7
    <2ad>   DW_AT_decl_line   : 124
    <2ae>   DW_AT_decl_column : 6
    <2af>   DW_AT_type        : <0x29>
    <2b3>   DW_AT_data_member_location: 4
 <2><2b4>: Abbrev Number: 0
 <1><2b5>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <2b6>   DW_AT_byte_size   : 4
    <2b7>   DW_AT_type        : <0x58>
 <1><2bb>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x8ee7b): _reent
    <2c0>   DW_AT_byte_size   : 96
    <2c1>   DW_AT_decl_file   : 7
    <2c2>   DW_AT_decl_line   : 377
    <2c4>   DW_AT_decl_column : 8
    <2c5>   DW_AT_sibling     : <0x3fe>
 <2><2c9>: Abbrev Number: 18 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x4ed03): _errno
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 381
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x29>
    <2d6>   DW_AT_data_member_location: 0
 <2><2d7>: Abbrev Number: 18 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x8e235): _stdin
    <2dc>   DW_AT_decl_file   : 7
    <2dd>   DW_AT_decl_line   : 386
    <2df>   DW_AT_decl_column : 11
    <2e0>   DW_AT_type        : <0x651>
    <2e4>   DW_AT_data_member_location: 4
 <2><2e5>: Abbrev Number: 18 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x8ed5e): _stdout
    <2ea>   DW_AT_decl_file   : 7
    <2eb>   DW_AT_decl_line   : 386
    <2ed>   DW_AT_decl_column : 20
    <2ee>   DW_AT_type        : <0x651>
    <2f2>   DW_AT_data_member_location: 8
 <2><2f3>: Abbrev Number: 18 (DW_TAG_member)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x8ed07): _stderr
    <2f8>   DW_AT_decl_file   : 7
    <2f9>   DW_AT_decl_line   : 386
    <2fb>   DW_AT_decl_column : 30
    <2fc>   DW_AT_type        : <0x651>
    <300>   DW_AT_data_member_location: 12
 <2><301>: Abbrev Number: 18 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0x5537e): _inc
    <306>   DW_AT_decl_file   : 7
    <307>   DW_AT_decl_line   : 388
    <309>   DW_AT_decl_column : 8
    <30a>   DW_AT_type        : <0x29>
    <30e>   DW_AT_data_member_location: 16
 <2><30f>: Abbrev Number: 18 (DW_TAG_member)
    <310>   DW_AT_name        : (indirect string, offset: 0x6a769): _emergency
    <314>   DW_AT_decl_file   : 7
    <315>   DW_AT_decl_line   : 390
    <317>   DW_AT_decl_column : 9
    <318>   DW_AT_type        : <0x565>
    <31c>   DW_AT_data_member_location: 20
 <2><31d>: Abbrev Number: 18 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x3b160): __sdidinit
    <322>   DW_AT_decl_file   : 7
    <323>   DW_AT_decl_line   : 392
    <325>   DW_AT_decl_column : 7
    <326>   DW_AT_type        : <0x29>
    <32a>   DW_AT_data_member_location: 24
 <2><32b>: Abbrev Number: 18 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0xc8b8): _unspecified_locale_info
    <330>   DW_AT_decl_file   : 7
    <331>   DW_AT_decl_line   : 394
    <333>   DW_AT_decl_column : 7
    <334>   DW_AT_type        : <0x29>
    <338>   DW_AT_data_member_location: 28
 <2><339>: Abbrev Number: 18 (DW_TAG_member)
    <33a>   DW_AT_name        : (indirect string, offset: 0x77757): _locale
    <33e>   DW_AT_decl_file   : 7
    <33f>   DW_AT_decl_line   : 395
    <341>   DW_AT_decl_column : 22
    <342>   DW_AT_type        : <0x7b9>
    <346>   DW_AT_data_member_location: 32
 <2><347>: Abbrev Number: 19 (DW_TAG_member)
    <348>   DW_AT_name        : _mp
    <34c>   DW_AT_decl_file   : 7
    <34d>   DW_AT_decl_line   : 397
    <34f>   DW_AT_decl_column : 18
    <350>   DW_AT_type        : <0x7bf>
    <354>   DW_AT_data_member_location: 36
 <2><355>: Abbrev Number: 18 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x1500d): __cleanup
    <35a>   DW_AT_decl_file   : 7
    <35b>   DW_AT_decl_line   : 399
    <35d>   DW_AT_decl_column : 10
    <35e>   DW_AT_type        : <0x7d0>
    <362>   DW_AT_data_member_location: 40
 <2><363>: Abbrev Number: 18 (DW_TAG_member)
    <364>   DW_AT_name        : (indirect string, offset: 0x21c29): _gamma_signgam
    <368>   DW_AT_decl_file   : 7
    <369>   DW_AT_decl_line   : 401
    <36b>   DW_AT_decl_column : 7
    <36c>   DW_AT_type        : <0x29>
    <370>   DW_AT_data_member_location: 44
 <2><371>: Abbrev Number: 18 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x6c3fa): _cvtlen
    <376>   DW_AT_decl_file   : 7
    <377>   DW_AT_decl_line   : 404
    <379>   DW_AT_decl_column : 7
    <37a>   DW_AT_type        : <0x29>
    <37e>   DW_AT_data_member_location: 48
 <2><37f>: Abbrev Number: 18 (DW_TAG_member)
    <380>   DW_AT_name        : (indirect string, offset: 0x3eb94): _cvtbuf
    <384>   DW_AT_decl_file   : 7
    <385>   DW_AT_decl_line   : 405
    <387>   DW_AT_decl_column : 9
    <388>   DW_AT_type        : <0x565>
    <38c>   DW_AT_data_member_location: 52
 <2><38d>: Abbrev Number: 18 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x64cdb): _r48
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 407
    <395>   DW_AT_decl_column : 19
    <396>   DW_AT_type        : <0x7d6>
    <39a>   DW_AT_data_member_location: 56
 <2><39b>: Abbrev Number: 18 (DW_TAG_member)
    <39c>   DW_AT_name        : (indirect string, offset: 0x70654): _localtime_buf
    <3a0>   DW_AT_decl_file   : 7
    <3a1>   DW_AT_decl_line   : 408
    <3a3>   DW_AT_decl_column : 16
    <3a4>   DW_AT_type        : <0x7dc>
    <3a8>   DW_AT_data_member_location: 60
 <2><3a9>: Abbrev Number: 18 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x1fde5): _asctime_buf
    <3ae>   DW_AT_decl_file   : 7
    <3af>   DW_AT_decl_line   : 409
    <3b1>   DW_AT_decl_column : 9
    <3b2>   DW_AT_type        : <0x565>
    <3b6>   DW_AT_data_member_location: 64
 <2><3b7>: Abbrev Number: 18 (DW_TAG_member)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x6ef54): _sig_func
    <3bc>   DW_AT_decl_file   : 7
    <3bd>   DW_AT_decl_line   : 412
    <3bf>   DW_AT_decl_column : 12
    <3c0>   DW_AT_type        : <0x7ed>
    <3c4>   DW_AT_data_member_location: 68
 <2><3c5>: Abbrev Number: 18 (DW_TAG_member)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x60bd2): __sglue
    <3ca>   DW_AT_decl_file   : 7
    <3cb>   DW_AT_decl_line   : 420
    <3cd>   DW_AT_decl_column : 16
    <3ce>   DW_AT_type        : <0x612>
    <3d2>   DW_AT_data_member_location: 72
 <2><3d3>: Abbrev Number: 18 (DW_TAG_member)
    <3d4>   DW_AT_name        : (indirect string, offset: 0x247a1): __sf
    <3d8>   DW_AT_decl_file   : 7
    <3d9>   DW_AT_decl_line   : 421
    <3db>   DW_AT_decl_column : 11
    <3dc>   DW_AT_type        : <0x651>
    <3e0>   DW_AT_data_member_location: 84
 <2><3e1>: Abbrev Number: 18 (DW_TAG_member)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x3d6c6): _misc
    <3e6>   DW_AT_decl_file   : 7
    <3e7>   DW_AT_decl_line   : 422
    <3e9>   DW_AT_decl_column : 23
    <3ea>   DW_AT_type        : <0x7f9>
    <3ee>   DW_AT_data_member_location: 88
 <2><3ef>: Abbrev Number: 18 (DW_TAG_member)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x53fe8): _signal_buf
    <3f4>   DW_AT_decl_file   : 7
    <3f5>   DW_AT_decl_line   : 423
    <3f7>   DW_AT_decl_column : 9
    <3f8>   DW_AT_type        : <0x565>
    <3fc>   DW_AT_data_member_location: 92
 <2><3fd>: Abbrev Number: 0
 <1><3fe>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <3ff>   DW_AT_byte_size   : 4
    <400>   DW_AT_type        : <0x2bb>
 <1><404>: Abbrev Number: 15 (DW_TAG_structure_type)
    <405>   DW_AT_name        : (indirect string, offset: 0x6778c): __sFILE
    <409>   DW_AT_byte_size   : 104
    <40a>   DW_AT_decl_file   : 7
    <40b>   DW_AT_decl_line   : 186
    <40c>   DW_AT_decl_column : 8
    <40d>   DW_AT_sibling     : <0x547>
 <2><411>: Abbrev Number: 16 (DW_TAG_member)
    <412>   DW_AT_name        : _p
    <415>   DW_AT_decl_file   : 7
    <416>   DW_AT_decl_line   : 187
    <417>   DW_AT_decl_column : 18
    <418>   DW_AT_type        : <0x2b5>
    <41c>   DW_AT_data_member_location: 0
 <2><41d>: Abbrev Number: 16 (DW_TAG_member)
    <41e>   DW_AT_name        : _r
    <421>   DW_AT_decl_file   : 7
    <422>   DW_AT_decl_line   : 188
    <423>   DW_AT_decl_column : 7
    <424>   DW_AT_type        : <0x29>
    <428>   DW_AT_data_member_location: 4
 <2><429>: Abbrev Number: 16 (DW_TAG_member)
    <42a>   DW_AT_name        : _w
    <42d>   DW_AT_decl_file   : 7
    <42e>   DW_AT_decl_line   : 189
    <42f>   DW_AT_decl_column : 7
    <430>   DW_AT_type        : <0x29>
    <434>   DW_AT_data_member_location: 8
 <2><435>: Abbrev Number: 12 (DW_TAG_member)
    <436>   DW_AT_name        : (indirect string, offset: 0x3e093): _flags
    <43a>   DW_AT_decl_file   : 7
    <43b>   DW_AT_decl_line   : 190
    <43c>   DW_AT_decl_column : 9
    <43d>   DW_AT_type        : <0x5f>
    <441>   DW_AT_data_member_location: 12
 <2><442>: Abbrev Number: 12 (DW_TAG_member)
    <443>   DW_AT_name        : (indirect string, offset: 0x14982): _file
    <447>   DW_AT_decl_file   : 7
    <448>   DW_AT_decl_line   : 191
    <449>   DW_AT_decl_column : 9
    <44a>   DW_AT_type        : <0x5f>
    <44e>   DW_AT_data_member_location: 14
 <2><44f>: Abbrev Number: 16 (DW_TAG_member)
    <450>   DW_AT_name        : _bf
    <454>   DW_AT_decl_file   : 7
    <455>   DW_AT_decl_line   : 192
    <456>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0x28d>
    <45b>   DW_AT_data_member_location: 16
 <2><45c>: Abbrev Number: 12 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0x3e51b): _lbfsize
    <461>   DW_AT_decl_file   : 7
    <462>   DW_AT_decl_line   : 193
    <463>   DW_AT_decl_column : 7
    <464>   DW_AT_type        : <0x29>
    <468>   DW_AT_data_member_location: 24
 <2><469>: Abbrev Number: 12 (DW_TAG_member)
    <46a>   DW_AT_name        : (indirect string, offset: 0x5f1cc): _data
    <46e>   DW_AT_decl_file   : 7
    <46f>   DW_AT_decl_line   : 196
    <470>   DW_AT_decl_column : 18
    <471>   DW_AT_type        : <0x3fe>
    <475>   DW_AT_data_member_location: 28
 <2><476>: Abbrev Number: 12 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0x780d8): _cookie
    <47b>   DW_AT_decl_file   : 7
    <47c>   DW_AT_decl_line   : 200
    <47d>   DW_AT_decl_column : 10
    <47e>   DW_AT_type        : <0xbe>
    <482>   DW_AT_data_member_location: 32
 <2><483>: Abbrev Number: 12 (DW_TAG_member)
    <484>   DW_AT_name        : (indirect string, offset: 0x6a684): _read
    <488>   DW_AT_decl_file   : 7
    <489>   DW_AT_decl_line   : 202
    <48a>   DW_AT_decl_column : 29
    <48b>   DW_AT_type        : <0x577>
    <48f>   DW_AT_data_member_location: 36
 <2><490>: Abbrev Number: 12 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x113a4): _write
    <495>   DW_AT_decl_file   : 7
    <496>   DW_AT_decl_line   : 204
    <497>   DW_AT_decl_column : 29
    <498>   DW_AT_type        : <0x5a1>
    <49c>   DW_AT_data_member_location: 40
 <2><49d>: Abbrev Number: 12 (DW_TAG_member)
    <49e>   DW_AT_name        : (indirect string, offset: 0x83a72): _seek
    <4a2>   DW_AT_decl_file   : 7
    <4a3>   DW_AT_decl_line   : 207
    <4a4>   DW_AT_decl_column : 13
    <4a5>   DW_AT_type        : <0x5c5>
    <4a9>   DW_AT_data_member_location: 44
 <2><4aa>: Abbrev Number: 12 (DW_TAG_member)
    <4ab>   DW_AT_name        : (indirect string, offset: 0x3bd15): _close
    <4af>   DW_AT_decl_file   : 7
    <4b0>   DW_AT_decl_line   : 208
    <4b1>   DW_AT_decl_column : 9
    <4b2>   DW_AT_type        : <0x5df>
    <4b6>   DW_AT_data_member_location: 48
 <2><4b7>: Abbrev Number: 16 (DW_TAG_member)
    <4b8>   DW_AT_name        : _ub
    <4bc>   DW_AT_decl_file   : 7
    <4bd>   DW_AT_decl_line   : 211
    <4be>   DW_AT_decl_column : 17
    <4bf>   DW_AT_type        : <0x28d>
    <4c3>   DW_AT_data_member_location: 52
 <2><4c4>: Abbrev Number: 16 (DW_TAG_member)
    <4c5>   DW_AT_name        : _up
    <4c9>   DW_AT_decl_file   : 7
    <4ca>   DW_AT_decl_line   : 212
    <4cb>   DW_AT_decl_column : 18
    <4cc>   DW_AT_type        : <0x2b5>
    <4d0>   DW_AT_data_member_location: 60
 <2><4d1>: Abbrev Number: 16 (DW_TAG_member)
    <4d2>   DW_AT_name        : _ur
    <4d6>   DW_AT_decl_file   : 7
    <4d7>   DW_AT_decl_line   : 213
    <4d8>   DW_AT_decl_column : 7
    <4d9>   DW_AT_type        : <0x29>
    <4dd>   DW_AT_data_member_location: 64
 <2><4de>: Abbrev Number: 12 (DW_TAG_member)
    <4df>   DW_AT_name        : (indirect string, offset: 0x2485f): _ubuf
    <4e3>   DW_AT_decl_file   : 7
    <4e4>   DW_AT_decl_line   : 216
    <4e5>   DW_AT_decl_column : 17
    <4e6>   DW_AT_type        : <0x5e5>
    <4ea>   DW_AT_data_member_location: 68
 <2><4eb>: Abbrev Number: 12 (DW_TAG_member)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x5bd60): _nbuf
    <4f0>   DW_AT_decl_file   : 7
    <4f1>   DW_AT_decl_line   : 217
    <4f2>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x5f5>
    <4f7>   DW_AT_data_member_location: 71
 <2><4f8>: Abbrev Number: 16 (DW_TAG_member)
    <4f9>   DW_AT_name        : _lb
    <4fd>   DW_AT_decl_file   : 7
    <4fe>   DW_AT_decl_line   : 220
    <4ff>   DW_AT_decl_column : 17
    <500>   DW_AT_type        : <0x28d>
    <504>   DW_AT_data_member_location: 72
 <2><505>: Abbrev Number: 12 (DW_TAG_member)
    <506>   DW_AT_name        : (indirect string, offset: 0x221fa): _blksize
    <50a>   DW_AT_decl_file   : 7
    <50b>   DW_AT_decl_line   : 223
    <50c>   DW_AT_decl_column : 7
    <50d>   DW_AT_type        : <0x29>
    <511>   DW_AT_data_member_location: 80
 <2><512>: Abbrev Number: 12 (DW_TAG_member)
    <513>   DW_AT_name        : (indirect string, offset: 0x2b6c6): _offset
    <517>   DW_AT_decl_file   : 7
    <518>   DW_AT_decl_line   : 224
    <519>   DW_AT_decl_column : 10
    <51a>   DW_AT_type        : <0xf1>
    <51e>   DW_AT_data_member_location: 84
 <2><51f>: Abbrev Number: 12 (DW_TAG_member)
    <520>   DW_AT_name        : (indirect string, offset: 0x1136f): _lock
    <524>   DW_AT_decl_file   : 7
    <525>   DW_AT_decl_line   : 231
    <526>   DW_AT_decl_column : 12
    <527>   DW_AT_type        : <0x18e>
    <52b>   DW_AT_data_member_location: 88
 <2><52c>: Abbrev Number: 12 (DW_TAG_member)
    <52d>   DW_AT_name        : (indirect string, offset: 0xffd0): _mbstate
    <531>   DW_AT_decl_file   : 7
    <532>   DW_AT_decl_line   : 233
    <533>   DW_AT_decl_column : 14
    <534>   DW_AT_type        : <0x15f>
    <538>   DW_AT_data_member_location: 92
 <2><539>: Abbrev Number: 12 (DW_TAG_member)
    <53a>   DW_AT_name        : (indirect string, offset: 0x6df37): _flags2
    <53e>   DW_AT_decl_file   : 7
    <53f>   DW_AT_decl_line   : 234
    <540>   DW_AT_decl_column : 9
    <541>   DW_AT_type        : <0x29>
    <545>   DW_AT_data_member_location: 100
 <2><546>: Abbrev Number: 0
 <1><547>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <548>   DW_AT_prototyped  : 1
    <548>   DW_AT_type        : <0x29>
    <54c>   DW_AT_sibling     : <0x565>
 <2><550>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <551>   DW_AT_type        : <0x3fe>
 <2><555>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <556>   DW_AT_type        : <0xbe>
 <2><55a>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <55b>   DW_AT_type        : <0x565>
 <2><55f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <560>   DW_AT_type        : <0x29>
 <2><564>: Abbrev Number: 0
 <1><565>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <566>   DW_AT_byte_size   : 4
    <567>   DW_AT_type        : <0x56b>
 <1><56b>: Abbrev Number: 3 (DW_TAG_base_type)
    <56c>   DW_AT_byte_size   : 1
    <56d>   DW_AT_encoding    : 8	(unsigned char)
    <56e>   DW_AT_name        : (indirect string, offset: 0x2ba6a): char
 <1><572>: Abbrev Number: 22 (DW_TAG_const_type)
    <573>   DW_AT_type        : <0x56b>
 <1><577>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <578>   DW_AT_byte_size   : 4
    <579>   DW_AT_type        : <0x547>
 <1><57d>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <57e>   DW_AT_prototyped  : 1
    <57e>   DW_AT_type        : <0x29>
    <582>   DW_AT_sibling     : <0x59b>
 <2><586>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <587>   DW_AT_type        : <0x3fe>
 <2><58b>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <58c>   DW_AT_type        : <0xbe>
 <2><590>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <591>   DW_AT_type        : <0x59b>
 <2><595>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <596>   DW_AT_type        : <0x29>
 <2><59a>: Abbrev Number: 0
 <1><59b>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <59c>   DW_AT_byte_size   : 4
    <59d>   DW_AT_type        : <0x572>
 <1><5a1>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5a2>   DW_AT_byte_size   : 4
    <5a3>   DW_AT_type        : <0x57d>
 <1><5a7>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5a8>   DW_AT_prototyped  : 1
    <5a8>   DW_AT_type        : <0xfd>
    <5ac>   DW_AT_sibling     : <0x5c5>
 <2><5b0>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5b1>   DW_AT_type        : <0x3fe>
 <2><5b5>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5b6>   DW_AT_type        : <0xbe>
 <2><5ba>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5bb>   DW_AT_type        : <0xfd>
 <2><5bf>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5c0>   DW_AT_type        : <0x29>
 <2><5c4>: Abbrev Number: 0
 <1><5c5>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5c6>   DW_AT_byte_size   : 4
    <5c7>   DW_AT_type        : <0x5a7>
 <1><5cb>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <5cc>   DW_AT_prototyped  : 1
    <5cc>   DW_AT_type        : <0x29>
    <5d0>   DW_AT_sibling     : <0x5df>
 <2><5d4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5d5>   DW_AT_type        : <0x3fe>
 <2><5d9>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <5da>   DW_AT_type        : <0xbe>
 <2><5de>: Abbrev Number: 0
 <1><5df>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5e0>   DW_AT_byte_size   : 4
    <5e1>   DW_AT_type        : <0x5cb>
 <1><5e5>: Abbrev Number: 9 (DW_TAG_array_type)
    <5e6>   DW_AT_type        : <0x58>
    <5ea>   DW_AT_sibling     : <0x5f5>
 <2><5ee>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <5ef>   DW_AT_type        : <0x30>
    <5f3>   DW_AT_upper_bound : 2
 <2><5f4>: Abbrev Number: 0
 <1><5f5>: Abbrev Number: 9 (DW_TAG_array_type)
    <5f6>   DW_AT_type        : <0x58>
    <5fa>   DW_AT_sibling     : <0x605>
 <2><5fe>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <5ff>   DW_AT_type        : <0x30>
    <603>   DW_AT_upper_bound : 0
 <2><604>: Abbrev Number: 0
 <1><605>: Abbrev Number: 6 (DW_TAG_typedef)
    <606>   DW_AT_name        : (indirect string, offset: 0x6c223): __FILE
    <60a>   DW_AT_decl_file   : 7
    <60b>   DW_AT_decl_line   : 292
    <60d>   DW_AT_decl_column : 26
    <60e>   DW_AT_type        : <0x404>
 <1><612>: Abbrev Number: 17 (DW_TAG_structure_type)
    <613>   DW_AT_name        : (indirect string, offset: 0x679bb): _glue
    <617>   DW_AT_byte_size   : 12
    <618>   DW_AT_decl_file   : 7
    <619>   DW_AT_decl_line   : 296
    <61b>   DW_AT_decl_column : 8
    <61c>   DW_AT_sibling     : <0x64b>
 <2><620>: Abbrev Number: 18 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0x4ff88): _next
    <625>   DW_AT_decl_file   : 7
    <626>   DW_AT_decl_line   : 298
    <628>   DW_AT_decl_column : 17
    <629>   DW_AT_type        : <0x64b>
    <62d>   DW_AT_data_member_location: 0
 <2><62e>: Abbrev Number: 18 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x3290a): _niobs
    <633>   DW_AT_decl_file   : 7
    <634>   DW_AT_decl_line   : 299
    <636>   DW_AT_decl_column : 7
    <637>   DW_AT_type        : <0x29>
    <63b>   DW_AT_data_member_location: 4
 <2><63c>: Abbrev Number: 18 (DW_TAG_member)
    <63d>   DW_AT_name        : (indirect string, offset: 0x4418b): _iobs
    <641>   DW_AT_decl_file   : 7
    <642>   DW_AT_decl_line   : 300
    <644>   DW_AT_decl_column : 11
    <645>   DW_AT_type        : <0x651>
    <649>   DW_AT_data_member_location: 8
 <2><64a>: Abbrev Number: 0
 <1><64b>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <64c>   DW_AT_byte_size   : 4
    <64d>   DW_AT_type        : <0x612>
 <1><651>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <652>   DW_AT_byte_size   : 4
    <653>   DW_AT_type        : <0x605>
 <1><657>: Abbrev Number: 17 (DW_TAG_structure_type)
    <658>   DW_AT_name        : (indirect string, offset: 0x2ef0b): _rand48
    <65c>   DW_AT_byte_size   : 24
    <65d>   DW_AT_decl_file   : 7
    <65e>   DW_AT_decl_line   : 324
    <660>   DW_AT_decl_column : 8
    <661>   DW_AT_sibling     : <0x69e>
 <2><665>: Abbrev Number: 18 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0x83a37): _seed
    <66a>   DW_AT_decl_file   : 7
    <66b>   DW_AT_decl_line   : 325
    <66d>   DW_AT_decl_column : 18
    <66e>   DW_AT_type        : <0x69e>
    <672>   DW_AT_data_member_location: 0
 <2><673>: Abbrev Number: 18 (DW_TAG_member)
    <674>   DW_AT_name        : (indirect string, offset: 0xba6d): _mult
    <678>   DW_AT_decl_file   : 7
    <679>   DW_AT_decl_line   : 326
    <67b>   DW_AT_decl_column : 18
    <67c>   DW_AT_type        : <0x69e>
    <680>   DW_AT_data_member_location: 6
 <2><681>: Abbrev Number: 18 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x457a4): _add
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 327
    <689>   DW_AT_decl_column : 18
    <68a>   DW_AT_type        : <0x72>
    <68e>   DW_AT_data_member_location: 12
 <2><68f>: Abbrev Number: 18 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x4ff83): _rand_next
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 330
    <697>   DW_AT_decl_column : 36
    <698>   DW_AT_type        : <0x93>
    <69c>   DW_AT_data_member_location: 16
 <2><69d>: Abbrev Number: 0
 <1><69e>: Abbrev Number: 9 (DW_TAG_array_type)
    <69f>   DW_AT_type        : <0x72>
    <6a3>   DW_AT_sibling     : <0x6ae>
 <2><6a7>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <6a8>   DW_AT_type        : <0x30>
    <6ac>   DW_AT_upper_bound : 2
 <2><6ad>: Abbrev Number: 0
 <1><6ae>: Abbrev Number: 17 (DW_TAG_structure_type)
    <6af>   DW_AT_name        : (indirect string, offset: 0x3d2ad): _mprec
    <6b3>   DW_AT_byte_size   : 16
    <6b4>   DW_AT_decl_file   : 7
    <6b5>   DW_AT_decl_line   : 349
    <6b7>   DW_AT_decl_column : 8
    <6b8>   DW_AT_sibling     : <0x6f5>
 <2><6bc>: Abbrev Number: 18 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x85de2): _result
    <6c1>   DW_AT_decl_file   : 7
    <6c2>   DW_AT_decl_line   : 352
    <6c4>   DW_AT_decl_column : 19
    <6c5>   DW_AT_type        : <0x1f4>
    <6c9>   DW_AT_data_member_location: 0
 <2><6ca>: Abbrev Number: 18 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x5898f): _result_k
    <6cf>   DW_AT_decl_file   : 7
    <6d0>   DW_AT_decl_line   : 353
    <6d2>   DW_AT_decl_column : 7
    <6d3>   DW_AT_type        : <0x29>
    <6d7>   DW_AT_data_member_location: 4
 <2><6d8>: Abbrev Number: 18 (DW_TAG_member)
    <6d9>   DW_AT_name        : (indirect string, offset: 0x40487): _p5s
    <6dd>   DW_AT_decl_file   : 7
    <6de>   DW_AT_decl_line   : 354
    <6e0>   DW_AT_decl_column : 19
    <6e1>   DW_AT_type        : <0x1f4>
    <6e5>   DW_AT_data_member_location: 8
 <2><6e6>: Abbrev Number: 18 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x4d9ed): _freelist
    <6eb>   DW_AT_decl_file   : 7
    <6ec>   DW_AT_decl_line   : 355
    <6ee>   DW_AT_decl_column : 20
    <6ef>   DW_AT_type        : <0x6f5>
    <6f3>   DW_AT_data_member_location: 12
 <2><6f4>: Abbrev Number: 0
 <1><6f5>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <6f6>   DW_AT_byte_size   : 4
    <6f7>   DW_AT_type        : <0x1f4>
 <1><6fb>: Abbrev Number: 17 (DW_TAG_structure_type)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x4044f): _misc_reent
    <700>   DW_AT_byte_size   : 80
    <701>   DW_AT_decl_file   : 7
    <702>   DW_AT_decl_line   : 359
    <704>   DW_AT_decl_column : 8
    <705>   DW_AT_sibling     : <0x7a4>
 <2><709>: Abbrev Number: 18 (DW_TAG_member)
    <70a>   DW_AT_name        : (indirect string, offset: 0x7b08b): _strtok_last
    <70e>   DW_AT_decl_file   : 7
    <70f>   DW_AT_decl_line   : 362
    <711>   DW_AT_decl_column : 9
    <712>   DW_AT_type        : <0x565>
    <716>   DW_AT_data_member_location: 0
 <2><717>: Abbrev Number: 18 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0x3b6b5): _mblen_state
    <71c>   DW_AT_decl_file   : 7
    <71d>   DW_AT_decl_line   : 363
    <71f>   DW_AT_decl_column : 14
    <720>   DW_AT_type        : <0x15f>
    <724>   DW_AT_data_member_location: 4
 <2><725>: Abbrev Number: 18 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x7b098): _wctomb_state
    <72a>   DW_AT_decl_file   : 7
    <72b>   DW_AT_decl_line   : 364
    <72d>   DW_AT_decl_column : 14
    <72e>   DW_AT_type        : <0x15f>
    <732>   DW_AT_data_member_location: 12
 <2><733>: Abbrev Number: 18 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x734c3): _mbtowc_state
    <738>   DW_AT_decl_file   : 7
    <739>   DW_AT_decl_line   : 365
    <73b>   DW_AT_decl_column : 14
    <73c>   DW_AT_type        : <0x15f>
    <740>   DW_AT_data_member_location: 20
 <2><741>: Abbrev Number: 18 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0x21b5f): _l64a_buf
    <746>   DW_AT_decl_file   : 7
    <747>   DW_AT_decl_line   : 366
    <749>   DW_AT_decl_column : 8
    <74a>   DW_AT_type        : <0x7a4>
    <74e>   DW_AT_data_member_location: 28
 <2><74f>: Abbrev Number: 18 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x7a2f4): _getdate_err
    <754>   DW_AT_decl_file   : 7
    <755>   DW_AT_decl_line   : 367
    <757>   DW_AT_decl_column : 7
    <758>   DW_AT_type        : <0x29>
    <75c>   DW_AT_data_member_location: 36
 <2><75d>: Abbrev Number: 18 (DW_TAG_member)
    <75e>   DW_AT_name        : (indirect string, offset: 0x414c2): _mbrlen_state
    <762>   DW_AT_decl_file   : 7
    <763>   DW_AT_decl_line   : 368
    <765>   DW_AT_decl_column : 14
    <766>   DW_AT_type        : <0x15f>
    <76a>   DW_AT_data_member_location: 40
 <2><76b>: Abbrev Number: 18 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x7a5f2): _mbrtowc_state
    <770>   DW_AT_decl_file   : 7
    <771>   DW_AT_decl_line   : 369
    <773>   DW_AT_decl_column : 14
    <774>   DW_AT_type        : <0x15f>
    <778>   DW_AT_data_member_location: 48
 <2><779>: Abbrev Number: 18 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0x264b3): _mbsrtowcs_state
    <77e>   DW_AT_decl_file   : 7
    <77f>   DW_AT_decl_line   : 370
    <781>   DW_AT_decl_column : 14
    <782>   DW_AT_type        : <0x15f>
    <786>   DW_AT_data_member_location: 56
 <2><787>: Abbrev Number: 18 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0x29d68): _wcrtomb_state
    <78c>   DW_AT_decl_file   : 7
    <78d>   DW_AT_decl_line   : 371
    <78f>   DW_AT_decl_column : 14
    <790>   DW_AT_type        : <0x15f>
    <794>   DW_AT_data_member_location: 64
 <2><795>: Abbrev Number: 18 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x4c3a0): _wcsrtombs_state
    <79a>   DW_AT_decl_file   : 7
    <79b>   DW_AT_decl_line   : 372
    <79d>   DW_AT_decl_column : 14
    <79e>   DW_AT_type        : <0x15f>
    <7a2>   DW_AT_data_member_location: 72
 <2><7a3>: Abbrev Number: 0
 <1><7a4>: Abbrev Number: 9 (DW_TAG_array_type)
    <7a5>   DW_AT_type        : <0x56b>
    <7a9>   DW_AT_sibling     : <0x7b4>
 <2><7ad>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <7ae>   DW_AT_type        : <0x30>
    <7b2>   DW_AT_upper_bound : 7
 <2><7b3>: Abbrev Number: 0
 <1><7b4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x73d58): __locale_t
    <7b9>   DW_AT_declaration : 1
 <1><7b9>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7ba>   DW_AT_byte_size   : 4
    <7bb>   DW_AT_type        : <0x7b4>
 <1><7bf>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7c0>   DW_AT_byte_size   : 4
    <7c1>   DW_AT_type        : <0x6ae>
 <1><7c5>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7c6>   DW_AT_prototyped  : 1
    <7c6>   DW_AT_sibling     : <0x7d0>
 <2><7ca>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <7cb>   DW_AT_type        : <0x3fe>
 <2><7cf>: Abbrev Number: 0
 <1><7d0>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7d1>   DW_AT_byte_size   : 4
    <7d2>   DW_AT_type        : <0x7c5>
 <1><7d6>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7d7>   DW_AT_byte_size   : 4
    <7d8>   DW_AT_type        : <0x657>
 <1><7dc>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7dd>   DW_AT_byte_size   : 4
    <7de>   DW_AT_type        : <0x20a>
 <1><7e2>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <7e3>   DW_AT_prototyped  : 1
    <7e3>   DW_AT_sibling     : <0x7ed>
 <2><7e7>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <7e8>   DW_AT_type        : <0x29>
 <2><7ec>: Abbrev Number: 0
 <1><7ed>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7ee>   DW_AT_byte_size   : 4
    <7ef>   DW_AT_type        : <0x7f3>
 <1><7f3>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7f4>   DW_AT_byte_size   : 4
    <7f5>   DW_AT_type        : <0x7e2>
 <1><7f9>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7fa>   DW_AT_byte_size   : 4
    <7fb>   DW_AT_type        : <0x6fb>
 <1><7ff>: Abbrev Number: 17 (DW_TAG_structure_type)
    <800>   DW_AT_name        : (indirect string, offset: 0x71187): xSTATIC_LIST_ITEM
    <804>   DW_AT_byte_size   : 20
    <805>   DW_AT_decl_file   : 9
    <806>   DW_AT_decl_line   : 948
    <808>   DW_AT_decl_column : 8
    <809>   DW_AT_sibling     : <0x82a>
 <2><80d>: Abbrev Number: 18 (DW_TAG_member)
    <80e>   DW_AT_name        : (indirect string, offset: 0x1b88c): xDummy1
    <812>   DW_AT_decl_file   : 9
    <813>   DW_AT_decl_line   : 950
    <815>   DW_AT_decl_column : 13
    <816>   DW_AT_type        : <0xd8>
    <81a>   DW_AT_data_member_location: 0
 <2><81b>: Abbrev Number: 18 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0x30caf): pvDummy2
    <820>   DW_AT_decl_file   : 9
    <821>   DW_AT_decl_line   : 951
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0x82a>
    <828>   DW_AT_data_member_location: 4
 <2><829>: Abbrev Number: 0
 <1><82a>: Abbrev Number: 9 (DW_TAG_array_type)
    <82b>   DW_AT_type        : <0xbe>
    <82f>   DW_AT_sibling     : <0x83a>
 <2><833>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <834>   DW_AT_type        : <0x30>
    <838>   DW_AT_upper_bound : 3
 <2><839>: Abbrev Number: 0
 <1><83a>: Abbrev Number: 6 (DW_TAG_typedef)
    <83b>   DW_AT_name        : (indirect string, offset: 0x30e40): StaticListItem_t
    <83f>   DW_AT_decl_file   : 9
    <840>   DW_AT_decl_line   : 953
    <842>   DW_AT_decl_column : 34
    <843>   DW_AT_type        : <0x7ff>
 <1><847>: Abbrev Number: 17 (DW_TAG_structure_type)
    <848>   DW_AT_name        : (indirect string, offset: 0x5a1ff): xSTATIC_TCB
    <84c>   DW_AT_byte_size   : 180
    <84d>   DW_AT_decl_file   : 9
    <84e>   DW_AT_decl_line   : 984
    <850>   DW_AT_decl_column : 16
    <851>   DW_AT_sibling     : <0x8e2>
 <2><855>: Abbrev Number: 18 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0x1b88b): pxDummy1
    <85a>   DW_AT_decl_file   : 9
    <85b>   DW_AT_decl_line   : 986
    <85d>   DW_AT_decl_column : 11
    <85e>   DW_AT_type        : <0xbe>
    <862>   DW_AT_data_member_location: 0
 <2><863>: Abbrev Number: 18 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x19e5f): xDummy3
    <868>   DW_AT_decl_file   : 9
    <869>   DW_AT_decl_line   : 990
    <86b>   DW_AT_decl_column : 19
    <86c>   DW_AT_type        : <0x8e2>
    <870>   DW_AT_data_member_location: 4
 <2><871>: Abbrev Number: 18 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0x12b1b): uxDummy5
    <876>   DW_AT_decl_file   : 9
    <877>   DW_AT_decl_line   : 991
    <879>   DW_AT_decl_column : 16
    <87a>   DW_AT_type        : <0xcc>
    <87e>   DW_AT_data_member_location: 44
 <2><87f>: Abbrev Number: 18 (DW_TAG_member)
    <880>   DW_AT_name        : (indirect string, offset: 0x1b8ae): pxDummy6
    <884>   DW_AT_decl_file   : 9
    <885>   DW_AT_decl_line   : 992
    <887>   DW_AT_decl_column : 11
    <888>   DW_AT_type        : <0xbe>
    <88c>   DW_AT_data_member_location: 48
 <2><88d>: Abbrev Number: 18 (DW_TAG_member)
    <88e>   DW_AT_name        : (indirect string, offset: 0x2fc59): ucDummy7
    <892>   DW_AT_decl_file   : 9
    <893>   DW_AT_decl_line   : 993
    <895>   DW_AT_decl_column : 13
    <896>   DW_AT_type        : <0x8f2>
    <89a>   DW_AT_data_member_location: 52
 <2><89b>: Abbrev Number: 18 (DW_TAG_member)
    <89c>   DW_AT_name        : (indirect string, offset: 0x1dc65): uxDummy12
    <8a0>   DW_AT_decl_file   : 9
    <8a1>   DW_AT_decl_line   : 1004
    <8a3>   DW_AT_decl_column : 16
    <8a4>   DW_AT_type        : <0x902>
    <8a8>   DW_AT_data_member_location: 68
 <2><8a9>: Abbrev Number: 18 (DW_TAG_member)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x6bc08): xDummy17
    <8ae>   DW_AT_decl_file   : 9
    <8af>   DW_AT_decl_line   : 1016
    <8b1>   DW_AT_decl_column : 17
    <8b2>   DW_AT_type        : <0x2bb>
    <8b6>   DW_AT_data_member_location: 76
 <2><8b7>: Abbrev Number: 18 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x1381e): ulDummy18
    <8bc>   DW_AT_decl_file   : 9
    <8bd>   DW_AT_decl_line   : 1019
    <8bf>   DW_AT_decl_column : 14
    <8c0>   DW_AT_type        : <0xb2>
    <8c4>   DW_AT_data_member_location: 172
 <2><8c5>: Abbrev Number: 18 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x2976f): ucDummy19
    <8ca>   DW_AT_decl_file   : 9
    <8cb>   DW_AT_decl_line   : 1020
    <8cd>   DW_AT_decl_column : 13
    <8ce>   DW_AT_type        : <0x9a>
    <8d2>   DW_AT_data_member_location: 176
 <2><8d3>: Abbrev Number: 18 (DW_TAG_member)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x79b4d): uxDummy20
    <8d8>   DW_AT_decl_file   : 9
    <8d9>   DW_AT_decl_line   : 1023
    <8db>   DW_AT_decl_column : 13
    <8dc>   DW_AT_type        : <0x9a>
    <8e0>   DW_AT_data_member_location: 177
 <2><8e1>: Abbrev Number: 0
 <1><8e2>: Abbrev Number: 9 (DW_TAG_array_type)
    <8e3>   DW_AT_type        : <0x83a>
    <8e7>   DW_AT_sibling     : <0x8f2>
 <2><8eb>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <8ec>   DW_AT_type        : <0x30>
    <8f0>   DW_AT_upper_bound : 1
 <2><8f1>: Abbrev Number: 0
 <1><8f2>: Abbrev Number: 9 (DW_TAG_array_type)
    <8f3>   DW_AT_type        : <0x9a>
    <8f7>   DW_AT_sibling     : <0x902>
 <2><8fb>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <8fc>   DW_AT_type        : <0x30>
    <900>   DW_AT_upper_bound : 15
 <2><901>: Abbrev Number: 0
 <1><902>: Abbrev Number: 9 (DW_TAG_array_type)
    <903>   DW_AT_type        : <0xcc>
    <907>   DW_AT_sibling     : <0x912>
 <2><90b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <90c>   DW_AT_type        : <0x30>
    <910>   DW_AT_upper_bound : 1
 <2><911>: Abbrev Number: 0
 <1><912>: Abbrev Number: 6 (DW_TAG_typedef)
    <913>   DW_AT_name        : (indirect string, offset: 0x42bc9): StaticTask_t
    <917>   DW_AT_decl_file   : 9
    <918>   DW_AT_decl_line   : 1030
    <91a>   DW_AT_decl_column : 3
    <91b>   DW_AT_type        : <0x847>
 <1><91f>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <920>   DW_AT_byte_size   : 4
    <921>   DW_AT_type        : <0xc0>
 <1><925>: Abbrev Number: 24 (DW_TAG_variable)
    <926>   DW_AT_name        : (indirect string, offset: 0x472e5): xIdleTaskTCBBuffer
    <92a>   DW_AT_decl_file   : 1
    <92b>   DW_AT_decl_line   : 59
    <92c>   DW_AT_decl_column : 21
    <92d>   DW_AT_type        : <0x912>
    <931>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><937>: Abbrev Number: 9 (DW_TAG_array_type)
    <938>   DW_AT_type        : <0xc0>
    <93c>   DW_AT_sibling     : <0x947>
 <2><940>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <941>   DW_AT_type        : <0x30>
    <945>   DW_AT_upper_bound : 127
 <2><946>: Abbrev Number: 0
 <1><947>: Abbrev Number: 24 (DW_TAG_variable)
    <948>   DW_AT_name        : (indirect string, offset: 0x3287d): xIdleStack
    <94c>   DW_AT_decl_file   : 1
    <94d>   DW_AT_decl_line   : 60
    <94e>   DW_AT_decl_column : 20
    <94f>   DW_AT_type        : <0x937>
    <953>   DW_AT_location    : 5 byte block: 3 44 1 0 20 	(DW_OP_addr: 20000144)
 <1><959>: Abbrev Number: 25 (DW_TAG_subprogram)
    <95a>   DW_AT_external    : 1
    <95a>   DW_AT_name        : (indirect string, offset: 0x8341a): vApplicationGetIdleTaskMemory
    <95e>   DW_AT_decl_file   : 1
    <95f>   DW_AT_decl_line   : 62
    <960>   DW_AT_decl_column : 6
    <961>   DW_AT_prototyped  : 1
    <961>   DW_AT_low_pc      : 0x8000150
    <965>   DW_AT_high_pc     : 0x30
    <969>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <96b>   DW_AT_GNU_all_call_sites: 1
    <96b>   DW_AT_sibling     : <0x99d>
 <2><96f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <970>   DW_AT_name        : (indirect string, offset: 0x472e3): ppxIdleTaskTCBBuffer
    <974>   DW_AT_decl_file   : 1
    <975>   DW_AT_decl_line   : 62
    <976>   DW_AT_decl_column : 52
    <977>   DW_AT_type        : <0x99d>
    <97b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><97e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <97f>   DW_AT_name        : (indirect string, offset: 0x4dbf7): ppxIdleTaskStackBuffer
    <983>   DW_AT_decl_file   : 1
    <984>   DW_AT_decl_line   : 62
    <985>   DW_AT_decl_column : 88
    <986>   DW_AT_type        : <0x9a9>
    <98a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><98d>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <98e>   DW_AT_name        : (indirect string, offset: 0x49b6a): pulIdleTaskStackSize
    <992>   DW_AT_decl_file   : 1
    <993>   DW_AT_decl_line   : 62
    <994>   DW_AT_decl_column : 122
    <995>   DW_AT_type        : <0x9af>
    <999>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><99c>: Abbrev Number: 0
 <1><99d>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <99e>   DW_AT_byte_size   : 4
    <99f>   DW_AT_type        : <0x9a3>
 <1><9a3>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9a4>   DW_AT_byte_size   : 4
    <9a5>   DW_AT_type        : <0x912>
 <1><9a9>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9aa>   DW_AT_byte_size   : 4
    <9ab>   DW_AT_type        : <0x91f>
 <1><9af>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9b0>   DW_AT_byte_size   : 4
    <9b1>   DW_AT_type        : <0xb2>
 <1><9b5>: Abbrev Number: 0
  Compilation Unit @ offset 0x9b6:
   Length:        0x1619 (32-bit)
   Version:       4
   Abbrev Offset: 0x169
   Pointer Size:  4
 <0><9c1>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <9c2>   DW_AT_producer    : (indirect string, offset: 0x445ad): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <9c6>   DW_AT_language    : 12	(ANSI C99)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x89484): ../Core/Src/main.c
    <9cb>   DW_AT_comp_dir    : (indirect string, offset: 0x44e36): D:/STM32/STM32_CUBEIDE/_RTOS/Debug
    <9cf>   DW_AT_ranges      : 0x10
    <9d3>   DW_AT_low_pc      : 0x0
    <9d7>   DW_AT_stmt_list   : 0x882
    <9db>   DW_AT_GNU_macros  : 0x164ab
 <1><9df>: Abbrev Number: 2 (DW_TAG_base_type)
    <9e0>   DW_AT_byte_size   : 1
    <9e1>   DW_AT_encoding    : 6	(signed char)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x43996): signed char
 <1><9e6>: Abbrev Number: 3 (DW_TAG_typedef)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x27873): __uint8_t
    <9eb>   DW_AT_decl_file   : 3
    <9ec>   DW_AT_decl_line   : 43
    <9ed>   DW_AT_decl_column : 24
    <9ee>   DW_AT_type        : <0x9f2>
 <1><9f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <9f3>   DW_AT_byte_size   : 1
    <9f4>   DW_AT_encoding    : 8	(unsigned char)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x1b87d): unsigned char
 <1><9f9>: Abbrev Number: 2 (DW_TAG_base_type)
    <9fa>   DW_AT_byte_size   : 2
    <9fb>   DW_AT_encoding    : 5	(signed)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x64835): short int
 <1><a00>: Abbrev Number: 3 (DW_TAG_typedef)
    <a01>   DW_AT_name        : (indirect string, offset: 0x6e671): __uint16_t
    <a05>   DW_AT_decl_file   : 3
    <a06>   DW_AT_decl_line   : 57
    <a07>   DW_AT_decl_column : 25
    <a08>   DW_AT_type        : <0xa0c>
 <1><a0c>: Abbrev Number: 2 (DW_TAG_base_type)
    <a0d>   DW_AT_byte_size   : 2
    <a0e>   DW_AT_encoding    : 7	(unsigned)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x2c203): short unsigned int
 <1><a13>: Abbrev Number: 2 (DW_TAG_base_type)
    <a14>   DW_AT_byte_size   : 4
    <a15>   DW_AT_encoding    : 5	(signed)
    <a16>   DW_AT_name        : (indirect string, offset: 0xbc5c): long int
 <1><a1a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x55b01): __uint32_t
    <a1f>   DW_AT_decl_file   : 3
    <a20>   DW_AT_decl_line   : 79
    <a21>   DW_AT_decl_column : 25
    <a22>   DW_AT_type        : <0xa26>
 <1><a26>: Abbrev Number: 2 (DW_TAG_base_type)
    <a27>   DW_AT_byte_size   : 4
    <a28>   DW_AT_encoding    : 7	(unsigned)
    <a29>   DW_AT_name        : (indirect string, offset: 0x1fe3a): long unsigned int
 <1><a2d>: Abbrev Number: 2 (DW_TAG_base_type)
    <a2e>   DW_AT_byte_size   : 8
    <a2f>   DW_AT_encoding    : 5	(signed)
    <a30>   DW_AT_name        : (indirect string, offset: 0x3dfe5): long long int
 <1><a34>: Abbrev Number: 2 (DW_TAG_base_type)
    <a35>   DW_AT_byte_size   : 8
    <a36>   DW_AT_encoding    : 7	(unsigned)
    <a37>   DW_AT_name        : (indirect string, offset: 0x1c041): long long unsigned int
 <1><a3b>: Abbrev Number: 4 (DW_TAG_base_type)
    <a3c>   DW_AT_byte_size   : 4
    <a3d>   DW_AT_encoding    : 5	(signed)
    <a3e>   DW_AT_name        : int
 <1><a42>: Abbrev Number: 2 (DW_TAG_base_type)
    <a43>   DW_AT_byte_size   : 4
    <a44>   DW_AT_encoding    : 7	(unsigned)
    <a45>   DW_AT_name        : (indirect string, offset: 0xb603): unsigned int
 <1><a49>: Abbrev Number: 3 (DW_TAG_typedef)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x27875): uint8_t
    <a4e>   DW_AT_decl_file   : 4
    <a4f>   DW_AT_decl_line   : 24
    <a50>   DW_AT_decl_column : 19
    <a51>   DW_AT_type        : <0x9e6>
 <1><a55>: Abbrev Number: 3 (DW_TAG_typedef)
    <a56>   DW_AT_name        : (indirect string, offset: 0x62874): uint16_t
    <a5a>   DW_AT_decl_file   : 4
    <a5b>   DW_AT_decl_line   : 36
    <a5c>   DW_AT_decl_column : 20
    <a5d>   DW_AT_type        : <0xa00>
 <1><a61>: Abbrev Number: 3 (DW_TAG_typedef)
    <a62>   DW_AT_name        : (indirect string, offset: 0x6220b): uint32_t
    <a66>   DW_AT_decl_file   : 4
    <a67>   DW_AT_decl_line   : 48
    <a68>   DW_AT_decl_column : 20
    <a69>   DW_AT_type        : <0xa1a>
 <1><a6d>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <a6e>   DW_AT_type        : <0xa61>
 <1><a72>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a73>   DW_AT_byte_size   : 16
    <a74>   DW_AT_decl_file   : 5
    <a75>   DW_AT_decl_line   : 290
    <a77>   DW_AT_decl_column : 9
    <a78>   DW_AT_sibling     : <0xab5>
 <2><a7c>: Abbrev Number: 7 (DW_TAG_member)
    <a7d>   DW_AT_name        : CCR
    <a81>   DW_AT_decl_file   : 5
    <a82>   DW_AT_decl_line   : 292
    <a84>   DW_AT_decl_column : 17
    <a85>   DW_AT_type        : <0xa6d>
    <a89>   DW_AT_data_member_location: 0
 <2><a8a>: Abbrev Number: 8 (DW_TAG_member)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x87b7e): CNDTR
    <a8f>   DW_AT_decl_file   : 5
    <a90>   DW_AT_decl_line   : 293
    <a92>   DW_AT_decl_column : 17
    <a93>   DW_AT_type        : <0xa6d>
    <a97>   DW_AT_data_member_location: 4
 <2><a98>: Abbrev Number: 8 (DW_TAG_member)
    <a99>   DW_AT_name        : (indirect string, offset: 0x89706): CPAR
    <a9d>   DW_AT_decl_file   : 5
    <a9e>   DW_AT_decl_line   : 294
    <aa0>   DW_AT_decl_column : 17
    <aa1>   DW_AT_type        : <0xa6d>
    <aa5>   DW_AT_data_member_location: 8
 <2><aa6>: Abbrev Number: 8 (DW_TAG_member)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x884e4): CMAR
    <aab>   DW_AT_decl_file   : 5
    <aac>   DW_AT_decl_line   : 295
    <aae>   DW_AT_decl_column : 17
    <aaf>   DW_AT_type        : <0xa6d>
    <ab3>   DW_AT_data_member_location: 12
 <2><ab4>: Abbrev Number: 0
 <1><ab5>: Abbrev Number: 9 (DW_TAG_typedef)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x890ba): DMA_Channel_TypeDef
    <aba>   DW_AT_decl_file   : 5
    <abb>   DW_AT_decl_line   : 296
    <abd>   DW_AT_decl_column : 3
    <abe>   DW_AT_type        : <0xa72>
 <1><ac2>: Abbrev Number: 6 (DW_TAG_structure_type)
    <ac3>   DW_AT_byte_size   : 8
    <ac4>   DW_AT_decl_file   : 5
    <ac5>   DW_AT_decl_line   : 298
    <ac7>   DW_AT_decl_column : 9
    <ac8>   DW_AT_sibling     : <0xae9>
 <2><acc>: Abbrev Number: 7 (DW_TAG_member)
    <acd>   DW_AT_name        : ISR
    <ad1>   DW_AT_decl_file   : 5
    <ad2>   DW_AT_decl_line   : 300
    <ad4>   DW_AT_decl_column : 17
    <ad5>   DW_AT_type        : <0xa6d>
    <ad9>   DW_AT_data_member_location: 0
 <2><ada>: Abbrev Number: 8 (DW_TAG_member)
    <adb>   DW_AT_name        : (indirect string, offset: 0x88b75): IFCR
    <adf>   DW_AT_decl_file   : 5
    <ae0>   DW_AT_decl_line   : 301
    <ae2>   DW_AT_decl_column : 17
    <ae3>   DW_AT_type        : <0xa6d>
    <ae7>   DW_AT_data_member_location: 4
 <2><ae8>: Abbrev Number: 0
 <1><ae9>: Abbrev Number: 9 (DW_TAG_typedef)
    <aea>   DW_AT_name        : (indirect string, offset: 0x87a85): DMA_TypeDef
    <aee>   DW_AT_decl_file   : 5
    <aef>   DW_AT_decl_line   : 302
    <af1>   DW_AT_decl_column : 3
    <af2>   DW_AT_type        : <0xac2>
 <1><af6>: Abbrev Number: 6 (DW_TAG_structure_type)
    <af7>   DW_AT_byte_size   : 28
    <af8>   DW_AT_decl_file   : 5
    <af9>   DW_AT_decl_line   : 357
    <afb>   DW_AT_decl_column : 9
    <afc>   DW_AT_sibling     : <0xb63>
 <2><b00>: Abbrev Number: 7 (DW_TAG_member)
    <b01>   DW_AT_name        : CRL
    <b05>   DW_AT_decl_file   : 5
    <b06>   DW_AT_decl_line   : 359
    <b08>   DW_AT_decl_column : 17
    <b09>   DW_AT_type        : <0xa6d>
    <b0d>   DW_AT_data_member_location: 0
 <2><b0e>: Abbrev Number: 7 (DW_TAG_member)
    <b0f>   DW_AT_name        : CRH
    <b13>   DW_AT_decl_file   : 5
    <b14>   DW_AT_decl_line   : 360
    <b16>   DW_AT_decl_column : 17
    <b17>   DW_AT_type        : <0xa6d>
    <b1b>   DW_AT_data_member_location: 4
 <2><b1c>: Abbrev Number: 7 (DW_TAG_member)
    <b1d>   DW_AT_name        : IDR
    <b21>   DW_AT_decl_file   : 5
    <b22>   DW_AT_decl_line   : 361
    <b24>   DW_AT_decl_column : 17
    <b25>   DW_AT_type        : <0xa6d>
    <b29>   DW_AT_data_member_location: 8
 <2><b2a>: Abbrev Number: 7 (DW_TAG_member)
    <b2b>   DW_AT_name        : ODR
    <b2f>   DW_AT_decl_file   : 5
    <b30>   DW_AT_decl_line   : 362
    <b32>   DW_AT_decl_column : 17
    <b33>   DW_AT_type        : <0xa6d>
    <b37>   DW_AT_data_member_location: 12
 <2><b38>: Abbrev Number: 8 (DW_TAG_member)
    <b39>   DW_AT_name        : (indirect string, offset: 0x875b5): BSRR
    <b3d>   DW_AT_decl_file   : 5
    <b3e>   DW_AT_decl_line   : 363
    <b40>   DW_AT_decl_column : 17
    <b41>   DW_AT_type        : <0xa6d>
    <b45>   DW_AT_data_member_location: 16
 <2><b46>: Abbrev Number: 7 (DW_TAG_member)
    <b47>   DW_AT_name        : BRR
    <b4b>   DW_AT_decl_file   : 5
    <b4c>   DW_AT_decl_line   : 364
    <b4e>   DW_AT_decl_column : 17
    <b4f>   DW_AT_type        : <0xa6d>
    <b53>   DW_AT_data_member_location: 20
 <2><b54>: Abbrev Number: 8 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0x8929c): LCKR
    <b59>   DW_AT_decl_file   : 5
    <b5a>   DW_AT_decl_line   : 365
    <b5c>   DW_AT_decl_column : 17
    <b5d>   DW_AT_type        : <0xa6d>
    <b61>   DW_AT_data_member_location: 24
 <2><b62>: Abbrev Number: 0
 <1><b63>: Abbrev Number: 9 (DW_TAG_typedef)
    <b64>   DW_AT_name        : (indirect string, offset: 0x8970b): GPIO_TypeDef
    <b68>   DW_AT_decl_file   : 5
    <b69>   DW_AT_decl_line   : 366
    <b6b>   DW_AT_decl_column : 3
    <b6c>   DW_AT_type        : <0xaf6>
 <1><b70>: Abbrev Number: 6 (DW_TAG_structure_type)
    <b71>   DW_AT_byte_size   : 40
    <b72>   DW_AT_decl_file   : 5
    <b73>   DW_AT_decl_line   : 423
    <b75>   DW_AT_decl_column : 9
    <b76>   DW_AT_sibling     : <0xc06>
 <2><b7a>: Abbrev Number: 7 (DW_TAG_member)
    <b7b>   DW_AT_name        : CR
    <b7e>   DW_AT_decl_file   : 5
    <b7f>   DW_AT_decl_line   : 425
    <b81>   DW_AT_decl_column : 17
    <b82>   DW_AT_type        : <0xa6d>
    <b86>   DW_AT_data_member_location: 0
 <2><b87>: Abbrev Number: 8 (DW_TAG_member)
    <b88>   DW_AT_name        : (indirect string, offset: 0x886ae): CFGR
    <b8c>   DW_AT_decl_file   : 5
    <b8d>   DW_AT_decl_line   : 426
    <b8f>   DW_AT_decl_column : 17
    <b90>   DW_AT_type        : <0xa6d>
    <b94>   DW_AT_data_member_location: 4
 <2><b95>: Abbrev Number: 7 (DW_TAG_member)
    <b96>   DW_AT_name        : CIR
    <b9a>   DW_AT_decl_file   : 5
    <b9b>   DW_AT_decl_line   : 427
    <b9d>   DW_AT_decl_column : 17
    <b9e>   DW_AT_type        : <0xa6d>
    <ba2>   DW_AT_data_member_location: 8
 <2><ba3>: Abbrev Number: 8 (DW_TAG_member)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x87eb4): APB2RSTR
    <ba8>   DW_AT_decl_file   : 5
    <ba9>   DW_AT_decl_line   : 428
    <bab>   DW_AT_decl_column : 17
    <bac>   DW_AT_type        : <0xa6d>
    <bb0>   DW_AT_data_member_location: 12
 <2><bb1>: Abbrev Number: 8 (DW_TAG_member)
    <bb2>   DW_AT_name        : (indirect string, offset: 0x8702e): APB1RSTR
    <bb6>   DW_AT_decl_file   : 5
    <bb7>   DW_AT_decl_line   : 429
    <bb9>   DW_AT_decl_column : 17
    <bba>   DW_AT_type        : <0xa6d>
    <bbe>   DW_AT_data_member_location: 16
 <2><bbf>: Abbrev Number: 8 (DW_TAG_member)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x86fda): AHBENR
    <bc4>   DW_AT_decl_file   : 5
    <bc5>   DW_AT_decl_line   : 430
    <bc7>   DW_AT_decl_column : 17
    <bc8>   DW_AT_type        : <0xa6d>
    <bcc>   DW_AT_data_member_location: 20
 <2><bcd>: Abbrev Number: 8 (DW_TAG_member)
    <bce>   DW_AT_name        : (indirect string, offset: 0x87063): APB2ENR
    <bd2>   DW_AT_decl_file   : 5
    <bd3>   DW_AT_decl_line   : 431
    <bd5>   DW_AT_decl_column : 17
    <bd6>   DW_AT_type        : <0xa6d>
    <bda>   DW_AT_data_member_location: 24
 <2><bdb>: Abbrev Number: 8 (DW_TAG_member)
    <bdc>   DW_AT_name        : (indirect string, offset: 0x88cfe): APB1ENR
    <be0>   DW_AT_decl_file   : 5
    <be1>   DW_AT_decl_line   : 432
    <be3>   DW_AT_decl_column : 17
    <be4>   DW_AT_type        : <0xa6d>
    <be8>   DW_AT_data_member_location: 28
 <2><be9>: Abbrev Number: 8 (DW_TAG_member)
    <bea>   DW_AT_name        : (indirect string, offset: 0x87178): BDCR
    <bee>   DW_AT_decl_file   : 5
    <bef>   DW_AT_decl_line   : 433
    <bf1>   DW_AT_decl_column : 17
    <bf2>   DW_AT_type        : <0xa6d>
    <bf6>   DW_AT_data_member_location: 32
 <2><bf7>: Abbrev Number: 7 (DW_TAG_member)
    <bf8>   DW_AT_name        : CSR
    <bfc>   DW_AT_decl_file   : 5
    <bfd>   DW_AT_decl_line   : 434
    <bff>   DW_AT_decl_column : 17
    <c00>   DW_AT_type        : <0xa6d>
    <c04>   DW_AT_data_member_location: 36
 <2><c05>: Abbrev Number: 0
 <1><c06>: Abbrev Number: 9 (DW_TAG_typedef)
    <c07>   DW_AT_name        : (indirect string, offset: 0x87ef0): RCC_TypeDef
    <c0b>   DW_AT_decl_file   : 5
    <c0c>   DW_AT_decl_line   : 437
    <c0e>   DW_AT_decl_column : 3
    <c0f>   DW_AT_type        : <0xb70>
 <1><c13>: Abbrev Number: 6 (DW_TAG_structure_type)
    <c14>   DW_AT_byte_size   : 84
    <c15>   DW_AT_decl_file   : 5
    <c16>   DW_AT_decl_line   : 476
    <c18>   DW_AT_decl_column : 9
    <c19>   DW_AT_sibling     : <0xd42>
 <2><c1d>: Abbrev Number: 7 (DW_TAG_member)
    <c1e>   DW_AT_name        : CR1
    <c22>   DW_AT_decl_file   : 5
    <c23>   DW_AT_decl_line   : 478
    <c25>   DW_AT_decl_column : 17
    <c26>   DW_AT_type        : <0xa6d>
    <c2a>   DW_AT_data_member_location: 0
 <2><c2b>: Abbrev Number: 7 (DW_TAG_member)
    <c2c>   DW_AT_name        : CR2
    <c30>   DW_AT_decl_file   : 5
    <c31>   DW_AT_decl_line   : 479
    <c33>   DW_AT_decl_column : 17
    <c34>   DW_AT_type        : <0xa6d>
    <c38>   DW_AT_data_member_location: 4
 <2><c39>: Abbrev Number: 8 (DW_TAG_member)
    <c3a>   DW_AT_name        : (indirect string, offset: 0x6125a): SMCR
    <c3e>   DW_AT_decl_file   : 5
    <c3f>   DW_AT_decl_line   : 480
    <c41>   DW_AT_decl_column : 17
    <c42>   DW_AT_type        : <0xa6d>
    <c46>   DW_AT_data_member_location: 8
 <2><c47>: Abbrev Number: 8 (DW_TAG_member)
    <c48>   DW_AT_name        : (indirect string, offset: 0x2b121): DIER
    <c4c>   DW_AT_decl_file   : 5
    <c4d>   DW_AT_decl_line   : 481
    <c4f>   DW_AT_decl_column : 17
    <c50>   DW_AT_type        : <0xa6d>
    <c54>   DW_AT_data_member_location: 12
 <2><c55>: Abbrev Number: 7 (DW_TAG_member)
    <c56>   DW_AT_name        : SR
    <c59>   DW_AT_decl_file   : 5
    <c5a>   DW_AT_decl_line   : 482
    <c5c>   DW_AT_decl_column : 17
    <c5d>   DW_AT_type        : <0xa6d>
    <c61>   DW_AT_data_member_location: 16
 <2><c62>: Abbrev Number: 7 (DW_TAG_member)
    <c63>   DW_AT_name        : EGR
    <c67>   DW_AT_decl_file   : 5
    <c68>   DW_AT_decl_line   : 483
    <c6a>   DW_AT_decl_column : 17
    <c6b>   DW_AT_type        : <0xa6d>
    <c6f>   DW_AT_data_member_location: 20
 <2><c70>: Abbrev Number: 8 (DW_TAG_member)
    <c71>   DW_AT_name        : (indirect string, offset: 0x62d05): CCMR1
    <c75>   DW_AT_decl_file   : 5
    <c76>   DW_AT_decl_line   : 484
    <c78>   DW_AT_decl_column : 17
    <c79>   DW_AT_type        : <0xa6d>
    <c7d>   DW_AT_data_member_location: 24
 <2><c7e>: Abbrev Number: 8 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x3601c): CCMR2
    <c83>   DW_AT_decl_file   : 5
    <c84>   DW_AT_decl_line   : 485
    <c86>   DW_AT_decl_column : 17
    <c87>   DW_AT_type        : <0xa6d>
    <c8b>   DW_AT_data_member_location: 28
 <2><c8c>: Abbrev Number: 8 (DW_TAG_member)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x17ff7): CCER
    <c91>   DW_AT_decl_file   : 5
    <c92>   DW_AT_decl_line   : 486
    <c94>   DW_AT_decl_column : 17
    <c95>   DW_AT_type        : <0xa6d>
    <c99>   DW_AT_data_member_location: 32
 <2><c9a>: Abbrev Number: 7 (DW_TAG_member)
    <c9b>   DW_AT_name        : CNT
    <c9f>   DW_AT_decl_file   : 5
    <ca0>   DW_AT_decl_line   : 487
    <ca2>   DW_AT_decl_column : 17
    <ca3>   DW_AT_type        : <0xa6d>
    <ca7>   DW_AT_data_member_location: 36
 <2><ca8>: Abbrev Number: 7 (DW_TAG_member)
    <ca9>   DW_AT_name        : PSC
    <cad>   DW_AT_decl_file   : 5
    <cae>   DW_AT_decl_line   : 488
    <cb0>   DW_AT_decl_column : 17
    <cb1>   DW_AT_type        : <0xa6d>
    <cb5>   DW_AT_data_member_location: 40
 <2><cb6>: Abbrev Number: 7 (DW_TAG_member)
    <cb7>   DW_AT_name        : ARR
    <cbb>   DW_AT_decl_file   : 5
    <cbc>   DW_AT_decl_line   : 489
    <cbe>   DW_AT_decl_column : 17
    <cbf>   DW_AT_type        : <0xa6d>
    <cc3>   DW_AT_data_member_location: 44
 <2><cc4>: Abbrev Number: 7 (DW_TAG_member)
    <cc5>   DW_AT_name        : RCR
    <cc9>   DW_AT_decl_file   : 5
    <cca>   DW_AT_decl_line   : 490
    <ccc>   DW_AT_decl_column : 17
    <ccd>   DW_AT_type        : <0xa6d>
    <cd1>   DW_AT_data_member_location: 48
 <2><cd2>: Abbrev Number: 8 (DW_TAG_member)
    <cd3>   DW_AT_name        : (indirect string, offset: 0x1059d): CCR1
    <cd7>   DW_AT_decl_file   : 5
    <cd8>   DW_AT_decl_line   : 491
    <cda>   DW_AT_decl_column : 17
    <cdb>   DW_AT_type        : <0xa6d>
    <cdf>   DW_AT_data_member_location: 52
 <2><ce0>: Abbrev Number: 8 (DW_TAG_member)
    <ce1>   DW_AT_name        : (indirect string, offset: 0x39022): CCR2
    <ce5>   DW_AT_decl_file   : 5
    <ce6>   DW_AT_decl_line   : 492
    <ce8>   DW_AT_decl_column : 17
    <ce9>   DW_AT_type        : <0xa6d>
    <ced>   DW_AT_data_member_location: 56
 <2><cee>: Abbrev Number: 8 (DW_TAG_member)
    <cef>   DW_AT_name        : (indirect string, offset: 0x6762b): CCR3
    <cf3>   DW_AT_decl_file   : 5
    <cf4>   DW_AT_decl_line   : 493
    <cf6>   DW_AT_decl_column : 17
    <cf7>   DW_AT_type        : <0xa6d>
    <cfb>   DW_AT_data_member_location: 60
 <2><cfc>: Abbrev Number: 8 (DW_TAG_member)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x8a00): CCR4
    <d01>   DW_AT_decl_file   : 5
    <d02>   DW_AT_decl_line   : 494
    <d04>   DW_AT_decl_column : 17
    <d05>   DW_AT_type        : <0xa6d>
    <d09>   DW_AT_data_member_location: 64
 <2><d0a>: Abbrev Number: 8 (DW_TAG_member)
    <d0b>   DW_AT_name        : (indirect string, offset: 0x3e8eb): BDTR
    <d0f>   DW_AT_decl_file   : 5
    <d10>   DW_AT_decl_line   : 495
    <d12>   DW_AT_decl_column : 17
    <d13>   DW_AT_type        : <0xa6d>
    <d17>   DW_AT_data_member_location: 68
 <2><d18>: Abbrev Number: 7 (DW_TAG_member)
    <d19>   DW_AT_name        : DCR
    <d1d>   DW_AT_decl_file   : 5
    <d1e>   DW_AT_decl_line   : 496
    <d20>   DW_AT_decl_column : 17
    <d21>   DW_AT_type        : <0xa6d>
    <d25>   DW_AT_data_member_location: 72
 <2><d26>: Abbrev Number: 8 (DW_TAG_member)
    <d27>   DW_AT_name        : (indirect string, offset: 0x7415d): DMAR
    <d2b>   DW_AT_decl_file   : 5
    <d2c>   DW_AT_decl_line   : 497
    <d2e>   DW_AT_decl_column : 17
    <d2f>   DW_AT_type        : <0xa6d>
    <d33>   DW_AT_data_member_location: 76
 <2><d34>: Abbrev Number: 7 (DW_TAG_member)
    <d35>   DW_AT_name        : OR
    <d38>   DW_AT_decl_file   : 5
    <d39>   DW_AT_decl_line   : 498
    <d3b>   DW_AT_decl_column : 17
    <d3c>   DW_AT_type        : <0xa6d>
    <d40>   DW_AT_data_member_location: 80
 <2><d41>: Abbrev Number: 0
 <1><d42>: Abbrev Number: 9 (DW_TAG_typedef)
    <d43>   DW_AT_name        : (indirect string, offset: 0x8757d): TIM_TypeDef
    <d47>   DW_AT_decl_file   : 5
    <d48>   DW_AT_decl_line   : 499
    <d4a>   DW_AT_decl_column : 2
    <d4b>   DW_AT_type        : <0xc13>
 <1><d4f>: Abbrev Number: 2 (DW_TAG_base_type)
    <d50>   DW_AT_byte_size   : 8
    <d51>   DW_AT_encoding    : 4	(float)
    <d52>   DW_AT_name        : (indirect string, offset: 0xced1): long double
 <1><d56>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <d57>   DW_AT_encoding    : 7	(unsigned)
    <d58>   DW_AT_byte_size   : 1
    <d59>   DW_AT_type        : <0x9f2>
    <d5d>   DW_AT_decl_file   : 6
    <d5e>   DW_AT_decl_line   : 39
    <d5f>   DW_AT_decl_column : 1
    <d60>   DW_AT_sibling     : <0xd7d>
 <2><d64>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d65>   DW_AT_name        : (indirect string, offset: 0x879ea): HAL_OK
    <d69>   DW_AT_const_value : 0
 <2><d6a>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d6b>   DW_AT_name        : (indirect string, offset: 0x888d4): HAL_ERROR
    <d6f>   DW_AT_const_value : 1
 <2><d70>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d71>   DW_AT_name        : (indirect string, offset: 0x871ec): HAL_BUSY
    <d75>   DW_AT_const_value : 2
 <2><d76>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d77>   DW_AT_name        : (indirect string, offset: 0x877a7): HAL_TIMEOUT
    <d7b>   DW_AT_const_value : 3
 <2><d7c>: Abbrev Number: 0
 <1><d7d>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x86d60): HAL_StatusTypeDef
    <d82>   DW_AT_decl_file   : 6
    <d83>   DW_AT_decl_line   : 44
    <d84>   DW_AT_decl_column : 3
    <d85>   DW_AT_type        : <0xd56>
 <1><d89>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <d8a>   DW_AT_encoding    : 7	(unsigned)
    <d8b>   DW_AT_byte_size   : 1
    <d8c>   DW_AT_type        : <0x9f2>
    <d90>   DW_AT_decl_file   : 6
    <d91>   DW_AT_decl_line   : 50
    <d92>   DW_AT_decl_column : 1
    <d93>   DW_AT_sibling     : <0xda4>
 <2><d97>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d98>   DW_AT_name        : (indirect string, offset: 0x88c00): HAL_UNLOCKED
    <d9c>   DW_AT_const_value : 0
 <2><d9d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d9e>   DW_AT_name        : (indirect string, offset: 0x898ae): HAL_LOCKED
    <da2>   DW_AT_const_value : 1
 <2><da3>: Abbrev Number: 0
 <1><da4>: Abbrev Number: 3 (DW_TAG_typedef)
    <da5>   DW_AT_name        : (indirect string, offset: 0x88679): HAL_LockTypeDef
    <da9>   DW_AT_decl_file   : 6
    <daa>   DW_AT_decl_line   : 53
    <dab>   DW_AT_decl_column : 3
    <dac>   DW_AT_type        : <0xd89>
 <1><db0>: Abbrev Number: 12 (DW_TAG_structure_type)
    <db1>   DW_AT_byte_size   : 12
    <db2>   DW_AT_decl_file   : 7
    <db3>   DW_AT_decl_line   : 47
    <db4>   DW_AT_decl_column : 9
    <db5>   DW_AT_sibling     : <0xde1>
 <2><db9>: Abbrev Number: 13 (DW_TAG_member)
    <dba>   DW_AT_name        : (indirect string, offset: 0x889d5): PLLState
    <dbe>   DW_AT_decl_file   : 7
    <dbf>   DW_AT_decl_line   : 49
    <dc0>   DW_AT_decl_column : 12
    <dc1>   DW_AT_type        : <0xa61>
    <dc5>   DW_AT_data_member_location: 0
 <2><dc6>: Abbrev Number: 13 (DW_TAG_member)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x889f6): PLLSource
    <dcb>   DW_AT_decl_file   : 7
    <dcc>   DW_AT_decl_line   : 52
    <dcd>   DW_AT_decl_column : 12
    <dce>   DW_AT_type        : <0xa61>
    <dd2>   DW_AT_data_member_location: 4
 <2><dd3>: Abbrev Number: 13 (DW_TAG_member)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x894df): PLLMUL
    <dd8>   DW_AT_decl_file   : 7
    <dd9>   DW_AT_decl_line   : 55
    <dda>   DW_AT_decl_column : 12
    <ddb>   DW_AT_type        : <0xa61>
    <ddf>   DW_AT_data_member_location: 8
 <2><de0>: Abbrev Number: 0
 <1><de1>: Abbrev Number: 3 (DW_TAG_typedef)
    <de2>   DW_AT_name        : (indirect string, offset: 0x8869b): RCC_PLLInitTypeDef
    <de6>   DW_AT_decl_file   : 7
    <de7>   DW_AT_decl_line   : 57
    <de8>   DW_AT_decl_column : 3
    <de9>   DW_AT_type        : <0xdb0>
 <1><ded>: Abbrev Number: 12 (DW_TAG_structure_type)
    <dee>   DW_AT_byte_size   : 20
    <def>   DW_AT_decl_file   : 7
    <df0>   DW_AT_decl_line   : 62
    <df1>   DW_AT_decl_column : 9
    <df2>   DW_AT_sibling     : <0xe38>
 <2><df6>: Abbrev Number: 13 (DW_TAG_member)
    <df7>   DW_AT_name        : (indirect string, offset: 0x877c6): ClockType
    <dfb>   DW_AT_decl_file   : 7
    <dfc>   DW_AT_decl_line   : 64
    <dfd>   DW_AT_decl_column : 12
    <dfe>   DW_AT_type        : <0xa61>
    <e02>   DW_AT_data_member_location: 0
 <2><e03>: Abbrev Number: 13 (DW_TAG_member)
    <e04>   DW_AT_name        : (indirect string, offset: 0x8868e): SYSCLKSource
    <e08>   DW_AT_decl_file   : 7
    <e09>   DW_AT_decl_line   : 67
    <e0a>   DW_AT_decl_column : 12
    <e0b>   DW_AT_type        : <0xa61>
    <e0f>   DW_AT_data_member_location: 4
 <2><e10>: Abbrev Number: 13 (DW_TAG_member)
    <e11>   DW_AT_name        : (indirect string, offset: 0x89104): AHBCLKDivider
    <e15>   DW_AT_decl_file   : 7
    <e16>   DW_AT_decl_line   : 70
    <e17>   DW_AT_decl_column : 12
    <e18>   DW_AT_type        : <0xa61>
    <e1c>   DW_AT_data_member_location: 8
 <2><e1d>: Abbrev Number: 13 (DW_TAG_member)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x86e65): APB1CLKDivider
    <e22>   DW_AT_decl_file   : 7
    <e23>   DW_AT_decl_line   : 73
    <e24>   DW_AT_decl_column : 12
    <e25>   DW_AT_type        : <0xa61>
    <e29>   DW_AT_data_member_location: 12
 <2><e2a>: Abbrev Number: 13 (DW_TAG_member)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x87ee1): APB2CLKDivider
    <e2f>   DW_AT_decl_file   : 7
    <e30>   DW_AT_decl_line   : 76
    <e31>   DW_AT_decl_column : 12
    <e32>   DW_AT_type        : <0xa61>
    <e36>   DW_AT_data_member_location: 16
 <2><e37>: Abbrev Number: 0
 <1><e38>: Abbrev Number: 3 (DW_TAG_typedef)
    <e39>   DW_AT_name        : (indirect string, offset: 0x877d0): RCC_ClkInitTypeDef
    <e3d>   DW_AT_decl_file   : 7
    <e3e>   DW_AT_decl_line   : 78
    <e3f>   DW_AT_decl_column : 3
    <e40>   DW_AT_type        : <0xded>
 <1><e44>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e45>   DW_AT_byte_size   : 40
    <e46>   DW_AT_decl_file   : 8
    <e47>   DW_AT_decl_line   : 226
    <e48>   DW_AT_decl_column : 9
    <e49>   DW_AT_sibling     : <0xeb6>
 <2><e4d>: Abbrev Number: 13 (DW_TAG_member)
    <e4e>   DW_AT_name        : (indirect string, offset: 0x86f7b): OscillatorType
    <e52>   DW_AT_decl_file   : 8
    <e53>   DW_AT_decl_line   : 228
    <e54>   DW_AT_decl_column : 12
    <e55>   DW_AT_type        : <0xa61>
    <e59>   DW_AT_data_member_location: 0
 <2><e5a>: Abbrev Number: 13 (DW_TAG_member)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x889ed): HSEState
    <e5f>   DW_AT_decl_file   : 8
    <e60>   DW_AT_decl_line   : 236
    <e61>   DW_AT_decl_column : 12
    <e62>   DW_AT_type        : <0xa61>
    <e66>   DW_AT_data_member_location: 4
 <2><e67>: Abbrev Number: 13 (DW_TAG_member)
    <e68>   DW_AT_name        : (indirect string, offset: 0x889de): HSEPredivValue
    <e6c>   DW_AT_decl_file   : 8
    <e6d>   DW_AT_decl_line   : 239
    <e6e>   DW_AT_decl_column : 12
    <e6f>   DW_AT_type        : <0xa61>
    <e73>   DW_AT_data_member_location: 8
 <2><e74>: Abbrev Number: 13 (DW_TAG_member)
    <e75>   DW_AT_name        : (indirect string, offset: 0x8898b): LSEState
    <e79>   DW_AT_decl_file   : 8
    <e7a>   DW_AT_decl_line   : 242
    <e7b>   DW_AT_decl_column : 12
    <e7c>   DW_AT_type        : <0xa61>
    <e80>   DW_AT_data_member_location: 12
 <2><e81>: Abbrev Number: 13 (DW_TAG_member)
    <e82>   DW_AT_name        : (indirect string, offset: 0x87ecb): HSIState
    <e86>   DW_AT_decl_file   : 8
    <e87>   DW_AT_decl_line   : 245
    <e88>   DW_AT_decl_column : 12
    <e89>   DW_AT_type        : <0xa61>
    <e8d>   DW_AT_data_member_location: 16
 <2><e8e>: Abbrev Number: 13 (DW_TAG_member)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x892a1): HSICalibrationValue
    <e93>   DW_AT_decl_file   : 8
    <e94>   DW_AT_decl_line   : 248
    <e95>   DW_AT_decl_column : 12
    <e96>   DW_AT_type        : <0xa61>
    <e9a>   DW_AT_data_member_location: 20
 <2><e9b>: Abbrev Number: 13 (DW_TAG_member)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x89497): LSIState
    <ea0>   DW_AT_decl_file   : 8
    <ea1>   DW_AT_decl_line   : 251
    <ea2>   DW_AT_decl_column : 12
    <ea3>   DW_AT_type        : <0xa61>
    <ea7>   DW_AT_data_member_location: 24
 <2><ea8>: Abbrev Number: 14 (DW_TAG_member)
    <ea9>   DW_AT_name        : PLL
    <ead>   DW_AT_decl_file   : 8
    <eae>   DW_AT_decl_line   : 254
    <eaf>   DW_AT_decl_column : 22
    <eb0>   DW_AT_type        : <0xde1>
    <eb4>   DW_AT_data_member_location: 28
 <2><eb5>: Abbrev Number: 0
 <1><eb6>: Abbrev Number: 9 (DW_TAG_typedef)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x88253): RCC_OscInitTypeDef
    <ebb>   DW_AT_decl_file   : 8
    <ebc>   DW_AT_decl_line   : 259
    <ebe>   DW_AT_decl_column : 3
    <ebf>   DW_AT_type        : <0xe44>
 <1><ec3>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ec4>   DW_AT_byte_size   : 16
    <ec5>   DW_AT_decl_file   : 9
    <ec6>   DW_AT_decl_line   : 46
    <ec7>   DW_AT_decl_column : 9
    <ec8>   DW_AT_sibling     : <0xf01>
 <2><ecc>: Abbrev Number: 14 (DW_TAG_member)
    <ecd>   DW_AT_name        : Pin
    <ed1>   DW_AT_decl_file   : 9
    <ed2>   DW_AT_decl_line   : 48
    <ed3>   DW_AT_decl_column : 12
    <ed4>   DW_AT_type        : <0xa61>
    <ed8>   DW_AT_data_member_location: 0
 <2><ed9>: Abbrev Number: 13 (DW_TAG_member)
    <eda>   DW_AT_name        : (indirect string, offset: 0x8af3b): Mode
    <ede>   DW_AT_decl_file   : 9
    <edf>   DW_AT_decl_line   : 51
    <ee0>   DW_AT_decl_column : 12
    <ee1>   DW_AT_type        : <0xa61>
    <ee5>   DW_AT_data_member_location: 4
 <2><ee6>: Abbrev Number: 13 (DW_TAG_member)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x86e32): Pull
    <eeb>   DW_AT_decl_file   : 9
    <eec>   DW_AT_decl_line   : 54
    <eed>   DW_AT_decl_column : 12
    <eee>   DW_AT_type        : <0xa61>
    <ef2>   DW_AT_data_member_location: 8
 <2><ef3>: Abbrev Number: 13 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x885fa): Speed
    <ef8>   DW_AT_decl_file   : 9
    <ef9>   DW_AT_decl_line   : 57
    <efa>   DW_AT_decl_column : 12
    <efb>   DW_AT_type        : <0xa61>
    <eff>   DW_AT_data_member_location: 12
 <2><f00>: Abbrev Number: 0
 <1><f01>: Abbrev Number: 3 (DW_TAG_typedef)
    <f02>   DW_AT_name        : (indirect string, offset: 0x8954a): GPIO_InitTypeDef
    <f06>   DW_AT_decl_file   : 9
    <f07>   DW_AT_decl_line   : 59
    <f08>   DW_AT_decl_column : 3
    <f09>   DW_AT_type        : <0xec3>
 <1><f0d>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <f0e>   DW_AT_encoding    : 7	(unsigned)
    <f0f>   DW_AT_byte_size   : 1
    <f10>   DW_AT_type        : <0x9f2>
    <f14>   DW_AT_decl_file   : 9
    <f15>   DW_AT_decl_line   : 65
    <f16>   DW_AT_decl_column : 1
    <f17>   DW_AT_sibling     : <0xf28>
 <2><f1b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f1c>   DW_AT_name        : (indirect string, offset: 0x874ad): GPIO_PIN_RESET
    <f20>   DW_AT_const_value : 0
 <2><f21>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f22>   DW_AT_name        : (indirect string, offset: 0x871f5): GPIO_PIN_SET
    <f26>   DW_AT_const_value : 1
 <2><f27>: Abbrev Number: 0
 <1><f28>: Abbrev Number: 3 (DW_TAG_typedef)
    <f29>   DW_AT_name        : (indirect string, offset: 0x89722): GPIO_PinState
    <f2d>   DW_AT_decl_file   : 9
    <f2e>   DW_AT_decl_line   : 68
    <f2f>   DW_AT_decl_column : 3
    <f30>   DW_AT_type        : <0xf0d>
 <1><f34>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f35>   DW_AT_byte_size   : 28
    <f36>   DW_AT_decl_file   : 10
    <f37>   DW_AT_decl_line   : 47
    <f38>   DW_AT_decl_column : 9
    <f39>   DW_AT_sibling     : <0xf99>
 <2><f3d>: Abbrev Number: 13 (DW_TAG_member)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x87ac5): Direction
    <f42>   DW_AT_decl_file   : 10
    <f43>   DW_AT_decl_line   : 49
    <f44>   DW_AT_decl_column : 12
    <f45>   DW_AT_type        : <0xa61>
    <f49>   DW_AT_data_member_location: 0
 <2><f4a>: Abbrev Number: 13 (DW_TAG_member)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x86f9a): PeriphInc
    <f4f>   DW_AT_decl_file   : 10
    <f50>   DW_AT_decl_line   : 53
    <f51>   DW_AT_decl_column : 12
    <f52>   DW_AT_type        : <0xa61>
    <f56>   DW_AT_data_member_location: 4
 <2><f57>: Abbrev Number: 13 (DW_TAG_member)
    <f58>   DW_AT_name        : (indirect string, offset: 0x871bd): MemInc
    <f5c>   DW_AT_decl_file   : 10
    <f5d>   DW_AT_decl_line   : 56
    <f5e>   DW_AT_decl_column : 12
    <f5f>   DW_AT_type        : <0xa61>
    <f63>   DW_AT_data_member_location: 8
 <2><f64>: Abbrev Number: 13 (DW_TAG_member)
    <f65>   DW_AT_name        : (indirect string, offset: 0x880df): PeriphDataAlignment
    <f69>   DW_AT_decl_file   : 10
    <f6a>   DW_AT_decl_line   : 59
    <f6b>   DW_AT_decl_column : 12
    <f6c>   DW_AT_type        : <0xa61>
    <f70>   DW_AT_data_member_location: 12
 <2><f71>: Abbrev Number: 13 (DW_TAG_member)
    <f72>   DW_AT_name        : (indirect string, offset: 0x894e6): MemDataAlignment
    <f76>   DW_AT_decl_file   : 10
    <f77>   DW_AT_decl_line   : 62
    <f78>   DW_AT_decl_column : 12
    <f79>   DW_AT_type        : <0xa61>
    <f7d>   DW_AT_data_member_location: 16
 <2><f7e>: Abbrev Number: 13 (DW_TAG_member)
    <f7f>   DW_AT_name        : (indirect string, offset: 0x8af3b): Mode
    <f83>   DW_AT_decl_file   : 10
    <f84>   DW_AT_decl_line   : 65
    <f85>   DW_AT_decl_column : 12
    <f86>   DW_AT_type        : <0xa61>
    <f8a>   DW_AT_data_member_location: 20
 <2><f8b>: Abbrev Number: 13 (DW_TAG_member)
    <f8c>   DW_AT_name        : (indirect string, offset: 0x8a277): Priority
    <f90>   DW_AT_decl_file   : 10
    <f91>   DW_AT_decl_line   : 70
    <f92>   DW_AT_decl_column : 12
    <f93>   DW_AT_type        : <0xa61>
    <f97>   DW_AT_data_member_location: 24
 <2><f98>: Abbrev Number: 0
 <1><f99>: Abbrev Number: 3 (DW_TAG_typedef)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x8767b): DMA_InitTypeDef
    <f9e>   DW_AT_decl_file   : 10
    <f9f>   DW_AT_decl_line   : 72
    <fa0>   DW_AT_decl_column : 3
    <fa1>   DW_AT_type        : <0xf34>
 <1><fa5>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <fa6>   DW_AT_encoding    : 7	(unsigned)
    <fa7>   DW_AT_byte_size   : 1
    <fa8>   DW_AT_type        : <0x9f2>
    <fac>   DW_AT_decl_file   : 10
    <fad>   DW_AT_decl_line   : 78
    <fae>   DW_AT_decl_column : 1
    <faf>   DW_AT_sibling     : <0xfcc>
 <2><fb3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fb4>   DW_AT_name        : (indirect string, offset: 0x88c9e): HAL_DMA_STATE_RESET
    <fb8>   DW_AT_const_value : 0
 <2><fb9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fba>   DW_AT_name        : (indirect string, offset: 0x87696): HAL_DMA_STATE_READY
    <fbe>   DW_AT_const_value : 1
 <2><fbf>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fc0>   DW_AT_name        : (indirect string, offset: 0x88a3c): HAL_DMA_STATE_BUSY
    <fc4>   DW_AT_const_value : 2
 <2><fc5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fc6>   DW_AT_name        : (indirect string, offset: 0x89730): HAL_DMA_STATE_TIMEOUT
    <fca>   DW_AT_const_value : 3
 <2><fcb>: Abbrev Number: 0
 <1><fcc>: Abbrev Number: 3 (DW_TAG_typedef)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x889c0): HAL_DMA_StateTypeDef
    <fd1>   DW_AT_decl_file   : 10
    <fd2>   DW_AT_decl_line   : 83
    <fd3>   DW_AT_decl_column : 2
    <fd4>   DW_AT_type        : <0xfa5>
 <1><fd8>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fd9>   DW_AT_type        : <0xfcc>
 <1><fdd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <fde>   DW_AT_name        : (indirect string, offset: 0x89274): __DMA_HandleTypeDef
    <fe2>   DW_AT_byte_size   : 68
    <fe3>   DW_AT_decl_file   : 10
    <fe4>   DW_AT_decl_line   : 110
    <fe5>   DW_AT_decl_column : 16
    <fe6>   DW_AT_sibling     : <0x1087>
 <2><fea>: Abbrev Number: 13 (DW_TAG_member)
    <feb>   DW_AT_name        : (indirect string, offset: 0x87b84): Instance
    <fef>   DW_AT_decl_file   : 10
    <ff0>   DW_AT_decl_line   : 112
    <ff1>   DW_AT_decl_column : 31
    <ff2>   DW_AT_type        : <0x1087>
    <ff6>   DW_AT_data_member_location: 0
 <2><ff7>: Abbrev Number: 13 (DW_TAG_member)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x8ad22): Init
    <ffc>   DW_AT_decl_file   : 10
    <ffd>   DW_AT_decl_line   : 114
    <ffe>   DW_AT_decl_column : 30
    <fff>   DW_AT_type        : <0xf99>
    <1003>   DW_AT_data_member_location: 4
 <2><1004>: Abbrev Number: 13 (DW_TAG_member)
    <1005>   DW_AT_name        : (indirect string, offset: 0x605f8): Lock
    <1009>   DW_AT_decl_file   : 10
    <100a>   DW_AT_decl_line   : 116
    <100b>   DW_AT_decl_column : 30
    <100c>   DW_AT_type        : <0xda4>
    <1010>   DW_AT_data_member_location: 32
 <2><1011>: Abbrev Number: 13 (DW_TAG_member)
    <1012>   DW_AT_name        : (indirect string, offset: 0x889f0): State
    <1016>   DW_AT_decl_file   : 10
    <1017>   DW_AT_decl_line   : 118
    <1018>   DW_AT_decl_column : 30
    <1019>   DW_AT_type        : <0xfd8>
    <101d>   DW_AT_data_member_location: 33
 <2><101e>: Abbrev Number: 13 (DW_TAG_member)
    <101f>   DW_AT_name        : (indirect string, offset: 0x87856): Parent
    <1023>   DW_AT_decl_file   : 10
    <1024>   DW_AT_decl_line   : 120
    <1025>   DW_AT_decl_column : 31
    <1026>   DW_AT_type        : <0x108d>
    <102a>   DW_AT_data_member_location: 36
 <2><102b>: Abbrev Number: 13 (DW_TAG_member)
    <102c>   DW_AT_name        : (indirect string, offset: 0x8989d): XferCpltCallback
    <1030>   DW_AT_decl_file   : 10
    <1031>   DW_AT_decl_line   : 122
    <1032>   DW_AT_decl_column : 33
    <1033>   DW_AT_type        : <0x10a0>
    <1037>   DW_AT_data_member_location: 40
 <2><1038>: Abbrev Number: 13 (DW_TAG_member)
    <1039>   DW_AT_name        : (indirect string, offset: 0x88f2a): XferHalfCpltCallback
    <103d>   DW_AT_decl_file   : 10
    <103e>   DW_AT_decl_line   : 124
    <103f>   DW_AT_decl_column : 33
    <1040>   DW_AT_type        : <0x10a0>
    <1044>   DW_AT_data_member_location: 44
 <2><1045>: Abbrev Number: 13 (DW_TAG_member)
    <1046>   DW_AT_name        : (indirect string, offset: 0x8717d): XferErrorCallback
    <104a>   DW_AT_decl_file   : 10
    <104b>   DW_AT_decl_line   : 126
    <104c>   DW_AT_decl_column : 33
    <104d>   DW_AT_type        : <0x10a0>
    <1051>   DW_AT_data_member_location: 48
 <2><1052>: Abbrev Number: 13 (DW_TAG_member)
    <1053>   DW_AT_name        : (indirect string, offset: 0x89581): XferAbortCallback
    <1057>   DW_AT_decl_file   : 10
    <1058>   DW_AT_decl_line   : 128
    <1059>   DW_AT_decl_column : 33
    <105a>   DW_AT_type        : <0x10a0>
    <105e>   DW_AT_data_member_location: 52
 <2><105f>: Abbrev Number: 13 (DW_TAG_member)
    <1060>   DW_AT_name        : (indirect string, offset: 0x89718): ErrorCode
    <1064>   DW_AT_decl_file   : 10
    <1065>   DW_AT_decl_line   : 130
    <1066>   DW_AT_decl_column : 30
    <1067>   DW_AT_type        : <0xa6d>
    <106b>   DW_AT_data_member_location: 56
 <2><106c>: Abbrev Number: 13 (DW_TAG_member)
    <106d>   DW_AT_name        : (indirect string, offset: 0x87e39): DmaBaseAddress
    <1071>   DW_AT_decl_file   : 10
    <1072>   DW_AT_decl_line   : 132
    <1073>   DW_AT_decl_column : 31
    <1074>   DW_AT_type        : <0x10a6>
    <1078>   DW_AT_data_member_location: 60
 <2><1079>: Abbrev Number: 13 (DW_TAG_member)
    <107a>   DW_AT_name        : (indirect string, offset: 0x874bc): ChannelIndex
    <107e>   DW_AT_decl_file   : 10
    <107f>   DW_AT_decl_line   : 134
    <1080>   DW_AT_decl_column : 30
    <1081>   DW_AT_type        : <0xa61>
    <1085>   DW_AT_data_member_location: 64
 <2><1086>: Abbrev Number: 0
 <1><1087>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1088>   DW_AT_byte_size   : 4
    <1089>   DW_AT_type        : <0xab5>
 <1><108d>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <108e>   DW_AT_byte_size   : 4
 <1><108f>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <1090>   DW_AT_prototyped  : 1
    <1090>   DW_AT_sibling     : <0x109a>
 <2><1094>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1095>   DW_AT_type        : <0x109a>
 <2><1099>: Abbrev Number: 0
 <1><109a>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <109b>   DW_AT_byte_size   : 4
    <109c>   DW_AT_type        : <0xfdd>
 <1><10a0>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <10a1>   DW_AT_byte_size   : 4
    <10a2>   DW_AT_type        : <0x108f>
 <1><10a6>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <10a7>   DW_AT_byte_size   : 4
    <10a8>   DW_AT_type        : <0xae9>
 <1><10ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <10ad>   DW_AT_name        : (indirect string, offset: 0x89276): DMA_HandleTypeDef
    <10b1>   DW_AT_decl_file   : 10
    <10b2>   DW_AT_decl_line   : 136
    <10b3>   DW_AT_decl_column : 3
    <10b4>   DW_AT_type        : <0xfdd>
 <1><10b8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <10b9>   DW_AT_byte_size   : 24
    <10ba>   DW_AT_decl_file   : 11
    <10bb>   DW_AT_decl_line   : 46
    <10bc>   DW_AT_decl_column : 9
    <10bd>   DW_AT_sibling     : <0x1110>
 <2><10c1>: Abbrev Number: 13 (DW_TAG_member)
    <10c2>   DW_AT_name        : (indirect string, offset: 0x89c6a): Prescaler
    <10c6>   DW_AT_decl_file   : 11
    <10c7>   DW_AT_decl_line   : 48
    <10c8>   DW_AT_decl_column : 12
    <10c9>   DW_AT_type        : <0xa61>
    <10cd>   DW_AT_data_member_location: 0
 <2><10ce>: Abbrev Number: 13 (DW_TAG_member)
    <10cf>   DW_AT_name        : (indirect string, offset: 0x8950a): CounterMode
    <10d3>   DW_AT_decl_file   : 11
    <10d4>   DW_AT_decl_line   : 51
    <10d5>   DW_AT_decl_column : 12
    <10d6>   DW_AT_type        : <0xa61>
    <10da>   DW_AT_data_member_location: 4
 <2><10db>: Abbrev Number: 13 (DW_TAG_member)
    <10dc>   DW_AT_name        : (indirect string, offset: 0x88f3f): Period
    <10e0>   DW_AT_decl_file   : 11
    <10e1>   DW_AT_decl_line   : 54
    <10e2>   DW_AT_decl_column : 12
    <10e3>   DW_AT_type        : <0xa61>
    <10e7>   DW_AT_data_member_location: 8
 <2><10e8>: Abbrev Number: 13 (DW_TAG_member)
    <10e9>   DW_AT_name        : (indirect string, offset: 0x87c1f): ClockDivision
    <10ed>   DW_AT_decl_file   : 11
    <10ee>   DW_AT_decl_line   : 58
    <10ef>   DW_AT_decl_column : 12
    <10f0>   DW_AT_type        : <0xa61>
    <10f4>   DW_AT_data_member_location: 12
 <2><10f5>: Abbrev Number: 13 (DW_TAG_member)
    <10f6>   DW_AT_name        : (indirect string, offset: 0x88b7a): RepetitionCounter
    <10fa>   DW_AT_decl_file   : 11
    <10fb>   DW_AT_decl_line   : 61
    <10fc>   DW_AT_decl_column : 12
    <10fd>   DW_AT_type        : <0xa61>
    <1101>   DW_AT_data_member_location: 16
 <2><1102>: Abbrev Number: 13 (DW_TAG_member)
    <1103>   DW_AT_name        : (indirect string, offset: 0x86ff6): AutoReloadPreload
    <1107>   DW_AT_decl_file   : 11
    <1108>   DW_AT_decl_line   : 72
    <1109>   DW_AT_decl_column : 12
    <110a>   DW_AT_type        : <0xa61>
    <110e>   DW_AT_data_member_location: 20
 <2><110f>: Abbrev Number: 0
 <1><1110>: Abbrev Number: 3 (DW_TAG_typedef)
    <1111>   DW_AT_name        : (indirect string, offset: 0x894ca): TIM_Base_InitTypeDef
    <1115>   DW_AT_decl_file   : 11
    <1116>   DW_AT_decl_line   : 74
    <1117>   DW_AT_decl_column : 3
    <1118>   DW_AT_type        : <0x10b8>
 <1><111c>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <111d>   DW_AT_encoding    : 7	(unsigned)
    <111e>   DW_AT_byte_size   : 1
    <111f>   DW_AT_type        : <0x9f2>
    <1123>   DW_AT_decl_file   : 11
    <1124>   DW_AT_decl_line   : 291
    <1126>   DW_AT_decl_column : 1
    <1127>   DW_AT_sibling     : <0x114a>
 <2><112b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <112c>   DW_AT_name        : (indirect string, offset: 0x88131): HAL_TIM_STATE_RESET
    <1130>   DW_AT_const_value : 0
 <2><1131>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1132>   DW_AT_name        : (indirect string, offset: 0x86e51): HAL_TIM_STATE_READY
    <1136>   DW_AT_const_value : 1
 <2><1137>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1138>   DW_AT_name        : (indirect string, offset: 0x8760f): HAL_TIM_STATE_BUSY
    <113c>   DW_AT_const_value : 2
 <2><113d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <113e>   DW_AT_name        : (indirect string, offset: 0x891f5): HAL_TIM_STATE_TIMEOUT
    <1142>   DW_AT_const_value : 3
 <2><1143>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1144>   DW_AT_name        : (indirect string, offset: 0x87a91): HAL_TIM_STATE_ERROR
    <1148>   DW_AT_const_value : 4
 <2><1149>: Abbrev Number: 0
 <1><114a>: Abbrev Number: 9 (DW_TAG_typedef)
    <114b>   DW_AT_name        : (indirect string, offset: 0x88b96): HAL_TIM_StateTypeDef
    <114f>   DW_AT_decl_file   : 11
    <1150>   DW_AT_decl_line   : 297
    <1152>   DW_AT_decl_column : 3
    <1153>   DW_AT_type        : <0x111c>
 <1><1157>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1158>   DW_AT_type        : <0x114a>
 <1><115c>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <115d>   DW_AT_encoding    : 7	(unsigned)
    <115e>   DW_AT_byte_size   : 1
    <115f>   DW_AT_type        : <0x9f2>
    <1163>   DW_AT_decl_file   : 11
    <1164>   DW_AT_decl_line   : 303
    <1166>   DW_AT_decl_column : 1
    <1167>   DW_AT_sibling     : <0x117e>
